[
  {
    "title": "Using plus(+) sign with OFN and CSEmailMessage Parameter",
    "author": "Jorji Macatangay",
    "product": "Conga_Composer",
    "content": "Would be useful if we have a way to be able to include plus(+) sign in OFN and Email Body (CSEmailMessage) Parameters without it changing into a SPACE.  Using URLENCODE (%2B) but this does not work.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Hello Jorji, thank you for submitting this idea! The handling of special characters in button code is determined by Salesforce. Specifically, in the case of buttons, the plus symbol is used to represent spaces. Even when using the URLENCODE function, Salesforce converts a space into a plus symbol as part of its URL encoding process (source: https://help.salesforce.com/s/articleView?id=sf.customize_functions_urlencode.htm&type=5)\nUnfortunately, until an alternative method is provided for using plus symbols differently, we won’t be able to consider this change for future implementation.\nThank you for your understanding."
      }
    ]
  },
  {
    "title": "Support for Multiple Template Versions in OneDrive Integration",
    "author": "Dan John",
    "product": "Conga_Composer",
    "content": "I would like to submit a feature request based on a scenario reported by a user involving template generation and file upload processes with Salesforce and OneDrive.\nScenario:\nFirst Run:\nThe button is executed in Salesforce using a template.No fields in the Salesforce record are updated during this run.The template is generated and saved to OneDrive.\nSecond Run:\nThe button is executed again with the same template.During this run, fields in the Salesforce record (Home Phone, Work Phone, and Email) are updated.A new template is generated to reflect these updates.\nProblem: The updated template from the second run overwrites the previously saved template in OneDrive from the first run.\n \nUse Case: The user would like the ability to upload and preserve both versions of the template (from the first and second runs) in OneDrive. This functionality would enable storing multiple versions of the template, similar to how Salesforce manages multiple records or versions.\n \nRequest: Implement a feature to allow the preservation of multiple versions of templates in OneDrive, preventing overwrites and enabling version management.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to future consideration"
      }
    ]
  },
  {
    "title": "Using plus(+) sign with OFN and CSEmailMessage Parameter",
    "author": "Jorji Macatangay",
    "product": "Conga_Composer",
    "content": "Would be useful if we have a way to be able to include plus(+) sign in OFN and Email Body (CSEmailMessage) Parameters without it changing into a SPACE.  Using URLENCODE (%2B) but this does not work.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Hello Jorji, thank you for submitting this idea! The handling of special characters in button code is determined by Salesforce. Specifically, in the case of buttons, the plus symbol is used to represent spaces. Even when using the URLENCODE function, Salesforce converts a space into a plus symbol as part of its URL encoding process (source: https://help.salesforce.com/s/articleView?id=sf.customize_functions_urlencode.htm&type=5)\nUnfortunately, until an alternative method is provided for using plus symbols differently, we won’t be able to consider this change for future implementation.\nThank you for your understanding."
      }
    ]
  },
  {
    "title": "Support for Multiple Template Versions in OneDrive Integration",
    "author": "Dan John",
    "product": "Conga_Composer",
    "content": "I would like to submit a feature request based on a scenario reported by a user involving template generation and file upload processes with Salesforce and OneDrive.\nScenario:\nFirst Run:\nThe button is executed in Salesforce using a template.No fields in the Salesforce record are updated during this run.The template is generated and saved to OneDrive.\nSecond Run:\nThe button is executed again with the same template.During this run, fields in the Salesforce record (Home Phone, Work Phone, and Email) are updated.A new template is generated to reflect these updates.\nProblem: The updated template from the second run overwrites the previously saved template in OneDrive from the first run.\n \nUse Case: The user would like the ability to upload and preserve both versions of the template (from the first and second runs) in OneDrive. This functionality would enable storing multiple versions of the template, similar to how Salesforce manages multiple records or versions.\n \nRequest: Implement a feature to allow the preservation of multiple versions of templates in OneDrive, preventing overwrites and enabling version management.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to future consideration"
      }
    ]
  },
  {
    "title": "Merge a text that contains '&#number' as a literal text instead of an ASCII Character/Symbol",
    "author": "Maybeleen Matammu",
    "product": "Conga_Composer",
    "content": "The Conga Email Template renders a '&#number' character sequence into a symbol. Currently, there's no straightforward solution to merge it as a literal text.\nhttps://help.salesforce.com/s/articleView?id=sf.mc_es_ascii_characters.htm&type=5\n \nHere are workarounds:\n1. Use the HTML number that would render the ampersand or the hashtag symbol.\n2. Merge the text into a document rather than in a Conga Email Template. This way, the characters will be merged as literal text in the document.\n3. Use a Salesforce Email Template instead of a Conga Email Template. This will also merge the characters as a literal text.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to future consideration"
      }
    ]
  },
  {
    "title": "Make Live Edit view less confusing",
    "author": "Jorji Macatangay",
    "product": "Conga_Composer",
    "content": "The live edit view does not display the document template accurately. It would be beneficial for users to be able to see the template correctly. For example, being able to expand the window would make it easier to edit the template for data that are meant to be updated manually with Live Edit view.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to future consideration."
      }
    ]
  },
  {
    "title": "Ability to remove Upload Files in Conga Sign",
    "author": "Sabina Barleaza",
    "product": "Conga_Composer",
    "content": "At the moment, users can upload files when using Conga Sign, unless the solution is run in background mode (DS7). However, it would be incredibly useful to allow users to amend the email text, signatories, expiration dates etc, without enabling the uploading additional files from their computers. Could this please be considered for a future release?",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration."
      }
    ]
  },
  {
    "title": "Conga Email Template Format",
    "author": "Flownie Nunez",
    "product": "Conga_Composer",
    "content": "The Conga Email Template format doesn't align with the Composer User Interface, which means you'll need to use the Advanced Editor to achieve the desired format. This process can be quite inconvenient and might complicate your workflow.\n \nWhat format we want:\n \n\n \nAnd this is what showing in the Composer User Interface: (Arrows are the big line breaks or gaps)",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to \"Future consideration\""
      }
    ]
  },
  {
    "title": "Ability to retrieve template names which are being selected when 'selecttemplates' parameter is used",
    "author": "Chaitanya Taneja",
    "product": "Conga_Composer",
    "content": "The account 'Persistent Systems Ltd - India (Partner)' has a requirement where they need to add the template names in the table of contents. The templates are selected before merging via the selecttemplates screen.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, we will be deferring at this time"
      }
    ]
  },
  {
    "title": "TableHide creates unwanted Paragraph spacing when tables are hidden",
    "author": "Brandon Cole",
    "product": "Conga_Composer",
    "content": "Hello!\n \nOne of our customers has requested a modification to the TableHide function to prevent additional line spacing for hidden tables. For example, if a template contains five tables and two are merged while three are hidden, the hidden tables create three paragraph spaces between the merged tables.\n \nCurrently, this is the expected functionality, but it is causing undesired spacing within the customer's template.\n \nPlease consider addressing this in future deployments.\n \nThank you!",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration."
      }
    ]
  },
  {
    "title": "Ability for Conga to skip Pagebreak",
    "author": "Dan John",
    "product": "Conga_Composer",
    "content": "Requesting for a workarounf where PageBreak can be used with TableHide just like it can be used with TableGroup. Second option while reading template, Conga skip pagebreak of word document",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration."
      }
    ]
  },
  {
    "title": "Better Error Tracking when update button fails on Conga Solution",
    "author": "Dan John",
    "product": "Conga_Composer",
    "content": "Currently when trying to update a button, clicking the update button just makes the screen go blank and go act like nothing happened. No error message of validation error or any error tracking message related to the update button failing. This makes the customer confused as to what causes the error, if wither the URL, syntax or system change.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Need composer to remove the string \"APXTConga4__\" on strings on the Advanced Configuration filter when creating a solution",
    "author": "Dan John",
    "product": "Conga_Composer",
    "content": "When adding pv Values on a query using Advanced Configuration Filter on Solution, it shows a string \"APXTConga4__\" in between the API Name.\n \nThis produces an error which says :\nConga_Composer_button (Current Button URL) does not match the Button URL in Progress field.Clicking \"Update Button\" will overwrite the Current Button URL. An archive of the Current Button URL will be created in the Button Archive.\n \nneed to remove the string as it does not let the solution be saved.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Ability to add charts and graphs",
    "author": "Chaitanya Taneja",
    "product": "Conga_Composer",
    "content": "It would be a great functionality to add charts and graphs data into the template from Salesforce with Composer.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Option to separate merged Conga Templates to Attachment files",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "When sending email through Salesforce, the merged Conga Template should be a different file from the Attachments fetched by Composer from related records(Salesforce File).",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, we are deferring at this time."
      }
    ]
  },
  {
    "title": "Option to separate merged Conga Templates to Attachment files",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "When sending email through Salesforce, the merged Conga Template/s should be a different file from the Attachments fetched by Composer from related records(Salesforce File).",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "This is a duplicate. Will respond on original request."
      }
    ]
  },
  {
    "title": "DocuSign Custom Field Values Populating in the DocuSign for Salesforce UI",
    "author": "Atta Mmorosa",
    "product": "Conga_Composer",
    "content": "Customer would like to have the values automatically populate in the DocuSign SF UI.\n \nCurrent Limitation from this article - DocuSignCustomFieldValue (conga.com)\nThis parameter updates a field value on the DocuSign Envelope record in Salesforce. It does not update any fields in the Docusign for Salesforce UI.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Return to Quote missing on Quote-Compose page",
    "author": "Nishil Desai",
    "product": "Conga_Composer",
    "content": "On Quote, once I click \"Merge and Email\" to generate a proposal document using Composer, there is no way to return to Quote record except using Browser back button which is prohibited at Clarivate as best practice.\nSteps to Reproduce:\n1. Create a Quote. \n2. Click on Generate Proposal.\n3. Click on \"Merge and Email\". This will show \"Conga Email\" page where user can specify who to send to and click \"Send Email\" to send/email the generated proposal doc .\n4. This page does not have any back/return to Quote button. The only way for user to return to that Quote is using browser back button. At Clarivate, in general users are prohibited from using the browser back button and it is not a good user experience.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Nishil Desai",
        "content": "Thanks Brian"
      },
      {
        "commenter": "Brian Farr",
        "content": "Hello Nishil - Thank you for submitting this idea. We have begun a refresh of our UI/UX experience for Composer and will make sure to include this functionality in a future release."
      }
    ]
  },
  {
    "title": "Update the current character limit for parameter values.",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "Looking to have the current 255 character limit extended to a higher number for the Value field in the Conga Solution Parameter managed object.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Hello - we will address this in a future update to Compsoer solution builder. We are targeting first half of 2025. Thank you for submitting this idea!"
      }
    ]
  },
  {
    "title": "Conga Query Builder bugs out when object has too many fields",
    "author": "Jorji Macatangay",
    "product": "Conga_Composer",
    "content": "There have been reports of the Conga Query Builder timing out during the third step when the selected base object has many fields. In some cases, users have reported receiving an error message stating \"composer.congamerge.com refused to connect.\" In contrast, others have received a message saying \"Limit to 25 related lookup fields\" at the bottom of the page.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration."
      }
    ]
  },
  {
    "title": "Product Limitation: Composer - Quote Generate Proposal Cancel or Back button not visible",
    "author": "Rahul Karwal",
    "product": "Conga_Composer",
    "content": "When I click on Generate proposal and then Merge and Email, it takes me to below page. There is no Back or Cancel button to go back to Quote. Also, this page is not Lightening page.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration."
      }
    ]
  },
  {
    "title": "Array Functionality supported in Composer",
    "author": "Micala Merino",
    "product": "Conga_Composer",
    "content": "Array functionality was introduced to Excel in 2020 and having Composer be able to support arrays would help simplify redundant macro functionality that has to be added to reports generated with excel templates.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Zoom feature in DS7Preview screen",
    "author": "Chaitanya Taneja",
    "product": "Conga_Composer",
    "content": "The preview screen when using the DS7Preview parameter comes with Zoom maxed out already and the document is somewhat blurred, especially Excel output documents. It would be great if the Zoom feature would allow some more room for zooming and the document appears sharper.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Automatically close the Composer sub tab after merge process in SF service console",
    "author": "Maybeleen Matammu",
    "product": "Conga_Composer",
    "content": "Requesting this feature in the future by adding a parameter or a setting that automatically closes the Composer sub-tab when executed via SF Service Console.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Unsupported Excel Features",
    "author": "Emilio Sicad Jr.",
    "product": "Conga_Composer",
    "content": "Requesting the ability to use specific advanced Excel features in our templates to merge documents using Conga Composer. The features we would like to utilize are as follows:\n \nAdvanced Excel functions (VLOOKUPs, SUMIF(S), COUNTIF(S), IF(S), TEXTJOIN, etc.)\n \nThis is part of the Unsupported Excel Features (Documentation below)\nhttps://documentation.conga.com/composer/latest/salesforce/unsupported-excel-features-143198760.html",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration."
      }
    ]
  },
  {
    "title": "Conga Composer - Parameter that will determine Formatted Report and Detailed Report.",
    "author": "Brianson Alcantara",
    "product": "Conga_Composer",
    "content": "Details: Option to add a parameter that will distinguish between Formatted and Detailed Reports.\n \nBenefit: This will enable the customer to choose either the Formatted Report or the Detailed Report, providing the flexibility to select the preferred option.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to future consideration."
      }
    ]
  },
  {
    "title": "Bulk Download Conga Templates Files",
    "author": "Maybeleen Matammu",
    "product": "Conga_Composer",
    "content": "Consider developing a functionality that would allow users to download multiple files at once, especially the files uploaded in the Conga Templates records. This is possible in data export in Salesforce, however, this method is not straightforward and is time consuming.",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Steve Lloyd",
        "content": "Possible use case: conducting an audit of all templates currently in the system."
      },
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Create a Parameter to customize \"Return to [object]\" link during/after a merge.",
    "author": "Rueben Wichelhaus",
    "product": "Conga_Composer",
    "content": "When merging or on the page once completed, there's a link to return to object. We'd like for a parameter to be created to allow admins to direct that link to a specific site.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello we have the following two parameters you can leverage today:Return Path: https://documentation.conga.com/composer/latest/salesforce/returnpath-150506540.htmlAbsolute Return Path: https://documentation.conga.com/composer/latest/salesforce/absolutereturnpath-195698999.html"
      },
      {
        "commenter": "Magnus Karlsson",
        "content": "Great idea! Thank you for registering this on our behalf!"
      }
    ]
  },
  {
    "title": "Enhance User Experience with Dynamic Conga Authorization or Composer Screen Management",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Problem: In existing systems utilizing Conga Authorization or Composer, users often find the persistent display of the Conga screen cumbersome and disruptive to workflow.\n \nHypothesis: By implementing a feature to hide the Conga Authorization or Composer screen upon execution of designated buttons, we can streamline user interaction, reduce distractions, and enhance overall user satisfaction.\n \nAction: Develop functionality within the system that detects button execution and automatically hides the Conga Authorization or Composer screen, allowing users to focus on their primary tasks without interruption.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Word quotation error: Error! Unknown op code for conditional.",
    "author": "Team CESAR",
    "product": "Conga_Composer",
    "content": "When using if statements in Word templates, you might want to check whether the value is filled in Salesforce before inserting it.\nAn if formula in Word might look like this:\nIF \"{{HTML:INSTRUCTOR_QUALIFICATION }}\" = \"\" \"\" \"{{HTML:INSTRUCTOR_QUALIFICATION }}\"\n \nIf the value of instructor_qualification includes quotation marks (\") Word is throwing the following error: Error! Unknown op code for conditional. This is because the quote in the value is closing the if formula. It cannot be an option to change all values and replace double quotation marks with apostrophes.\n \nIt would be a great enhancement if Conga would find an option to also include values that include quotations in the if formulas of Word templates.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Displaying data from multiple objects which are not related directly",
    "author": "Sreenivasulu Sake",
    "product": "Conga_Composer",
    "content": "Hi Team,\n \nWe have a requirement from customer to download an excel in table format from multiple objects where there is no direct relation and we are not able to do that in Conga Composer.\nFrom Agreement Line we have to take the PPX data and query from mapping table(there is no direct relation) and repeat the data for different locations of the Agreement line. Can we have this feature in Conga Composer.\nAttaching the data below for reference",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Hello - yes, the Composer API can be called from any record in Salesforce and you can pass either SOQL queries (via Conga query records) or JOSN payload and then use Composer parameters to complete the merge operation. There is an API option to initiate the download as well."
      },
      {
        "commenter": "Sreenivasulu Sake",
        "content": "Hi Brian Farr, Thanks for the update. Can we call the Composer API from any Salesforce record detail page(like on-click of a button or URL) with JSON data prepared and download the template?"
      },
      {
        "commenter": "Brian Farr",
        "content": "Thank you for your submission. Have you tried using the Composer API to ingest a JSON payload that would contain all the data needed in a single request. It would require your development to include the creation of the JSON payload, but it should be feasible with that approach."
      },
      {
        "commenter": "Sreenivasulu Sake",
        "content": "Please ignore the above attachment and consider this"
      }
    ]
  },
  {
    "title": "Aggregating SumAbove results from grouped tables.",
    "author": "Roger Calma",
    "product": "Conga_Composer",
    "content": "Requesting a Word functionality to calculate the grand total of the \"sum above\" for each grouped table.\n \nRefer to case 00889500",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Hello Roger, we are reaching out to learn more."
      }
    ]
  },
  {
    "title": "Conga Email Template- Increase body height for Conga Composer Button and Lightning Component.",
    "author": "Colton Lederer",
    "product": "Conga_Composer",
    "content": "Adding a little box on the bottom right so users can expand the height and width of an email body would be very helpful for all users. In both the button and lightning component solution, there is value real estate on the page either not being utilized or the layout could be more compacted so the email body portion could be better utilized.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Conga Email Template- Add Spell Check on Email Body for End Users",
    "author": "Colton Lederer",
    "product": "Conga_Composer",
    "content": "It's 2024, this should be a standard practice.\n \nCustomer: Trinity Law School\nhttps://apttus2.lightning.force.com/lightning/r/Account/0013Z00001mrYKdQAM/view",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Ability to incorporate custom fields into the Usage Dashboard Composer Activity report",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "The customer expressed a desire to incorporate custom fields into the Usage Dashboard Composer Activity report. This request stemmed from having users within their organization from different regions and a need to identify which regions these users generate quotes from.",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Enhance the HTML template tag to pass hyperlinks",
    "author": "Semir Muminovic",
    "product": "Conga_Composer",
    "content": "We need the capability to pass hyperlinks as part of a text filed to a Conga Template. For example, if a CLM Clause contains both hyperlinks and text, there is currently no method to retain them in the generated document. The current HTML tag does only the very basics like <a></a>, <br></br>",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Display selected Greek name correctly on Name of Contact",
    "author": "Bohui KA",
    "product": "Conga_Composer",
    "content": "With Greek name of Contact, we've been facing a display issue on Conga Composer.\n \n \n\n\n \n \nContact name is displayed correctly in \"To\" to send an email.\n﻿\nContact name is displayed correctly if the Greek name is copied and pasted to change related contact.\nBut, it's not displayed in the \"Name:\" for Related Contact.\n \nThe enhancement is needed for better user experience.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "David LE-VELY",
        "content": "Hello, I completely agree on this request which is really relevant when you have to manage special characters like greek characters. Thank you to consider it."
      },
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration"
      },
      {
        "commenter": "Frederic Farge",
        "content": "Very good proposal to help Greek and other specific Charset !"
      }
    ]
  },
  {
    "title": "Composer transaction limit alerts",
    "author": "Angela McKay",
    "product": "Conga_Composer",
    "content": "It would be great to have the ability to set thresholds for transaction limit alerts. For example, if I'm allotted 50 transactions a monthly, I may want to set an alert threshold when I get to 40.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to future consideration."
      }
    ]
  },
  {
    "title": "Ability to dynamically set EmailFromId",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "The customer is seeking a solution to dynamically set the &EmailFromId parameter, where the From email will correspond to the Opportunity owner.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to future consideration"
      }
    ]
  },
  {
    "title": "lightning threading token merge tag for Conga email templates",
    "author": "Daniel Natial",
    "product": "Conga_Composer",
    "content": "The customer wishes to Switch to Lightning Threading, but the lightning threading token is unavailable when using Conga email templates.\nIt's only available with Salesforce email-to-case email templates as Salesforce transitions to lightning threading, Customers wish to be able to use the implemented Conga Email Template.\n \nWinter ’24: Salesforce announces that Lightning threading will be enforced in the Spring '25 release. Spring ‘24: Salesforce enables a new header-based threading preference, giving customers the flexibility to choose how emails are threaded.Spring ’25: The Disable Ref ID and Transition to New Email Threading Behavior release update is scheduled to be enforced.\nhttps://help.salesforce.com/s/articleView?id=000389648&type=1",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Hyperlink in Conga Invoice Email Template",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Ability to use the Hyperlink prefix on Conga Invoice Email Template.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, thank you for your idea. We will be deferring at this time. If the customer desires the hyperlink feature in their email template they should upgrade to full Composer."
      }
    ]
  },
  {
    "title": "Composer -  More than 50 slide power point when using SlideRepeat and GroupRepeat",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "There is a limit in place for SlideRepeat and GroupRepeat where it will only pull the first 50 rows of data from the related query/report. There are many use cases that go above this 50 limit that would be great to have implemented.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Automatic Closure of Composer Merging Tab upon Completion",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Currently, our platform's composer merging tab facilitates efficient merging processes, streamlining tasks for users. However, to further enhance user experience and streamline workflow, we propose implementing a feature that enables the automatic closure of the composer merging tab upon completion, particularly when the \"DS7\" parameter is within the button syntax.\nWith this enhancement, users will experience a seamless workflow where they initiate a merge process and upon completion, the merging tab automatically closes, reducing clutter and allowing users to focus on subsequent tasks without the need for manual tab closure.\nThis enhancement aligns with our commitment to continuously improve usability and efficiency within our platform, ultimately enhancing user satisfaction and productivity.\nWe appreciate your consideration of this enhancement request and look forward to its implementation.",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration to ensure we review when we update the Composer runtime UI. In the short term I recommend the customer leverages the Composer lightning component as it minimizes extra loading screens and clicks for the end user."
      }
    ]
  },
  {
    "title": "Clickable Link Pre-Signing",
    "author": "Manny Griego",
    "product": "Conga_Composer",
    "content": "When sending documents for review or signature, the links within the PDF or Word files are not clickable until after the recipient has signed the Conga request. Is it possible to make the links clickable both before and after signing the Conga request? This would be particularly helpful, especially if the link provides information necessary for completing the Conga request.",
    "votes": "",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Hello Manny, thank you for submitting this request! We have heard from other customers that they would like this as well, so I will be merging this with the parent request to have clickable links within the PDF."
      }
    ]
  },
  {
    "title": "Secure Request For Review",
    "author": "Manny Griego",
    "product": "Conga_Composer",
    "content": "The feature enables users to securely request review and signature for sensitive documents by sending password-protected requests. Ideally, two separate emails are dispatched: one containing the password-protected request and another containing the password required to access the document. This functionality provides an option for sending secure requests for sensitive documents needing review.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Hello Manny, thank you for submitting this idea! We will be marking it for future consideration for our Salesforce product, though it should be noted that a similar process could be accomplished with the Q&A authentication option provided by the standalone product today."
      }
    ]
  },
  {
    "title": "Radio Buttons For Salesforce Version",
    "author": "Manny Griego",
    "product": "Conga_Composer",
    "content": "Unfortunately, radio buttons are not currently accessible within the Salesforce Conga product. Having this feature included in the Salesforce version would be highly advantageous. It's disappointing that the standalone product received the upgrade while the Salesforce version did not. It's urged that this functionality be extended to all platforms for the benefit of users.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Hello Manny, thank you for submitting this idea! We do have plans to bring radio buttons into Salesforce via the new connector which is being built to bridge the standalone product to Salesforce. I will be marking this as \"Planned\" accordingly."
      }
    ]
  },
  {
    "title": "Grouping Templates -",
    "author": "Manny Griego",
    "product": "Conga_Composer",
    "content": "Previously, with DocuSign, we had the capability to select individual documents or templates and create grouped packets of documents.\nThis functionality streamlined document management, especially when combining individual documents in various configurations. Instead of having to edit each template containing multiple documents with the same individual across many templates, we could simply update or modify one document/template, and those changes would propagate to all templates utilizing that particular document.\n \nHowever, with our current system using Conga, this capability is sorely missed. For instance, if I have document A in Template 1, 2, and 3, and I need to make an update to document A, I'm now required to update Template 1, 2, and 3 individually, rather than updating a single document that would automatically reflect changes across all templates.\n \nThank you,\nManny Griego",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this idea, Manny! We will be taking it on for future consideration."
      }
    ]
  },
  {
    "title": "Add ADA Compliance Scripting to PDF Conversion Mechanism for Composer",
    "author": "Jon Licht",
    "product": "Conga_Composer",
    "content": "The use case for this feature is a consumer-facing CPQ application that allows brokers to create quotes for small group insurance. The input templates for the quotes are Microsoft word. There is a requirement to convert these word templates to PDF so that brokers and customers can't edit the information, so the &defaultPDF=1 parameter is used.\n \nProblem: Conga Composer does not auto-tag PDFs with the &defaultPDF parameter. As a result, documents are generated that fail ADA compliance. The business work-around is to use a custom script that auto-tags the PDF files once they are delivered to the browser by Conga.\n \nIdea: Build an auto-gagging script into Conga Composer so that PDFs produced by composer are ADA compliant per WCAG standard.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"Future consideration\"."
      }
    ]
  },
  {
    "title": "Allow Translations on Conga Composer Templates",
    "author": "Ramesh M S",
    "product": "Conga_Composer",
    "content": "Without the ability to use translations either from Translation Workbench or Custom Labels, we have to create multiple templates one for each language.\n \nOr we expect some configurable object from Conga Composer which allows us to manage translations for the static content to be displayed on the document.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to Future Consideration"
      }
    ]
  },
  {
    "title": "Dynamic rendering of columns in the tables for Conga Composer",
    "author": "Ramesh M S",
    "product": "Conga_Composer",
    "content": "Need the ability to render the columns dynamically based on condition. Without this capability, we have to create multiple tables with static/pre-defined columns for the same set of data to display. This make the template more complex with duplicated tables which challenges maintainability and performance(time takes to prepare and render the content into the document).",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Hide Columns in Table Merge",
    "author": "Drew Wilkins",
    "product": "Conga_Composer",
    "content": "This is available in OOB cpq quoting (albeit still limited). You can do table hide in conga, however this becomes very time consuming especially if you have multiple fields and conditions depending on the type of sale thats happening. One template can have over 10 separate tables to account for these conditions, and as a result produces unwanted white space that you have to tweak once the tables are hidden. Having this ability would cut the amount of tables/queries to update and manage.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Composer - Increase the email attachment size limit",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "When using 'Merge and Email' with Composer, attachments can not be larger than 10 MB. The aggregate attachment size limit is 25 MB and Salesforce also supports this size for lightning emails. It would be great to have the option to go over the current 10 MB limit.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Attach the document to the email message record after sending the email.",
    "author": "Minhui Huang",
    "product": "Conga_Composer",
    "content": "Currently, we can use the parameter DS7=2 to attach the document to the email message record (EmailMessage object) after sending out the email. However, if the button URL contains the CETId parameter, the document does not get attached to the email message record. Is there a way that we can have this feature enabled for the CETId parameter, similar to DS7=2?",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Combine multiple attachments from Salesforce Files, into a Single Document, with ability to insert conga generated document into the mix",
    "author": "David Garrity",
    "product": "Conga_Composer",
    "content": "Conga composer is great at generate content from record fields in Salesforce. One challenge we have, is when the document has appendixes that are stored in Salesforce (as images, pdfs, etc), and combining that in a high quality manner into the Conga generated document.\n \nThis reduces the manually nature to have to combine the files outside of Conga.\n \nConga does have the ability to get IMAGE in the word template, however, the quality is limited, and for multiple page PDF merges, it only merges page 1.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Conga Composer SMS Delivery Option",
    "author": "Joel Jimenez",
    "product": "Conga_Composer",
    "content": "A customer wanted to have SMS as delivery option for the generated Conga Composer document.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Ability to Compress PDF output files.",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Conga Composer to have the capability to compress the PDF file—for example, 8MB to 3MB after squeezing.\nBy compressing the files it will reduce the size of the document and allow less storage.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Nested grouping with TableGroup",
    "author": "Jayenkumar Patel",
    "product": "Conga_Composer",
    "content": "Right now, we can only use TableGroup once, which means we can only group data by a single field.Nested groupings are a typical use case for many of our customers.If we could allow at least three levels of grouping, that would be a great enhancement and would help many of our customers.",
    "votes": "4 Votes",
    "comments": [
      {
        "commenter": "Austin Miller",
        "content": "Adding this functionality to TableGroupStarts as well would be nice to see as they can achieve different results."
      },
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Better Error Message With Text and Rich Text Fields Loading into a Conga Merge",
    "author": "Joel Saukas",
    "product": "Conga_Composer",
    "content": "When using a Word doc composer solution, our users frequently experience an error with the text \"The operation was canceled.\" We've isolated this issue to being 99% related to users having double quotes, custom formatting (bullet points, bolded text, etc. that has been copied and pasted from a word doc into a rich text field in Salesforce), or another illegal character in the rich text field. Once they correct this issue by either removing the double quotes or using the \"Remove Formatting\" button in the rich text field in Salesforce, the merge runs with no issue.\n \nWe've provided training and help bubbles for our users in Salesforce, but in the Conga Composer merge screen, they only see an error of \"The operation was canceled.\" This leads to them starting a ticket with our support team stating that they are unable to run their merge successfully. The object record that they are running the merge from has dozens of fields, so they seem to forget the additional training they've had on using rich text fields.\n \nIf there was some sort of Conga internal work to check for this during the merge, and then display it to the user, that would be extremely helpful. Like \"Error encountered with field_name, please correct.\"",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"Future consideration\"."
      }
    ]
  },
  {
    "title": "Conga Composer SC1 parameter to add multiple storage location",
    "author": "Dino Dichoso",
    "product": "Conga_Composer",
    "content": "The customer is using SC1 Parameter and currently, it is saving file as \"Salesforce File\" in the Master Record but also wanted to have another copy in the Attachments on the transaction sent through email.\n \nReference Ticker #: 00875220\n \n﻿",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Hello Dino, thank you for submitting this idea! Just to make sure I'm understaing this request, can you please confirm if my understanding is correct here? \nWhen generating a document to send for signature you save a file under Salesforce files on the master record. When the document goes out for signature, you would like to have that same file attached to the email inviting a recipient to sign as a supplementary document to view before signing. \n\tSpecifically, this attachment would not be included in the transaction itself. \n\nIs that correct?"
      }
    ]
  },
  {
    "title": "Avoid rounding off when the result extends beyond 14 digits in Conga Composer",
    "author": "Roger Calma",
    "product": "Conga_Composer",
    "content": "When generating a document with values exceeding 14 digits, the current behavior automatically rounds off the result. The desired outcome is for the output to precisely reflect the values present in the View Data Worksheet without rounding.\n \nReference: Case number 00875571",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Conga Composer - New DS7 value for Backgroud Mode",
    "author": "Mourad Bounajra",
    "product": "Conga_Composer",
    "content": "Currently we dont have value for DS7 allowing to \"Background Mode is enabled ONLY\" (the merged document IS NOT attached to Salesforce)",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Ability to resize Conga Screen",
    "author": "Mourad Bounajra",
    "product": "Conga_Composer",
    "content": "Currently we are unable to change the size of the Conga Composer Screen (UI)\nIt is important to have this possibility especially when we use the Conga PDF Preview",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Conga will be investing in a refresh of the UI and as part of that we will allow for better control of the screen."
      }
    ]
  },
  {
    "title": "Composer for Salesforce improved error messages",
    "author": "Michael Overman TS",
    "product": "Conga_Composer",
    "content": "Currently, Composer API error handling is quite detailed, https://documentation.conga.com/composer/latest/conga-platform/composer-api-error-handling-225253798.html, but errors for Composer for Salesforce (for instance like running Composer from flow) are not as detailed. Improved error handling for inside Salesforce would make troubleshooting significantly more efficient.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"Future Consideration\"."
      }
    ]
  },
  {
    "title": "Conga Composer - IF STATEMENTS in MICROSOFT WORD, Links NOT Clickable / Works outside IF.",
    "author": "Atta Mmorosa",
    "product": "Conga_Composer",
    "content": "The customer is seeking to utilize Microsoft Word functions such as an IF Statement that will select the specified field that produces a directional HYPERLINK.\nIf placed within an IF Statement within MS Word, the link generates but is not clickable.Outside of the IF Statement, the link functions as it should and redirects the user to a website.\nWe have sent workarounds but the customer is looking to have this use case implemented.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration."
      }
    ]
  },
  {
    "title": "Conga Composer - Ability for Certain merge field styles for PowerPoint to work",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Details: Certain field types do not yield the intended outcome when using merge field styles such as {{HTML:QueryName.FieldName}}, {{Image:QueryName.FieldName}}, or {{Includepicture:QueryName.FieldName}}.\n \nReference: https://documentation.conga.com/composer/latest/salesforce/unsupported-powerpoint-features-143198737.html\n \nBenefits: This enhancement will provide clients with a seamless option to retrieve images from the query.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea! I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Request to make SUM(ABOVE) functionality to work in Conga Email Templates",
    "author": "Chaitanya Taneja",
    "product": "Conga_Composer",
    "content": "SUM(ABOVE) function is not working well with Conga Email templates, I would like to make this request to you to look into if this is something that can be added in the future releases of Composer.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I have moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Conga Composer + Microsoft Word Conversion to PDF Inserting Extra Spaces in Final Output",
    "author": "Atta Mmorosa",
    "product": "Conga_Composer",
    "content": "Within a Microsoft Word to PDF conversion using FP0 is resulting in extra spaces being added to the output file which is seemingly breaking specific tables within a specific merge.\n \nCustomer/s would like to see some form or level of improvement upon merging an MS Word document, and then converting to PDF with the extraneous spaces that are converted.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved it to \"future consideration\""
      }
    ]
  },
  {
    "title": "Requirements to use Composer lighting component",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Based off this documentation:https://documentation.conga.com/composer/latest/salesforce/configure-the-composer-lightning-component-for-salesforce-mobile-158340514.html\n \nUsers are required admin level permissions to use a lighting component in mobile and we have a client that was hoping to give users with basic permissions to use the component",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, we will not be completing this idea at this time. I have deferred"
      }
    ]
  },
  {
    "title": "Parameter to Eliminate Double Quotes",
    "author": "Taylor Heath",
    "product": "Conga_Composer",
    "content": "Request\nAllow user to add a parameter that eliminates the double quotes for you when using IF statements.\n \nCurrent State:\nIf the source data merging in has \" double quotes in it, it gives an error. Customers developing workarounds to eliminate double quotes from Word IF statements.\n1st workaround: replacing all double quotes with single quotes in the source data.\n2nd workaround: Create a validation rule to protect that from happening",
    "votes": "5 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Remove the file extension on generated documents",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "Currently all Composer generated documents have the file extension (.pdf, .docx, ect..) added onto the end of the filename. There currently isn't a way to have this removed during the Composer merge but it can be removed manually after.\n \nIt would be nice in the future to allow the file extension to be removed while generating the Composer document.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Allow OneSpan Sign to integrate with Conga Batch and Conga Trigger",
    "author": "David Vernall",
    "product": "Conga_Composer",
    "content": "Hi Team,\n \nCustomer (Stonehenge) needs the Qmode parameters to be expanded to include the option of OneSpan Sign, so that they can integrate Batch/Trigger with their solution.\n \nThanks,",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this idea, David! We will be taking it on for future consideration."
      }
    ]
  },
  {
    "title": "Composer - Dynamically hide or show table columns",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "Looking for an option to dynamically hide/show table columns if there is no data being pulled in for the cells.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, customers need to leverage rowburner to achieve this outcome: https://documentation.conga.com/composer/october-23/salesforce/conditionally-remove-a-row-in-a-table-that-has-no-data-158342088.htmlI've moved this idea to \"already exists\""
      }
    ]
  },
  {
    "title": "Composer with DocuSign Government ID Verification option",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "Using the DocuSignR1IDCheckType parameter you can set up RSA or SMS authentication. It would be nice to also have an option to use Government ID Verification instead of the two options previously mentioned.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "Custom Font",
    "author": "Johnny Checton",
    "product": "Conga_Composer",
    "content": "Create compatibility for the custom font GulfStreamHorizon to merge in Composer when converting to .pdf file",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello I have moved to will not implement at this time."
      }
    ]
  },
  {
    "title": "Conga Composer Platform Enhancement",
    "author": "Tracy Cannon",
    "product": "Conga_Composer",
    "content": "Please create an online syntax checker for Conga Composer templates. Also need insightinto where a template fails if Composerisuable tomerge the fields on document.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I have moved to future consideration"
      }
    ]
  },
  {
    "title": "SOQL WHOID & WHATID USED IN CONJUNCTION FOR CONGA QUERY MERGE",
    "author": "Atta Mmorosa",
    "product": "Conga_Composer",
    "content": "The customer wants to pull the WhoID and the WhatID in conjunction. Both work when they are alone but within the Nested OR statement, it does not seem to work.\n \nConga Query (SOQL)\nselect Count(id) from task where TaskSubtype = 'Call' and (WhatId = '{pv0}' OR WhoId=’{pv0}’) and CreatedDate = THIS_YEAR\n \nWORKAROUND: \nhave two separate queries one that calls the whoID, and then the other that calls the whatID.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea! I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Conga Composer - Box integration folder / to have the newly created folder visible within the Box Lightning component on the record page.",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "To have the newly created folder visible within the Box Lightning component on the record page.\n \nIt is sometimes an issue if the Conga-created folder is not visible to the Box-Salesforce integration because users need to save other documents in the same folder through Salesforce.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Conga Composer - Box integration folder / to have the newly created folder visible within the Box Lightning component on the record page.",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "To have the newly created folder visible within the Box Lightning component on the record page.\n \nIt is sometimes an issue if the Conga-created folder is not visible to the Box-Salesforce integration because users need to save other documents in the same folder through Salesforce.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Closing this as it's a duplicate with: https://apttus2.my.salesforce.com/ideas/viewIdea.apexp?id=087Dm00000008qWIAQ"
      }
    ]
  },
  {
    "title": "Add Lookup Fields in Composer",
    "author": "Johnny Checton",
    "product": "Conga_Composer",
    "content": "Customer would like to be able to add any lookup fields to a merged document without the need for a query or report. TableStart and TableEnd tags are cumbersome for close lookup records.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. We will not be moving forward with it at this time. Our Conga queries/SOQL data gathering practices are not planned to change."
      }
    ]
  },
  {
    "title": "Generate Previews",
    "author": "Arpit Rao",
    "product": "Conga_Composer",
    "content": "Currently there is no capability to generate to generate previews of contract.\n \nUse case -\nImaging a Field Executive (Sales Rep/Brand Builder etc) visiting a Retail Store and had discussion with shop owner about contract for running promotions (short term or long term). Field Executive is negotiating with Shop owner about products, visibility, exclusivity etc and also explains about various benefits store owner will get on completion of negotiated terms.\n \nSince Field Executive is already doing this discussion Face 2 Face with shop owner it will be ideal to show a preview of contract before initiating next step in process. That could be either submitting the negotiated terms for approval or taking a signature of shop owner.\n \nShowing the preview of contract will help to gain trust of shop owner since they will know what document they are eventually going to sign.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, I recommend leveraging the DS7Preview parameter within your business process: https://documentation.conga.com/composer/october-23/salesforce/ds7preview-195696320.htmlWe will not be completing this idea at this time."
      }
    ]
  },
  {
    "title": "Ability to merge Rich Text Fields same exact format on PPT templates",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "When merging rtf in PPT template that has spaces between bullets, the data does not merge completely/correctly.",
    "votes": "4 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've move to \"future consideration\""
      },
      {
        "commenter": "Dhanie Bermas",
        "content": "this is working properly in Word templates."
      }
    ]
  },
  {
    "title": "Conga Composer - We need to enable the Live Edit feature to replicate the same format of the customer document for easier completion.",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Description: Customer wants to use the Live Edit Featuer but it messed up the Output file.\n \nBenefit: This will allow our customer's clients to easily navigate the Live Edit feature and obtain the desired output.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, please provide additional information on what the desired output is. I moved to future consideration for now."
      }
    ]
  },
  {
    "title": "Use Composer merge fields in the Conga Sign Transaction email body via the Business Unit",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "Looking into the possibility to add Composer merge fields to the Conga Sign email body via business units.",
    "votes": "5 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration."
      }
    ]
  },
  {
    "title": "New Parameter for save location",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "create new parameter that allows output file to be saved to any related or non related object",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration."
      }
    ]
  },
  {
    "title": "Salesforce : PickList label or Picklist API value",
    "author": "Daniel Godou",
    "product": "Conga_Composer",
    "content": "We want to choose to retrive the label value and not the API value.\n \nToday , on Conga Composer in Salesforce , we have only the possibility to choose the API value when we custum the word document or email. And it not funny.\n \nCan you add this fonctionnality Conga Composer in Salesforce?\n \nThanks.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. We are deferring this idea at this time."
      }
    ]
  },
  {
    "title": "Display whole value in a PDF output generated from Excel template",
    "author": "Chaitanya Taneja",
    "product": "Conga_Composer",
    "content": "As of now, the text value pulled from Detail data is being cut to a certain point when outputted in a PDF format. It would be good if the PDF output file showed the whole text value instead of a certain limit(screenshot).\nThe same text value is shown in full/as expected when generated from Excel to Excel. Problem is in Excel to PDF.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Print queried data into a sentence",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "User would like queried data to print like such: data1,data2,data3,",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello,We will be deferring this idea at this time. Thank you,Kelly"
      }
    ]
  },
  {
    "title": "Add a value for parameter DocuSignR1IDCheckType to support the New DocuSign ID Verification",
    "author": "Mateo Blanco",
    "product": "Conga_Composer",
    "content": "Create a value for Parameter DocuSignR1IDCheckType to support the New DocuSign ID Verification functionality that prompts the recipient to take a selfie and upload a government ID. Currently, only SMS and RSA are supported.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration for when we update our DocuSign integration"
      }
    ]
  },
  {
    "title": "Ability to merge documents with images without converting to a zip file",
    "author": "Taylor Heath",
    "product": "Conga_Composer",
    "content": "I would like to generate a PDF containing (a) an Email Message and all it’s related attachments and (b) a Case (some case details and then each email and their related attachments) that contain images without converting to a zip file.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea! I've moved to future consideration."
      }
    ]
  },
  {
    "title": "Option to reference multiple Contacts in &ContactId parameter",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer want to be able to control which Contact will show on the Related Contact field of the Composer UI. They created a query that will only show 4 out of 7 Related Contacts from the drop down option which a user can select when sending an email with Composer. The query was referenced on the ContactId parameter using Qvar but they failed to get the desired behavior.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "This idea will be deferred at this time. Thank you"
      }
    ]
  },
  {
    "title": "Product Requirement for Automated Vendor Performance PDF Generation Integration with Conga",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Details:\nWe are looking to enhance our existing vendor performance reporting system within Salesforce by automating the generation and attachment of a monthly PDF report to emails sent to our customers. This PDF report should be auto-generated based on the vendor's performance at the time, and it should include charts, graphs, and other visuals summarizing relevant data points. We are exploring the possibility of using Conga for this purpose due to our existing integration with Salesforce, but we are open to alternative solutions that can seamlessly integrate with our current Salesforce configuration.\n \nProblem Statement:\nCurrently, we send automated vendor performance emails to our customers on a monthly basis via email and Salesforce cases. These emails contain essential data points such as maintenance percentage, callback trends, and more, reflecting the vendor's performance. This same data is also available to customers through our Experience Cloud-based customer portal.\nHowever, we would like to enhance the customer experience by automatically attaching a concise one-page PDF report to these monthly emails. This PDF report should be generated dynamically based on the vendor's performance for each specific account, including charts, graphs, and visuals for better data representation.\n \nBenefits\nKey Requirements:\nAutomated PDF Generation: The solution should automatically generate a one-page PDF report on a monthly basis.\n \nDynamic Data: The PDF content should be populated with data specific to the vendor's performance for the respective customer account.\n \nVisual Representation: The PDF should include charts, graphs, and other visuals to provide a clear and concise overview of vendor performance.\n \nSeamless Integration: The solution should seamlessly integrate with our existing Salesforce configuration to minimize disruptions to our current workflow.\n \nEmail Attachment: The generated PDF report should be automatically attached to the monthly vendor performance emails sent to customers.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "This can be achieved with Composer, Batch, and/or Trigger functionality today. Deferring this idea."
      }
    ]
  },
  {
    "title": "Create a Parameter Allowing Document Saving Only to Files",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Details:\nThe client would like to have a parameter within the solution that allows them to save documents exclusively to the \"Files\" section, with no copying from \"Notes and Attachments.\"\n \nBenefit:\nThis will enable more efficient use of storage space and eliminate redundancy in saved documents.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "This can be achieved with the SC parameter here: https://documentation.conga.com/composer/october-23/salesforce/sc1-165940925.htmlDeferring this idea"
      }
    ]
  },
  {
    "title": "Emailfromid & View Setup & Configuration Permission",
    "author": "Atta Mmorosa",
    "product": "Conga_Composer",
    "content": "Customer wants to restrict access to the View Setup and Configuration permission for users that are not system admins, but still allow them to use the emailfromid (When using the EmailFromId you must enable the View Setup and Configuration permission settings under the user's System Permissions in Salesforce which gives the end-user visibility, but not the ability to modify the Setup Menu.) - Sauce - EmailFromId (conga.com).\n \nCurrently it throws errors without the permission enabled, and customer is attempting a way around it.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "We are not moving forward with this idea, deferring it at this time."
      }
    ]
  },
  {
    "title": "Enabling the Use of Advanced Control Parameters with Third-Party Solutions",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Details: Advanced Control Parameters (specifically \"AbsoluteReturnPath\") should be made available for use with third-party solutions, such as Visual Studio, Visual Force, and JSON.\nBenefits:\nGreater Customization: Clients will have the freedom to create tailored solutions that incorporate the \"AbsoluteReturnPath\" parameter, offering them unprecedented flexibility and control over their processes.Improved User Experience: This feature will enhance the user experience within third-party applications, as users can create customized buttons and functionalities that align precisely with their needs.Efficiency and Productivity: By seamlessly integrating Advanced Control Parameters, clients can optimize workflows, reduce manual tasks, and boost productivity across their operations.Competitive Advantage: Clients who adopt this feature will gain a competitive edge by being able to create more sophisticated and responsive applications, ultimately meeting the evolving demands of their users.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea! I've moved to future consideration."
      }
    ]
  },
  {
    "title": "Option to Remove 'Return to Record' from Composer UI",
    "author": "Johnny Checton",
    "product": "Conga_Composer",
    "content": "When partners launch a Composer Solution in a Salesforce Community Portal, the link to 'Return to Record' shows in the top right of the Composer UI Window. That link does not direct to the page, as partners do not have access to the Salesforce Org.\n \nMake it optional to remove the link.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Currency culture symbol",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "User would like this symbol to be supported for the swish frac ₣",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Improve Docusign/Conga integration limitation",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "DocuSign eSignature for Salesforce app integration with Conga Composer has a file size limitation (refer to this document:https://support.docusign.com/s/document-item?language=en_US&bundleId=gbo1643332197980&topicId=akk1578456465691.html&_LANG=enus). Docusign has fixed this limitation but our integration is still enforcing it. Client would like us to fix this and remove the limtatiton.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello,Thank you for your idea, I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Composer - Ability to make the radio button work in an IF statement on a template",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Ability to make the radio button work in an IF statement on a template",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Suppress duplicate table rows",
    "author": "Alison Chambers",
    "product": "Conga_Composer",
    "content": "I'd like to be able to suppress a duplicate row based on a value. Basically, I'd like functionality like TableGroupShow/Hide, but it's grouping at the line level so that each line only prints once even if the values are present multiple times.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Ability to set the Image Layout Options in Word before image is merged",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer would like to be able to set the image layout option before on their word even before the image is merged. They are having issues with the layout of their image and if they can set the layout to \"Tight\" by default, their images will merge correctly.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Only Show Selected Documents able to be Enabled in button config",
    "author": "Mike Korbel",
    "product": "Conga_Composer",
    "content": "Can we please have a button parameter available so that “Only Show Selected” can be enabled by default when launching a eSign from a solution (ie one of these https://documentation.conga.com/composer/latest/salesforce/conga-sign-integration-parameters-208511624.html)",
    "votes": "",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this idea, Mike! We have another idea which is currently open for the same request, so I will be merging this ticket with that, but please know we are considering this for the future."
      }
    ]
  },
  {
    "title": "Nested Query referenced in Qvar for Lightning Component",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer is using a nested query on QVAR to pull templates. This does not work with Lightning Component but it does in normal composer button. Customer would like to be able to use this setup on their Lightning Component solution in the future.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, we will not be moving forward with it at this time."
      }
    ]
  },
  {
    "title": "Title Heading in MS Word gets duplicate when the Title is used more than once on a consolidated word output",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer is merging multiple templates as a consolidated file. Each template is using the same Title heading. When the docs are merged, the Title heading gets duplicated on MS Word.\nEx: Instead of just showing Title on the Styles, it will show Title, Title_0, Title_1\n \nCustomer wants to know why that is happening and learn how this can be prevented if possible",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to future consideration"
      }
    ]
  },
  {
    "title": "Title Heading in MS Word gets duplicate when the Title is used more than once on a consolidated word output",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer is merging multiple templates as a consolidated file. Each template is using the same Title heading. When the docs are merged, the Title heading gets duplicated on MS Word.\nEx: Instead of just showing Title on the Styles, it will show Title, Title_0, Title_1\n \nCustomer wants to know why that is happening and learn how this can be prevented if possible",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Goal assigment object to be added to conga query builder",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Standard object goal assignment not showing in Conga query builder, client would like it to be added.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Use the Related Contact in the Composer merge as the Conga Sign recipient.",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "Using Conga Composer with Sign integration, it would be nice to have a way to select the Related Contact when going through the Composer merge and then have that same contact used in as the recipient for the Sign Transaction.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this idea, Austin! We will take this on for future consideration and will work with the Composer team to understand feasiblity."
      }
    ]
  },
  {
    "title": "Ability to sort the template selection list",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "The templates that are listed in the Composer Lightning Component seemed to be set to a default A-Z sorting order. We are wondering if there could be a option/parameter that would allow for this template selection list to be moved around so some templates are next to other templates when viewing.\n \nThis isn't referring to the merge order but the list you see before merging the documents.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"Future Consideration\"."
      }
    ]
  },
  {
    "title": "Ability to save merged document in a folder on their local drive",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer would like to be able to save their merged document on a specific folder on their local drive.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Hello Dhaine, thank you for submitting this idea! Would you be able to expand upon this use case? Composer has parameters to save to Google Drive and OneDrive, is there another location they would like to save to? Additionally, how does Sign fit in with this request?"
      }
    ]
  },
  {
    "title": "Template Manager: Organize template list",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "User would like to be able to Organize the list of templates alphabetically in template manager interface.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Make Composer work when clickjack is enabled in Lightning Component",
    "author": "Roger Calma",
    "product": "Conga_Composer",
    "content": "Make Composer work when clickjack is enabled in Lightning Component",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, thank you for your idea. I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Invalid Email Notification",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "It would be great if there was a way to get notified that an email bounced, did not make it to the recipient, or was invalid when running Composer.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Jay Ingebretsen",
        "content": "Hello, I believe I can provide a good workaround for support to use if a future ticket is submitted for this same ask. Withing Salesforce Setup > Deliverability. I enabled the setting called \"Return bounced emails to sender.\" This will send an email back to the sender containing the email address that is invalid. If you log an activity on the record within Salesforce, it will also say the email bounced but will not pinpoint which address is the issue if you sent to multiple email addresses using &emailadditionalto field, which we are. I'll add this to the ticket as well.Keep in mind email bounces seem to take around 24 hours to return to the sender.Thank you!"
      },
      {
        "commenter": "Kelly McCamley",
        "content": "Hey Austin,Thank you for your idea! I've moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Ability to use Email Template to Lightning in Salesforce",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "Unable to merge and send email in Lightning",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, I've moved to \"Already exists\" as Composer supports the emailing of templates in classic/lightning."
      }
    ]
  },
  {
    "title": "Better error messages",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Client would like us to have better error messages so it's not misleading.",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Sarah Husband",
        "content": "We get error messages like \"There was an issue processing the Composer request\" or \"The operation was cancelled\".  That is not enough information to help us diagnose the problem or fix it.  We need more details.  I'd rather see the raw error message than a completely useless generic error message."
      },
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Populate custom field on Conga Transaction record through Conga Composer/Sign integration parameters",
    "author": "James Edgar",
    "product": "Conga_Composer",
    "content": "Some of our sales processes involve multiple documents being signed at different stages of the process - for example an NDA at the very beginning of the sales cycle, later followed by the main contract itself, lastly with an implementation document signed by a different person in the organisation.\n \nWe can't currently 'categorise' the sign transactions - e.g. to be able to see/report on whether the NDA is sent for or completed signing - we would like to be able to create custom fields on the Conga Transaction object and populate those values using button URL parameters in a similar way that we can with MFTS values - this would allow us to create a 'document type' field and populate the value depending on which type of document (NDA,contract,SOW etc) is being signed.\n \nSimilar approach could then be used for other metadata about the document a signing transaction relates to.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "James Edgar",
        "content": "Thanks - this arises from support cases #855399 and #812892 - those say that a feature request was/will be submitted but I wasn't able to find it here. For further clarity on the value - being able to categorise/identify the specific conga transaction records will allow us to introduce additional validation/automation to ensure that duplicate transactions are not sent, and that validate that certain transactions are completed at different stages of the sales process."
      },
      {
        "commenter": "Amy Reams",
        "content": "Hello James, thank you for submitting this idea, and for the level of detail provided. We will take this on for future consideration and review with the composer team to see about the possibility of populating custom fields via URL parameters in the way that you've described."
      }
    ]
  },
  {
    "title": "Conga Composer and Trigger to be made compatible with DocuSign Apps Launcher",
    "author": "Mark Pieter",
    "product": "Conga_Composer",
    "content": "Conga Composer (and Trigger) has a long standing integration with DocuSign. However, the integration is only fully functional with the standalone (a.k.a. legacy) version of the DocuSign eSignature for Salesforce (7.12.x), which was removed from the AppExchange long ago. The legacy app was replaced by the new DocuSign eSignature for Salesforce app from the DocuSign Apps Launcher package of apps.\n \nMany Conga customers (including ourselves!) have invested heavily in the Conga / DocuSign combination for their document generation and signature solutions; retooling for another signature (or document) solution is costly and/or not practical. In fact, not only is Conga integrated with DocuSign, but so are portions of our website!\n \nIt is becoming much more difficult to get support from DocuSign on their legacy product. When we have issues, technical support (which we pay extra for, BTW) is not always willing (or able!) to be helpful. The day will come when DocuSign legacy is no longer supported. Conga should be proactive about upgrading their core products to be compatible with early customers who have invested so heavily in these long standing integrations.\n \nPlease make Composer and Trigger compatible with the new DocuSign Apps Launcher!",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea Mark. I've moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Save a Google doc in Salesforce file",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer is has solutions where the output gets saved on their Google Drive and they want to be able to save the same doc but on SF files related list of their master object.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to future consideration."
      }
    ]
  },
  {
    "title": "Ability to Create a Custom Error Message when a Conga Composer Merge Fails",
    "author": "Joel Saukas",
    "product": "Conga_Composer",
    "content": "Okay based on my research, it does not appear to be possible to set up a formula field in Salesforce using anything from a rich text field, see here: https://help.salesforce.com/s/articleView?id=000385791&amp;type=1\n \nRequest ability to always display the same error message in the Composer when a Conga Merge fails, with a specific solutions in mind, that would give the user the instruction they need 95% of the time. I don't think I can use DCL, since that seems to require DC to run, and I can't get DC to run since the rich text field in question isn't possible to add to a Salesforce formula.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello,Thank you for your idea, I've moved to future consideration."
      }
    ]
  },
  {
    "title": "Change set to migrate queries/solution from Sandbox to Prod",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer was looking for a way to use Change Sets in migrating their queries from Sandbox to Production. Although customer was educated about how they can migrate their solutions at the time being. Also suggested third party apps such as Prodly and Copado.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello,At this point in time customers should leverage Conga Keys to aid in migration or third parties like you recommended. I've moved to \"will not implement\".Conga Keys documentation: https://documentation.conga.com/composer/june-23/salesforce/conga-keys-158335195.htmlThank you,Kelly"
      }
    ]
  },
  {
    "title": "Ability to merge fields vertically in a table in PowerPoint Templates",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "The customer would like to add merge fields in a table vertical format - PowerPoint Template\nIt only shows the value of the first merge field in the table.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Conga Composer/Sign - Propper redirect in Salesforce Mobile",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "In Salesforce Mobile, Conga Composer/Sign don't properly redirect as they bring you to a browser or require you to close out of the current process in order to complete it. It would be nice if this was a more fluid process.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this idea, Austin! We will be taking it on for future consideration and grouping it with our other mobile experience ideas."
      }
    ]
  },
  {
    "title": "Data transformation before merging",
    "author": "Rodolphe Malaguti",
    "product": "Conga_Composer",
    "content": "It would be great to offer on the fly data transformation before merging the document. This could take the form of:\nAssembling data from multiple data sets to create a single table (line item and product attributes for instance)group data on multiple (I've seen use case where they were expecting 5 levels of grouping)be able to ingest raw data in multiple format (XLM, JSON) and produce the correct output for the merge operation",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea and all of the additional recommendations. I've moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "Push document to REST Endpoint - Composer API",
    "author": "Rodolphe Malaguti",
    "product": "Conga_Composer",
    "content": "Today we can easily integrate with different reposotories out of the box. Also, customer can use our status API to check the completion status and download the document to integrate in their app. However, it would be great to offer a way to push a document to a specific endpoint (protected or not via Oauth) once generated when using the API",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, I've moved your idea to \"future consideration\" to review as we expand our API capabilities. Thank you!"
      }
    ]
  },
  {
    "title": "Images to work on an excel template",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "To have the ability to merge images on an excel template",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, I've moved your idea to \"future consideration\".Thank you!"
      }
    ]
  },
  {
    "title": "Three levels down of Number formatting is wrong",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "Incorrect format when the document is being merged\nLRTF not working on this issue\n \nSample Output of the customer:\n \n1.1.1\n1.1",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, I've moved this to \"future consideration\" to evaluate when we improve our rich text merge abilities."
      }
    ]
  },
  {
    "title": "Increase the number of pv values available",
    "author": "Arnaud Couesnon",
    "product": "Conga_Composer",
    "content": "It would be great to have the possibility to increase the number of pv values available (More than 6 as it's the case currently)\nRegards",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hi Arnaud,I've moved your idea to \"future consideration\". How many pv values do you desire? Can you provide additional insight into your use case / business need for more than 6? Thank you,Kelly"
      }
    ]
  },
  {
    "title": "Able to Modify the Composer UI window to full screen",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "The customer is having issues to preview documents, needs to scroll down from Composer UI. Would want to see the documents without any hassle and wants the window to be on full screen",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hi Katherine,Thank you for your idea. I've moved it to \"future consideration\" for when we make updates to our runtime UI. Best,Kelly"
      }
    ]
  },
  {
    "title": "Auto-translate language of merge field",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "Code or parameter that can translate language of merge fields",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Hello - Thank you for submitting this idea. Due to complexities in providing translation accuracy and intent of a word, we would be more inclined to reference an already transalted value supplied in a translation table or similar owned and managed by the specific Composer customer. This is an idea that we haven't yet added to our roadmap but is one we continue to track and will keep for future consideration."
      }
    ]
  },
  {
    "title": "Live edit vs actual output",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Client would like to have the live edit view display the same way as the actual output.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "QuickMerge Activity logging to related object",
    "author": "Nigel Frey",
    "product": "Conga_Composer",
    "content": "We were using QuickMerge links in conjunction with Conga MailMerge for many years and this included logging activities to the related object records, so we were able to look at the individual records and see that we had created a letter for them via QuickMerge and MailMerge.\n \nWhen MailMerge was obsoleted we had someone create a QuickMerge link for us that gave us back the functionality we had other than they above logging. So, whilst the activity is logged to the QuickMerge link itself, this is not replicated back to the records in the report that the link has used.\n \nI was working wiht one of your colleagues today because we thought the issue was simply down to a missing parameter, but this was unfortunately not the case.\n \nCreating batches of letter to send to our members is the primary reason we use Conga, so we could really do with having this logging function reinstated.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello,I recommend using Conga Batch to achieve your batch sending needs and activity logging needs. Both Mail Merge and Quick Merge have been end of lifed. Here's some documentation to assist: https://documentation.conga.com/composer/february-23/conga-batch-169280414.htmlhttps://documentation.conga.com/composer/february-23/qmode-158341529.htmlhttps://documentation.conga.com/composer/february-23/activity-logging-parameters-193692679.htmlI've moved this idea to \"won't do\" status as Conga Batch is the intended solution for customers. Thank you,Kelly"
      }
    ]
  },
  {
    "title": "Rewriting the uploaded file template automatically.",
    "author": "Peter Carolino",
    "product": "Conga_Composer",
    "content": "When generating a composer button, The Customer wants to automatically overwrite the name of the template that was uploaded.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello! I recommend the customer uses the OFN parameter here: https://documentation.conga.com/composer/february-23/ofn-169280213.htmlI've moved to \"already exists\" status."
      }
    ]
  },
  {
    "title": "Rewriting the uploaded file template automatically.",
    "author": "Peter Carolino",
    "product": "Conga_Composer",
    "content": "When generating a composer button, The Customer wants to automatically overwrite the name of the template that was uploaded.",
    "votes": "",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello! I recommend the customer uses the OFN parameter here: https://documentation.conga.com/composer/february-23/ofn-169280213.htmlI've moved to \"already exists\" status."
      }
    ]
  },
  {
    "title": "(Composer) Ability to report on usage of templates",
    "author": "Jörg Sigle",
    "product": "Conga_Composer",
    "content": "As a user / admin in Salesforce and Conga, who is responsible for generating and administrating (Word) templates for Conga Composer,\nI want to be able to report on which user (role / profile) used which templates how often,\nso that\nI can keep track of the amount of templates, and evaluate which ones are not needed (anymore), as they are poorly or not used at all.better anticipate needs in future projects, what templates are needed, design them better, and add the ideal content by knowing usage / user acceptance.\n \n(see also my community question: https://community.conga.com/s/feed/0D5Dm00000SVx0tKAD)",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea! I've moved it to \"Future consideration\""
      }
    ]
  },
  {
    "title": "Customer feedback on deployment timing for Composer on May 16",
    "author": "Alejandra Tarrell",
    "product": "Conga_Composer",
    "content": "From the customer\"\n \n\"We would like to add our input for the conga development team as this situation could have been avoided.\nDeployments should be done outside of business hours for the located servers. Major ones should be on weekends and minor ones should be overnight. These are standard practices followed by software companies.\n \n\"It’s critical that you get us back up and running ASAP. This has created huge damage to the business, and we need a resolution from Conga ASAP.\n \nMatt Lewis| CTO\"",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Alejandra Tarrell",
        "content": "Hey! The customer said this was due to the Composer upgrade that we did yesterday and they opened a support ticket at 9 AM MST saying they'd lost access and it wasn't closed until almost 4 PM MST - https://apttus2.lightning.force.com/lightning/r/Case/500Dm00000689ngIAA/view"
      },
      {
        "commenter": "Kelly McCamley",
        "content": "Hey Alejandra, can you advise which specific release this is referring to and I'd be happy to provide more insight into the timing / root cause for the disruption seen. I'm moving this to \"will not implement\" as planned outages are scheduled for outside of business hours and if there's an outage during business hours its not intended. Thank you"
      }
    ]
  },
  {
    "title": "Capitalizing Table Data",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Create functionality like this:https://documentation.conga.com/composer/february-23/capitalization-and-number-format-field-switches-for-word-templates-143198659.html that works on tablelist",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Ability to subtract merge fields inside the CET or normal Conga Template.",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "Requesting to have a function subtracting 2 or more merge fields that can be used on CET and Conga Templates.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"Future consideration\""
      }
    ]
  },
  {
    "title": "Get Number of pages along with PDF after Merge",
    "author": "Manoj Kumar",
    "product": "Conga_Composer",
    "content": "Currently, we are using the conga merge capability to merge two or more pdf together. We have a business requirement to capture the number of pages, can conga provide this information?",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, Thank you for your idea. I've moved it to \"Future Consideration\"."
      }
    ]
  },
  {
    "title": "Adding Additional Languages for Composer UI",
    "author": "Colton Lederer",
    "product": "Conga_Composer",
    "content": "Would like to see Spanish, Chinese, and Portuguese.\n \nSupported Composer User Interface Languages\nhttps://documentation.conga.com/composer/latest/supported-composer-user-interface-languages-143198500.html#:~:text=Conga%20Composer%27s%20user%20interface%20currently,German%2C%20French%2C%20or%20Polish.\n \nCustomer: Rockwell Automation- https://apttus2.lightning.force.com/lightning/r/Account/0011U00000D91yvQAB/view\nComposer Opp- I'm waiting on specific user counts for those languages.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello,We support Spanish in the Composer Lightning Component. Check out the following documentation: https://documentation.conga.com/composer/february-23/supported-languages-for-composer-lightning-component-ui-143887697.htmlDoes the customer currently use the Lightning Component or classic/oauth buttons? I've moved the idea to \"Future Consideration\" as we evaluate expanding our supported languages in the future.Thank you"
      }
    ]
  },
  {
    "title": "e-invoicing for French companies",
    "author": "Fabien Sparfel",
    "product": "Conga_Composer",
    "content": "Hi team,\n \nA new regulation in France will state that any company should be able to accept and send e-invoicing. Basically, companies would have the choice to use a solution developed by the french government or deploy a \"partner e-invoices platform\" that would have been stamped by french regulation authority.\n \nThis measure will be deployed progressively. Enterprise accounts will have to comply with that regulation by July 2024 and small business by 2026.\n \nWe have here a chance to develop a solution - or enhance our Composer API features - to launch a solution that any business in France will have to evaluate in the next months.\n \nHappy to provide more info !\n \nBest regards,\n \nFabien",
    "votes": "",
    "comments": []
  },
  {
    "title": "e-invoicing for French companies",
    "author": "Fabien Sparfel",
    "product": "Conga_Composer",
    "content": "Hi team,\n \nA new regulation in France will state that any company should be able to accept and send e-invoicing. Basically, companies would have the choice to use a solution developed by the french government or deploy a \"partner e-invoices platform\" that would have been stamped by french regulation authority.\n \nThis measure will be deployed progressively. Enterprise accounts will have to comply with that regulation by July 2024 and small business by 2026.\n \nWe have here a chance to develop a solution - or enhance our Composer API features - to launch a solution that any business in France will have to evaluate in the next months.\n \nHappy to provide more info !\n \nBest regards,\n \nFabien",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea submission. I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Ability to put border on merged Images",
    "author": "Carlo Sanchez",
    "product": "Conga_Composer",
    "content": "Be able to put border per picture that are merged from salesforce via a query into template via composer.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, thanks for submitting your idea. This is not a feature within Composer that we will be prioritizing. I have moved to \"Will not Implement\""
      }
    ]
  },
  {
    "title": "Allow images to stay behind text in a Powerpoint template",
    "author": "Mark Turner",
    "product": "Conga_Composer",
    "content": "At present it is not possible for an image to remain behind text when using a Powerpoint presentation. The example that I have just worked on is that a user had a table which contains mergefields which are a numerical value. Behind this table on the template are mergefields in boxes using the IMAGE prefix and have been \"Sent To Back\" by right-clicking on the boxes - these images are coloured squared which are used to create a conditional format of sorts.\n \nWhen the document is merged, the coloured images are always pushing in front of the table - the user then has to right-click on the image and select \"Send To Back\" again",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea! I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Increase Limit on Adding Conga Queries to Solution",
    "author": "Peter Carolino",
    "product": "Conga_Composer",
    "content": "The customer can no longer able to add new Conga Queries to our Conga Solution as we have reached the limit.\nthey are already in the enterprise edition. and looking to extend to 150 or 200 limitations.\nhttps://documentation.conga.com/composer/september-22/product-data-limits-184424040.html",
    "votes": "",
    "comments": [
      {
        "commenter": "Ashwin Vegad",
        "content": "This is a must for larger, complex Contracts."
      }
    ]
  },
  {
    "title": "extending query limitations for enterprise.",
    "author": "Peter Carolino",
    "product": "Conga_Composer",
    "content": "Customers can no longer able to add new Conga Queries to our Conga Solution as they have reached the limit. and looking to increase the limit on adding new Conga Queries.\nThey are already in the enterprise edition. \n \nhttps://documentation.conga.com/composer/september-22/product-data-limits-184424040.html",
    "votes": "",
    "comments": []
  },
  {
    "title": "extending query limitations for enterprise.",
    "author": "Peter Carolino",
    "product": "Conga_Composer",
    "content": "Customers can no longer able to add new Conga Queries to our Conga Solution as they have reached the limit. and looking to increase the limit on adding new Conga Queries.\nThey are already in the enterprise edition. \n \nhttps://documentation.conga.com/composer/september-22/product-data-limits-184424040.html",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Thank you for the idea submission. We will review this along with Salesforce query considerations and determine if there is a path forward."
      }
    ]
  },
  {
    "title": "Unable to return Percentage format with merge to PDF",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "Percentage format working properly with Word documents when converted to PDF - percentage fields no longer works",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to have separate tab or app for Template Builder",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "The customer would like to access Template Builder without accessing the button or any solutions.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Have IF Statements work with Dynamic Fields in HTML Function in Word",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "The customer would like to use IF Statement in HTML and it's not showing as a clickable URL in the PDF output",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Percentage field not working correctly in PDF Template",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "Unable to return Percentage format but is working fine in Word document",
    "votes": "",
    "comments": []
  },
  {
    "title": "Automatically update domain in Community Button",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer is looking for a functionality that will update the domain on their Community button when they refresh a sandbox. This will save the customer a lot of time especially that they are constantly updating.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "ability to merge image from Salesforce rich text field using <img> tag",
    "author": "Caitlin Neppl",
    "product": "Conga_Composer",
    "content": "From Composer documentation \"HTML in Word\", images stored directly in rich text fields are not currently able to be merged in Composer and a download link must be included in the field for it to be merged in Composer. Customer is requesting that images stored in the <img> tag be mergeable using the HTML prefix.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "We are actively investigating improvements to our image merge capabilites, and will take this Idea into consideration."
      }
    ]
  },
  {
    "title": "Composer Email Related List",
    "author": "Johnny Checton",
    "product": "Conga_Composer",
    "content": "Currently, when the \"To:\" field in a Conga Composer email is set to a ‘User’ ID, then an ‘EmailMessage’ will not be created or related via the ‘Activities’ on the record specified by 'EmailRelatedToId.'\n \nSo, for instance:\n1) From any object with an Email Related List, launch a Composer \"Merge & Email\" button with EmailRelatedToId set to the parent record\n2) Set the \"To\" field as a 'User' record\n3) Send the email\n4) Observe that no Activity or EmailMessage record is created\n5) Repeat with a 'Contact' or 'Lead' record in \"To\" and observe that Activity and Emailmessage are created\n \nRelated Jira issue CM-4891\n \nRequest: add the 'User' record as an available option for generating the expected behavior",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello,Thank you for your idea, I've moved it to \"Future Consideration\""
      }
    ]
  },
  {
    "title": "Increased flexibility with Composer Lightning Component",
    "author": "David Vernall",
    "product": "Conga_Composer",
    "content": "Hi Team,\n \nElavon, Inc have multiple Composer LCs per page and would like to be able to edit the name of the LC (from Conga Document Generation) or even just change the colors, as a way to differentiate between the different components.\n \nThank you for the consideration",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "This can be done with out of the box Salesforce tools, and is not dependent on Conga."
      }
    ]
  },
  {
    "title": "Creating Sheet for a Group",
    "author": "Jose Longno",
    "product": "Conga_Composer",
    "content": "Based on QuoteLineGroups in Salesforce CPQ, can the customer dynamically create each sheet for a group with Sheet Name = Group Name and Content in the sheets as quotelines within the group. This is a unique use case and they were not able to access the capabilities of Conga with the documentation that is available to them. Your guidance would be appreciated.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Thank you for sharing your idea. I recommend working with Conga professional services to determine if there is an opportunity to create an output that matches your business requirements. As this submission doesn't describe a product enhancement, we will not be proceeding here."
      }
    ]
  },
  {
    "title": "Creating Writeback Tags for DocuSign Custom Envelope Fields",
    "author": "Brandon Cole",
    "product": "Conga_Composer",
    "content": "The ability to merge a Salesforce value into a DocuSign Envelope Custom Field, dynamic to the Salesforce record the documents are generated from. We integrate our Docusign with eOriginal for vaulting Completed Envelopes, and having this field sync through the process would Envelope Custom Fields to enable sorting, filtering, and searching on that field value.\n \nIn simple form, our process is as follows, and need to pass this SFDC merge field through:\n \nSalesforce Opportunity > Conga Composer > DocuSign > eOriginal",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Does this use case not work with the DocuSignCustomField and DocuSignCustomFieldValue parameters? If not, can you provide some additional detail on the DocuSign field that needs values passed to it."
      }
    ]
  },
  {
    "title": "Make Live Edit feature available for Excel templates",
    "author": "Heather Rhodes",
    "product": "Conga_Composer",
    "content": "Make the Live Edit feature available for Excel templates - currently parameter only works for Word templates.\n \nConga Documentation: Using Live Edit: https://documentation.conga.com/composer/latest/using-live-edit-143199452.html",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "The Live Edit feature works by converting the Word doc to an HTML file type, which wouldn't work for Excel. We will add to our backlog a feature that opens the merged document to make edits prior to sending to ultimate destination. We do not have an definite date on when we'll address this work. Thank you for submitting the idea."
      }
    ]
  },
  {
    "title": "Increase the upload size from 2MB TO 10MB",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "Requesting to increase the upload size from 2MB to 10MB when using LWC button to upload template.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Thank you for submitting this idea. We will research our options and consider this as a future enhancement."
      }
    ]
  },
  {
    "title": "Give Composer the ability to merge images added to Rich Text Fields",
    "author": "Jeff Ercolani",
    "product": "Conga_Composer",
    "content": "Rich Text Field images are inconsistent when merging into a Composer Word template. It seems that when the URLs generated when an image is added to a rich text field are public URLs, the functionality works. However non-public image URLs do not appear to work, and many orgs are configured such that the generated URLs are non-public.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to \"Future Consideration\" to review when we expand our image capabilites with Composer."
      }
    ]
  },
  {
    "title": "Ability to pull merge fields in attachments",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "The customer would want to merge fields in templates and attachments.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Hello - Thank you for submitting your idea. Any document file that needs to have merge fields needs to be a template. Attachments are reserved for static files that help create a larger final document output. We recommend calling your attachment with the template parameter rather than the attachment parameter."
      }
    ]
  },
  {
    "title": "APDF Parameter with a value of 0 for Composer should be able to download PDF files and can be accepted even when emailing through Salesforce",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "The APDF Parameter with a value of '0 'should be able to download PDF files and can be accepted even when emailing through Salesforce. Because currently, it is a limitation.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea. I've moved to \"future consideration\"."
      }
    ]
  },
  {
    "title": "sort the order of the templates on a zip file similar to how the query is sorted",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer is looking for a way to sort the order of the templates on a zip file similar to how the query is sorted and a way to number each template(1,2,3...) on the zip file.\nThey are using OFN and the templates are currently sorted alphabetically",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Use IF statement with AUTOSUM(ABOVE) or SUM(ABOVE) functions to total an international currency field",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer wants to be able to use If statements with AUTOSUM(ABOVE) or SUM(ABOVE) functions to total an international currency field. They were advised about the workaround on the documentation. Having the option to use an IF statements is much easier and less complicated so they would prefer to this functionality.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Font Size should match setting in Rich Text Field",
    "author": "Caitlin Neppl",
    "product": "Conga_Composer",
    "content": "When merging a rich text field from Salesforce using the HTML prefix in Word, the font size set in the rich text field in Lightning should match the font size of the merged content. Currently it's a proportional relationship (14pt -> 10.5pt / 20pt -> 15pt) which makes it more difficult to make output documents look seamless.",
    "votes": "4 Votes",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Thank you for your idea, I've moved to \"future consideration\""
      }
    ]
  },
  {
    "title": "Contact Field in Lightning Component Button needs to show details on mouse hover",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "The customer would like to request the contact field when the Lightning Component button is generated to show contact details (compact layout details) if there are multiple results that show up. The details show an email address or other information for the contact to determine the differences between each duplicate result. See below for the screenshot of what they are requesting:\n \n\n \nTo show like this on mouse hover (sample)",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Brian Farr",
        "content": "Hello - Thank you for submitting this idea. At this time, this is not a feature request we will be taking on."
      }
    ]
  },
  {
    "title": "Change Hardcoded Ids saved in Congas Metadata",
    "author": "Brandon Cole",
    "product": "Conga_Composer",
    "content": "The customer requests a new feature that allows manipulation of the currently hardcoded ids saved in Conga's metadata that you feel will improve the experience when moving page layouts between orgs.\n \nDifferent than Conga Keys.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello! Can you elaborate on what \"hardcoded IDs\" the customer is referring to? Is this the Conga key that's created with a new template or query? Please provide an example of the hard coded ID being referred to. I have moved to \"future consideration\" status"
      }
    ]
  },
  {
    "title": "Domain API enhancement for SendGrid",
    "author": "Thomas Kirkland",
    "product": "Conga_Composer",
    "content": "Potential to do the following:\n \n﻿Add a piece of code in the API message Conga is sending to Sendgrid. Could you have this addressed with the dev team?\n \nLike below (example coming from Sendgrid support)\nOnce you have 2 IP pools, you would just want to refer to each pool in your API call when you are sending using the appropriate domain. So for example, if you had a pool called \"cloud1.nl\" for the IP pointing to that domain, when you send mail from that domain you would add the following object into your API call\nnodejs example:\nipPoolName: 'cloud1.nl'\nC# example:\nmessage.IpPoolName = \"cloud1.nl\"",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Masking of Sensitive Data for Composer",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "A customer is requesting to mask sensitive data and only the system admin has the ability to unmask it when the document is received. The reason behind this is that they will use it in sending agreements to their clients because they have a payment form included that their clients need to complete.\n \nIf it is possible to add a parameter for it to function.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Allow Conga to retrieve 1000 folders and above for any given level of Composer Document OFP - Box Integration",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "Box implementation has some folders that has more or less 2000 folders and it fails.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer to transcribe ISO codes for countries to actual value",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Composer should have the ability to transcribe ISO values in salesforce to actual value. for example during merge process have the value DE turn to Berlin germany into template after merge process",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Australia (AUD) currency support (Culture Code)",
    "author": "Thomas Kirkland",
    "product": "Conga_Composer",
    "content": "Customer would like Australia (AUD) currency support (Culture Code) Australian culture code to format currency as A$ rather than just $.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Add Live Edit Feature in Lightning Component",
    "author": "Katherine Olivario",
    "product": "Conga_Composer",
    "content": "Customer would want add a feature in live editing templates for LC",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer button unreadable when mouse hovers over",
    "author": "John Bow",
    "product": "Conga_Composer",
    "content": "BEFORE and AFTER\n\n \n\nFrom: Kelly McCamley <kmccamley@conga.com>\nSent: Thursday, January 19, 2023 00:17\nTo: John Bow <jbow@conga.com>; Nishit Langaliya <nlangaliya@conga.com>\nCc: Dhananjay Joshi <dhjoshi@conga.com>; Jian Sun <jsun@conga.com>; Dhananjay Bakliwal <dbakliwal@conga.com>\nSubject: RE: Composer request\n \nHello All,\n \nThank you for bringing this to our team’s attention. There isn’t a way to change this UI behavior without further development from our engineering team. Please create an IDEA so that we can keep this on our radar to update in the future.\n \nThank you,\n \nKelly McCamley | Sr. Product Manager - Composer\n \nFrom: John Bow <jbow@conga.com>\nSent: Wednesday, January 11, 2023 3:35 AM\nTo: Nishit Langaliya <nlangaliya@conga.com>; Kelly McCamley <kmccamley@conga.com>\nCc: Dhananjay Joshi <dhjoshi@conga.com>; Jian Sun <jsun@conga.com>; Dhananjay Bakliwal <dbakliwal@conga.com>\nSubject: Re: Composer request\n \nJust quick video to illustrate this point - see attached\n \nJohn\n \n \n \nFrom: Nishit Langaliya <nlangaliya@conga.com>\nSent: Wednesday, January 11, 2023 06:04\nTo: Kelly McCamley <kmccamley@conga.com>\nCc: Dhananjay Joshi <dhjoshi@conga.com>; John Bow <jbow@conga.com>; Jian Sun <jsun@conga.com>; Dhananjay Bakliwal <dbakliwal@conga.com>\nSubject: Composer request\n \nHello @Kelly McCamley,\n \nWe are facing one CSS issue in lightning component of composer.\nWhen we use composer solution from lightning component then name of the solution will not be visible on mouse/pointer hover.\nYou can find the image below:\nBefore Hover\n\nAfter Hover\n\nDo we have any solution to archive this?\n \nThanks & Regards,\nNishit Langaliya\nAssociate Consultant – EMEA Offshore Team | Sales Engineering\nMobile| +91 – 94299 41294  Email | nlangaliya@conga.com\n \nCONGA | A Wing, 6th Floor, Commerce House -5, Besides Vodafone House, Prahladhnagar Corporate Road, Ahmedabad – 380 051 INDIA",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "CDN Image Access",
    "author": "Ben Kerkhoff",
    "product": "Conga_Composer",
    "content": "2 $100k clients requested the ability to source images from a CDN with their Composer solution. We are unable to access images if they are not in a public facing URL (which is the whole point of having a CDN). This impacts any organization that needs a standardized image pulled into a client facing document.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Increase template size supported in conga emails as attachment or link",
    "author": "Marija Mockute",
    "product": "Conga_Composer",
    "content": "Max individual template size supported in conga emails as attachment or link is currently -10MB. Customer is asking to increase the size limit. They also mentioned that Salesforce size limit is 25MB and they think we should have it the same. \nCase:\n00799071",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer Link Service - allow to set link expiration date",
    "author": "Marija Mockute",
    "product": "Conga_Composer",
    "content": "Customer has requested for the Composer Link Service feature to have an expiration date allowing them to set the expiry date for the link.\nThey said this would be the only reason they would upgrade from Business to Enterprise and use a link instead of attachment.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "CSName Parameter to not require a second name or last name",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "The business requirement is to pull the recipients from Account Object and there are account names that don't have second names or last names, depending on their profile.\nThey're requesting a conga sign recipient parameter that will accept the first name only.\nCase #: 00823361",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Parameter to Track activity after document has been Locked while using  WPD and WPDPW",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "User would like to be able to track document activity after password protection while using the following parameters: WPD and WPDPW",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Recreate the Solution Migration Tool",
    "author": "Darren Plant",
    "product": "Conga_Composer",
    "content": "Since the Solution Migration tool has been deprecated customers are requesting that this be reimagined and reintroduced to allow quicker and easier migration of solutions to different orgs and setup of sandboxes",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Composer - Hide 'Save a Copy' Options",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "It would be nice if there was an option to hide the different 'Save a Copy' options when using Conga Composer out of background mode. For example there are five options to choose from (Notes & Attachments, Content, Chatter, Documents, Salesforce File) and you would like to prevent users from saving to Chatter. Being able to hide the Chatter option but still allowing the user to select how they would like to save a copy would still leave the user with a little more freedom in how they would like the document to be saved.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer - Additional language",
    "author": "Melissa Rodrigues",
    "product": "Conga_Composer",
    "content": "Customer Seven Tides International would like Composer to be supported in Arabic.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "TableStart/TableEnd merge field indent",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "It would be nice to have the possibility to indent specific records that are being used in a TableStart/TableEnd merge field.\n \nExample:\nProduct_1\nProduct_1a\nProduct_2\nProduct_3\netc...",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Composer - save to Files related list on Parent record",
    "author": "Mark Turner",
    "product": "Conga_Composer",
    "content": "At present, it is possible to only save generated documents on a parent record in the Notes & Attachments related list using this parameter:\n \n&AttachmentParentId=............\n \nThere have been requests to have the ability to have a similar parameter to enable users to save under the Files related list. Salesforce are looking to retire Notes & Attachments so this alternative may be required at some stage.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to add more than 2 pv values in Advanced filter configuration for Lightning Component use",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "The customer would like to have an ability to enable more the 3 or more pv values on a solution for Lightning Component\nCase number: 00816880",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Resize Composer preview window",
    "author": "Marija Mockute",
    "product": "Conga_Composer",
    "content": "The issue that i am having is that the preview window is too small and unable to be resized. Please advise if it is possible to make the composer window triggered by a URL button to either be resized or full screen.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Pulling Tableau tables into documents",
    "author": "Arvid Gutjahr",
    "product": "Conga_Composer",
    "content": "We see increasing interest to pull Tableau visualisations into a Composer-generated document in SF.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "sorting files by name alphabetically when using Composer in the Lightning Component",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "When in the normal Composer interface, it's possible to sort the order of templates, but that same sort ability does not seem to be available when accessing composer in the Lightning Component.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Merging (JPEG, TXT , and WORD) files into one consolidated PDF output",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "The client would like to plan to merge (JPEG, TXT, and WORD) files into one consolidated PDF output when running the composer button. Requested by: Degy Entertainment",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to make attachments  be as a Conga Template when merged and sent via fax",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "When using the Conga Composer and sending a fax, the attachments added to the Fax come through in the fax as links which are not clickable due to the attachments being on physical paper.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer powerpoint - support multiple data tables",
    "author": "Linh Ton",
    "product": "Conga_Composer",
    "content": "Currently ppt slides can only have one TS/TE per slide. A customer Nitin.muduganti@bd.com at dreamforce requested that we support multiple TS/TE (data tables) per slide\n\n\nhttps://documentation.conga.com/composer/latest/add-a-table-to-a-powerpoint-template-143198735.html",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Display all possible DS7 parameters values in the Conga Solutions UI instead of only a handful",
    "author": "Carrie Bellio",
    "product": "Conga_Composer",
    "content": "Only a handful of the possible DS7 parameter values are showing in the Conga Solutions UI, it would be extremely helpful if we displayed all parameter values as shown on DS7 documentation: https://documentation.conga.com/composer/september-22/ds7-193698468.html",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "To show only the \"Preview\" Button in the Conga UI",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "I need to display only the preview button on the conga composer screen. In the attached screenshot now it's showing the preview and merge buttons I want to hide the merge button from the screen. Case #: 00810636",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer button to create a case",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "RACV would like to request Conga Composer to create a case when using Conga Document Generation buttons to send emails – need to send from different objects",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to keep the header and footer in place when using Live Edit functionality.",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Ability to keep the header and footer in place when using Live Edit functionality. Case 00809783",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Merge Images with Salesforce ID in Word feature to be available in Salesforce Files",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Requesting to merge Salesforce Files on a related record into a Word Document instead of Attachments related Documentation https://documentation.conga.com/composer/latest/merge-images-with-salesforce-id-in-word-158341737.htmlcase #: (https://documentation.conga.com/composer/latest/merge-images-with-salesforce-id-in-word-158341737.html) 00809835",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Kelly McCamley",
        "content": "Hello, we will not be implementing this idea at this time. Thank you for submitting"
      }
    ]
  },
  {
    "title": "Adobe reminder frequency",
    "author": "SF Integration Service Account",
    "product": "Conga_Composer",
    "content": "Customer requesting for extra parameter value which is 2 days. ESRemindRecipient",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Email UI",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "To have a larger space to edit the Email Content in the Conga Email UI. https://www.screencast.com/t/Gm2OqgU4eULk Case #: 00809358",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Cover Page",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "The customer is requesting if we can have the same Cover page Feature in Conga Collaborate to Conga Composer.\n\nHere's the documentation\n\nhttps://documentation.conga.com/collaborate/latest/generating-a-cover-page-143889843.html\n\n\nCase #: 00810302",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Hyperlink to work inside if-statment",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "For future enhancement that hyperlink in word will work inside an if-statement\n\n\nCase: 00809527",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "More specific error than operation cancelled",
    "author": "Darren Plant",
    "product": "Conga_Composer",
    "content": "When there is an issue with the template, generally the TS and TE are in the wrong place or don't match, you get an 'Operation Cancelled' error. The customer would like this to be more specific",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Row Burner Feature to be applied in Column",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "The customer is requesting if Composer can apply the feature of the row burner in columns. They're wanting to get rid of the column if it doesn't have any value.\n\n\nCase #: 00808699",
    "votes": "8 Votes",
    "comments": []
  },
  {
    "title": "Ability to change the direction data is displayed in Microsoft Word tables",
    "author": "Austin Miller",
    "product": "Conga_Composer",
    "content": "I would like to see if there is a way to change the orientation of Word tables using the TableStart/TableEnd merge fields. At the moment we are only able to display the data in rows but there are some use cases where the customer would like for the data to be displayed in columns instead.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Multi-Select Picklist Tabular View",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Requesting to have a tabular view when generating data from a Multi-Select Picklist field\n\nCase #: 00807349",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Rubik font style to work on PDF upon generating via Conga Composer",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "Rubik font style to work on PDF upon generating via Conga Composer.\n\n\nReference Case: 00805164",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga UI Design",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "The customer wants to change the Custom Object Name https://www.screencast.com/t/8YKLZ2Tyg to Object Label https://www.screencast.com/t/ZM5W0Lhq in the Conga UI\n\n\nCase #: 00807502",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer Email Draft option",
    "author": "David Vernall",
    "product": "Conga_Composer",
    "content": "When going to send an email, instead of pressing Send, there is an option to pend the email into a pending queue for a set duration. During this pending status, the email can be edited or recalled for update prior to being sent to the recipient.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to have Template Builder Button access in Conga Email Template to update the attached Word/Excel/PDF template",
    "author": "SF Integration Service Account",
    "product": "Conga_Composer",
    "content": "Ability to have Template Builder Button access in Conga Email Template to update the attached Word/Excel/PDF template﻿",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Row Burner and TableHide at the same time in one table",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Requesting to combine tablehide, rowburner and IF statement in one table.\n\nWe can use either and IF Statement wit Row burner or an IF Statement with Tablehide at the same time.\n\n\ncase #: 00806051",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "OFP functionality for Google Team Shared Drive",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Coastal Cloud (Partner) reach us out about Google Drive Integration. Ability to use OFP parameter for Google Team Drives",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Table group can filter 2 fields",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "Request to filter 2 fields when using TableGroup functionality.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "ability for end user attach a file and send it back to Salesforce",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Customer would like to have an ability to use Conga to send out document and have the end user attach a file and send it back to Salesforce without requesting any signature. Case ID: 00805135",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "A confirmation that an email is successfully sent to the recipients",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "customer is looking for a functionality that will say that the email or fax has been successfully received by the recipient.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Return to, composer UI function for the Community",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Ability to modify the \"return to\" function to a different page.\n\n\nThis would benefit the Community user to get routed to their recent page or to their home page, right now the \"return to\" routes the user to a salesforce login page.\n\n\nRelated case 00801046",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Using calculation script with DocuSign parameters",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "I have a customer who is running calculation script with their template. Everything works correctly with their calculation script, except when the value is zero and docusign parameters are being used in their button url. The very same calculation script works with the docusign parameters if it has a non-zero value. Customer wants these parameters to be able to handle calculation script with a zero value. But if this is not possible, then a way to proceed with docusign without being blocked by the error (caused by the calculation script.)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Template Troubleshooting Tool",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "When the user receives a template error, they are not sure where in the template the error is ocurring. Having some kind of troubleshooting tool to pinpoint issues in Templates would save users a lot of time identifying what's wrong. It would be extremely useful for having to find errors in larger templates with many pages and tables.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Composer Setup Usage Dashboard",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "if there is anyway for us to find out the count of a particular that is been used . For EG: If we have 5 Email templates , I would like to know, the usage of each templates, how many times this template was used to generate an email.\n\n\nCase #: 00802036﻿",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Date Format",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Conga document is used for College issue testamur, for course completion date field, it requires sth like below:\non the > day of > >\n\ni.e. if the date is 1 July 2022 then it should display as \"on the first day of July 2022\".\n﻿\n\nCase #: 00804723",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "search feature in Conga Email",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "where only the To: field has a search facility while all other recipient fields do not have the search unlike the Classic version. As part of the SFLU project, we'd like the search feature also available in Conga Email in Lightning\nscreenshot - https://www.screencast.com/t/Gh8KShXY0TDI",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Reformat merged output after being sent for signature",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "I have a customer that wants the ability to conditionally display certain fields and tables, based on whether or not the recipient selects a checkbox field (when signing). This would allow them to update their generated document based on what the recipient selects.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Composer for Salesforce Mobile (SF1) runs without background mode (DS7)",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "Conga Composer with Salesforce mobile (SF1) will also work without background mode so that mobile Users will be able to still get redirected to this Preview URL so that they can confirm the information on the Contract as well as input the correct recipient.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow Conga Solutions to create buttons when there are more than 1000 custom objects",
    "author": "Darren Plant",
    "product": "Conga_Composer",
    "content": "When you have over 1000 custom objects Composer Solution manager fails to create buttons meaning they have to be manually created.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to pull more than 25,000 rows per query",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Ability to pull more than 25,000 rows per query",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Ability to use complex HTML code when building email templates",
    "author": "Mark Turner",
    "product": "Conga_Composer",
    "content": "This relates to cases 00800329 and 00798786\n\n\nThe use case is that a customer is using HTML code to create email templates - the templates look fine when running through an HTML Editor but when using CETs, there are extra spaces appearing on the output email. I have been advised that the Advance Editor cannot currently handle custom HTML coding so the customer has asked for a Feature Request to be made to enhance the Advanced Editor to allow for this.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Sending email notifications when an update is about to be implemented",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "The client is requesting that notifications will be sent when updates are being made or prior of being implemented.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "To enhance or optimize the Conga Composer Merging Process",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Requested by Kotak Bank\n\nCase #: 0080180\n\n\nMerging process takes 50 seconds to run. They're wanting to make it shorter at around 20-30 seconds on all Composer Button.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "1.\tNegative values in salesforce will be pulled in as (1234) in Word Document",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Requested by Kotak Bank. Case #: 00801081\n\nNegative Values in Financials & Sub limits in facility to come in Bracket ()",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow Preview when multiple templates are selected in Lightning component",
    "author": "Rodolphe Malaguti",
    "product": "Conga_Composer",
    "content": "That would be great to be able to use the preview when more than one templates are selected",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Update 'HTML Email Status' field",
    "author": "David Vernall",
    "product": "Conga_Composer",
    "content": "Customer would like to be able to update the field 'HTML Email Status' in the SF org. At the moment if they run this button in Classic, certain activities like when email was opened, get recorded. But once the button is moved over to Lightning it appears that this field no longer gets updated (without a workaround of using the &EmailFromId parameters, which is not applicable in this use-case)\n\nUltimately this is a feature request for added Activity Tracking parameters, including when an email is opened.\n\n\n00798506 - Guild Mortgage - Chau Trang",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Adding Contact Roles to be Inserted Dynamically",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "Contacts listed in the opportunity contact roles as \"Carbon Copy\" should be pulled into the DocuSign.\n\nWithin the Conga Composer Setup under Docusign Recipient Role Settings, If you have \"Signer 1, Signer 2\" listed. And adding \"Carbon Copy\" to list, then it should bring those contacts into the Docusign submission screen. And being able to add contact roles to be inserted dynamically into the docusign setup page.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow for inline images in PowerPoint",
    "author": "Jeffrey Allen",
    "product": "Conga_Composer",
    "content": "Images can be added in-line and sized appropriately and proportionally in Word, but in PowerPoint, they can only be sized to fill a cell background which does not work when the images may vary in size.\n\n\nRequested by: Fondation Bettencourt Schueller (https://apttus2.lightning.force.com/lightning/r/0013Z00001lmAOiQAM/view)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "QVar 6 - 10",
    "author": "Ryan Walls",
    "product": "Conga_Composer",
    "content": "Customer has a need for more qvar parameters than we currently allow",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "The ability to to auto-adjust the page breaks depending on the number of data to be merged.",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "the customer wants Conga Composer to auto-adjust the page breaks depending on the number of data to be merged. They're wanting Composer to auto-assign the pages. They want to have Composer the capacity to adjust the succeeding information based on the customer's needs.\n\nCase #: 00799528",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to  use double quotes in an RTF and run it through Composer",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Quote mark breaks down rendered output for rich text field\n\n00797466",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "DS7=17 needs docusign UI",
    "author": "Kharl Cultura",
    "product": "Conga_Composer",
    "content": "Customer is requesting the docusign UI when they are using ds7=17 (same behavior with ds7=7)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "attach new document in the send email preview using lightning component",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Any parameter we can use to attach new document in the send email preview using lightning component would be nice",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to utilize merge fields to make hyperlink display text dynamic",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "Currently the dipslay text in a Hyperlink merge field is only compatible with static text. I have a customer that wants to be able to use a mergefield to make the dispaly text dynamic, based off of another field in Salesforce. They want to be able to do something like this, in order to make the display text specific to the record they're on:\n\n{{HYPERLINK:FieldName:{{DisplayText}}}}",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enabling Include Signature Checkbox on the Conga Email",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "The user is expecting the signature to appear at the end of the Conga email when the Include Signature checkbox is checked. When clicking on the checkbox, nothing seems to be happening. No signature is appearing on the email template.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Able to stay in conga composer UI after loading or merging emails.",
    "author": "Peter Carolino",
    "product": "Conga_Composer",
    "content": "the customer is wanting to leave the conga UI page open after the merging process. case 00798120\n\n\nhttps://conga.zoom.us/rec/share/tkAZdRwf1c0lKoRjuRUwKF1cEtAk7FGfSsXlpqVvBJhv5EKOYTvdLtPGjJ6vD1xk.5D1JtjvrtGWJaf70?startTime=1652934656000\n\nPasscode: rFWrRx=3",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Lightning component button arrangement",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Lightning component button arrangement, for more customization, related case 00797533",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to translate generated output",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "When the generate say a Sales Invoice from us they are wanting that document to be automatically translated.\n\n\nSo the flow would be:\n\nUI In English > Click \"Print PDF\" > Conga Takes the data and translates it into French for example > Output PDF is in French\"\n\n\ncase 00797481",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add Composer button to email thread",
    "author": "Lindsey Covington",
    "product": "Conga_Composer",
    "content": "Currently, we can add a Composer button to the Email Message object, but we can't attach the rest of the thread through the button. This would be helpful internally so we can use Composer in our org as well as externally for customers.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Open Composer in a New Window in Lightning",
    "author": "Michael Overman TS",
    "product": "Conga_Composer",
    "content": "On a Composer button, when selecting the button behavior (display in a new window), Lightning doesn't obey this. Customer would like the behavior shown in classic to also happen in lightning",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Improve specificity of error messages",
    "author": "Michael Overman TS",
    "product": "Conga_Composer",
    "content": "customer asks that error messages for composer be more specific about what's triggering the error (in this instance, including",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Skip Columns in Excel",
    "author": "SF Integration Service Account",
    "product": "Conga_Composer",
    "content": "We found out that there are not parameters or merge field that can skip columns in excel",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Parameters to update child object fields",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "We currently have MFTS, UF0 for master object field but we don't have any parameters that can update child object fields.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Want to have the capability of encryption as well as viewing the data without encryption",
    "author": "Emeryll Monique Emelo",
    "product": "Conga_Composer",
    "content": "Useful if the profile set has View Encrypted Data enabled.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add Attachment to Component Conga Email template UI",
    "author": "Nathan Kirwood",
    "product": "Conga_Composer",
    "content": "Customer would like the ability to add local attachments to the Conga Email UI when launched via component, this is currently possible via the Conga email UI when launched via a standard button.\n\nRequested by Engie\n\nCase-00792789",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Jacques Dalmas",
        "content": "French GLobal electric group Legrand, (market cap 23Bn$) currently in closing CW stage for new logo, is making the same request in Lightning mode."
      }
    ]
  },
  {
    "title": "Ability to utilise Docusign Email Templates",
    "author": "Darren Plant",
    "product": "Conga_Composer",
    "content": "Customer would like the ability to use Docusign Email Templates",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Default Buttons to be removed.",
    "author": "Peter Carolino",
    "product": "Conga_Composer",
    "content": "The Customer wants to remove certain buttons on the preview mode. specifically on the red line in the attachment. Case # 00792466",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Requesting to include QVARs when using the Solution Migration Tool",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "we need your migration tool to be able to move including Qvar configured solutions.\n\n\nRequested by: AARNet (https://apttus2.lightning.force.com/lightning/r/0013Z00001muLrMQAU/view)\n\nCase #: 00791669",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Create non-editable PDFs for regular users except for internal users after merge and download",
    "author": "Raenard Joseph Reusi",
    "product": "Conga_Composer",
    "content": "Kayla Meissner would like to have a Conga composer functionality that will allow the PDFs being downloaded to be restricted/non-editable for regular users except for internal users.\n\n\nHow it works:\n\n1. After the merge and download in Composer, the PDF file will be downloaded, and when a regular user opens the file, they can view the file but the user will not be able to edit the PDF.\n2. Only internal users that has password access can download, view and edit the file.\n\nSummary:\n\nRegular users: Download>View>Unable to edit PDF file\n\nInternal users: Download>View>Edit the PDF file",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow Composer to send emails inside Service/Sales Console without refreshing the entire page on sending the email.",
    "author": "Michael Overman TS",
    "product": "Conga_Composer",
    "content": "currently in Service Console, despite any other behavior being selected, when Composer sends an email and redirects, it refreshes the entire page, which causes issues for those who use Service Console with a queue, Omni, or Service Cloud Voice.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Open Composer UI in a new tab",
    "author": "Christine Alcansado",
    "product": "Conga_Composer",
    "content": "Customer would like to open the composer in a new tab not just in the same window.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Make Composer expiration message hidden from end users, and only visible to admins",
    "author": "Alejandra Tarrell",
    "product": "Conga_Composer",
    "content": "My customer shared feedback that they were involved in lengthy renewal negotiations with Conga and our in-product expiration banner caused extreme confusion and frustration for their end users. Their admin team was getting pinged daily by their 200+ end users about the product expiring, even though they were given an extension and the delays came from Conga.\n\n\nTheir CIO told me that they leverage over 50+ solutions in their tech stack and Conga is the only one that disrupts their end-users at renewal.\n\n\nI wanted to share this feedback if it is possible to make expiration notices only visible to admin/dev team.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enable Printing and Password Protection at the same time",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "We would like a solution parameter that will allow us to print and password protect PDF.\n\nPS0=1 enables password protection but it disabled the printing functionality\n\nPS1=1 enables printing but it disables the password protection",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Caching Issue  in Conga Query Builder",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "The filters are not being recognized in Conga Query Builder. There are caching issues when trying to modify the filters used in the queries. This can be confusing to customers who are trying to build a query for their solution and the incorrect information is being displayed for the value of their filters.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "conditional row display in excel",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Currently we have this functionality on Word but not for excel. as we have many clients that use different document types. It'll be helpful for them if we have a way to do this.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add dashboard from reports to a document/template",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Merge a dashboard unique to an Object into the template\n\nCase ID 00789381",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Key Users could manage the definition and creation of the Conga Solution without being System Admins",
    "author": "SF Integration Service Account",
    "product": "Conga_Composer",
    "content": "Would like an option to have non Salesforce System Admins to be able to create and manage solutions in Conga. Our aim was that some Key Users could manage the definition and creation of the Conga Solution without being Salesforce System Admins. If only Salesforce Administrators can manage these, it will limit the possibilities of how much customers are able to use the product.\n\n\n(Requested by Partner working with Siemens Gamesa Renewable Energy)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add a merge to a file automatically (w/o needing the template builder)",
    "author": "Colton Lederer",
    "product": "Conga_Composer",
    "content": "This group adds multiple documents (exhibits for court hearings) to a case. Once the static PDF files get added, they click a button that is tied to Drawloop, and that automatically add a 'stamp' (a header) that individually marks each document with an exhibit number.\n\nThey also have Composer. They would like Composer to do that same functionality. They have both Composer and Drawloop, and are deciding between one or the other.\n\n- Colton Lederer\n\n\nState of Michigan Department of State (MDOS - DAIS)\n\nhttps://apttus2.lightning.force.com/lightning/r/Account/0013Z00001lmFbVQAU/view\n30 CM Seats",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Merge fields inside of Word shapes to render on PDF output",
    "author": "Lindsey Covington",
    "product": "Conga_Composer",
    "content": "If you are using a Word template that contains Word shapes in which there are the merge fields, the shapes appear empty where the merge field is if my output is PDF. If I select Word (Same as template) for the output, it works: the shape is repeated and the fields are merged.\n\nEx: https://www.screencast.com/t/rSXRjwT6H\n\nUsing this method: https://documentation.conga.com/composer/summer-21/support-for-text-boxes-and-shapes-in-word-143198663.html\n\nThe request is to have the same automation when output is Word for merge fields in shapes.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow greater precision in currency calculations",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "From case: 007788015\n\nWhen dealing on decimal places, they encounter inaccurate results or variance,\n\n\nFor example, one column has 4 decimal places, next column has two.\n\nIf sum up, there are cent variance between the columns.\n\n\nPlease see video recording on the case for reference.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Automatically close the composer UI pop up after merging process when the button behavior is set to 'Display in new window'.",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "Customer is running the solution in Classic and wants the composer UI to pop up when the button is clicked but automatically closes after it completly merged. Customer wants's a pop up so they can do other things in SF during the merge process and does not have to wait for it to complete before being able to update something else on the record page or somewhere else in salesforce. The other button behavior takes up the whole screen when merging and so they'd need to wait for the merge process to complete before they can move forward with other things.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow + in email address in EmailBCC parameter",
    "author": "Darren Plant",
    "product": "Conga_Composer",
    "content": "More and more we are seeing a plus in an email address as you can use this to organise gmail emails.\n\n\nIf there is a plus in the email in the emailbcc parameter this doesn't work. We have tried using %2b instead of the plus, but this doesn't work.\n\n\nCould we have a similar solution to the substitute for & for plusses in email addresses - https://documentation.conga.com/composer/december-21/replace-ampersands-in-reference-field-data-143199341.html",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Not require the GroupByColumn field to use the SUBTOTAL9 Formula in Excel Template",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "Customer's may need to use the SUBTOTAL9 formula, but want to select the specific cells to sum and not have to group on a certain field. This would allow for more customization and flexibility for users with more complex templates.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Write back tags for Adobe Sign",
    "author": "David Vernall",
    "product": "Conga_Composer",
    "content": "Exact same as we have for Conga Sign, but customer wants for Adobe\n\n\ncase: 00786854",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Composer and DocuSign integration parameters",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "Be able to use Conga Composer and DocuSign integration parameters with DocuSign App Launcher",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Supported Files",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Our customer under this case number 00786614 is requesting to add the file formats below as supported templates\n\n.csv File\n\n.txt File\n\n.mp4 File\n\n.xml\n\n.zip",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "fully translate Merge data for CPQ from English to other languages",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "Currently SF CPQ can't fully translate everything during a Merge. As of know we know that CPQ has troubles translating all merging text from English to French and from English to Dutch.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow Solution Migration Tool to use Existing queries and template",
    "author": "Darren Plant",
    "product": "Conga_Composer",
    "content": "When you migrate a solution that references an existing query or template the import fails as the Conga Key already exists.\n\n\nIf you create multiple solutions in a sandbox that re-use the same queries after migrating the first one the rest fail as the Conga Key already exists",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Remove spaces returned by empty merge fields in template",
    "author": "Dhanie Bermas",
    "product": "Conga_Composer",
    "content": "When merging document that will have fields that are empty it leaves huge spaces on the output template that customer wants to eliminate.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Rich Text formatting",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "It would be a great idea to retain the Rich text formatting (lists) and to look like what it is in Lightning in the generated documents/Composer output instead of using the template itself. Hoping to make changes or updates to the way Composer works with lists.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Test composer idea",
    "author": "Ramya Dasaratha",
    "product": "Conga_Composer",
    "content": "Test notification",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Sort orders that contain blank values",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "When ordering records by a sort order field in the WHERE clause of a query, records with a blank value always get displayed before records with an order number as its value. The customer wants to be able to display records with a Sort Order (in the correct order) followed by records without a sort order value (blank value). This enhancement would allow users to display their records in a more customized way.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow to create an image files JPGs output in Composer",
    "author": "Hanah Bengson",
    "product": "Conga_Composer",
    "content": "The customer would like to have an ability to create an image files JPGs output in Composer that will allow them to use Conga to create flyers for an event. They said that the PDF is great for the printing of a physical flyers, and they already know they can use Conga for that, but they also like to create a \"digital flyer\", that is an image file that can be shared via social media that advertises their event.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Dynamically create subsheet in excel template",
    "author": "Josie Panergo",
    "product": "Conga_Composer",
    "content": "Our customer under case # 00784224 is requesting if they can dynamically create sub sheets in excel template using conga query i.e based on different criteria.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enabling Composer to Pull Many Children Records from Many Parents Records",
    "author": "Nancy Vicari",
    "product": "Conga_Composer",
    "content": "Allow Qvar to store multiple unique identifiers to be ingested by another query, thus enabling Composer to pull many child records from many parent records.\n\nUse Case 1: Customer makes multiple purchase in a day resulting in many orders that are 'related'. Operations would like shipments to be as cost effective as possible, this means warehouse staff needs to pick and ship inventory in the least amount of boxes as possible based on weight, dimensions and quantities sold on order lines. In order to do so, they will need a pick list printed for picking as well as a pack slip in the boxes before shipment is out the door.\n\nUse Case 2: Consolidated invoicing, similar to above, difference is a finance user is able to print out many invoice lines that are from multiple invoices belonging to the same customer or purchase order number.\n\nSolution: Allowing Composer to query child records based on the following logic (not a SOQL query)\n\nSELECT ProductName, Quantity, Weight, Dimension, Price\n\nFROM OrderLines\n\nWHERE ParentOrderIdentifier IN (QVar Result Set)\n\nIdea: Allow Qvar to store multiple identifiers to be used in another query's WHERE clause with IN. Based on numerous past test, current product capability does not allow that to happen, it gets very close though, the delimitator usually comes out wrong.\n\nIdeally, the feature can output errors when the query exceeds SFDC governance\\syntax limit similar to the errors we display for queries that went rough in the datafile today. These type of query can get out of hand fast if someone does not know what they are doing,",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Improvement for Contact search function when using Conga Email templates",
    "author": "Nathan Kirwood",
    "product": "Conga_Composer",
    "content": "When using Salesforce email template, users can see a list of Salesforce company users that can be quickly added in the CC field, like this (https://i.imgur.com/LAN2ILC.png)\n\n\nUsing Conga email template, the list is not available.\n\nUsers have to click on \"add recipients' and then look for each name manually which can take a lot of time. (https://i.imgur.com/NWlGYE6.png)\n\nCustomer had the suggestion to streamline searching for contacts similar to SF emails as it more user friendly.\n\n\nRequested by Electre (https://apttus2.lightning.force.com/lightning/r/0013Z00001lmPWbQAM/view) on Case 00779562",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add additional languages",
    "author": "Lindsey Covington",
    "product": "Conga_Composer",
    "content": "Alcon Vision would like these languages to be added: Czech, Hungarian, Turkish, Norwegian, Finnish, Danish, Thai, Korean.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Ability for macros to execute in Composer",
    "author": "Lindsey Covington",
    "product": "Conga_Composer",
    "content": "Alcon Vision would like to be able to have macros execute automatically in Excel instead of the end user having to execute them on the output doc.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Dhanie Bermas",
        "content": "I have a customer that is looking for a  way to use Marcos with Word templates. Commenting this here instead of creating a new Idea."
      }
    ]
  },
  {
    "title": "Single report for records and subset of.",
    "author": "Penny Long",
    "product": "Conga_Composer",
    "content": "Simple Description:\n\nIn Lightning interface, End User creates a filtered List View in a custom object to return a list of results. Then while viewing the list of results records, End User *randomly* selects a subset of records from the full list by clicking on checkboxes of records. Then when End User has selected the random records desired from the list, they click a report generation button on the list view/object to output the record dataset to a *single* combined report.\n\nOne of the Business Examples:\n\nEnd User needs to search for sales or lease comparables by market, price, SF, etc using List View on custom Comparables object. Then when the list of 25-100 records fitting filter criteria is returned, End User will manually review the list to select 3-5 of what they feel are the best records to use for a client facing comparable report. The 3-5 selected records are output into a single report to be presented to the client.\n\nCurrent:\n\nClient is using Conga Composer and Grid. Original request was to be able to select and output the records from Grid view. We also discussed using List View as alternative. Conga has given mixed feedback on requiring the use of Batch to output random selected records into a single or multiple reports from Grid or Lightning List View. Pricing was quoted at $6k plus transaction fees for Batch. Cost and Use Case does not justify full use or cost benefit of typical Batch solution—based on client feedback. CBRE is now asking about seeking alternative solutions including reviewing S-Docs to see if they can provide the functionality with their native solution.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Rowburner functionality for Excel",
    "author": "Lindsey Covington",
    "product": "Conga_Composer",
    "content": "Valcon Visions would like there to be a rowburner type functionality for Excel templates.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Lightning Component Fixes",
    "author": "Jimmy Wenham",
    "product": "Conga_Composer",
    "content": "The following items need to be fixed for the Lightning Component.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Change the limitation in visual force pages- Collection size 1,036 exceeds maximum size of 1,000.",
    "author": "SF Integration Service Account",
    "product": "Conga_Composer",
    "content": "The customer gets this error but is having issues deleting objects in her org and wants to be able to create a composer button in Conga solutions. User was previously advised to build a button manually to avoid this limitation error. Collection size 1,036 exceeds maximum size of 1,000. Get this error when selecting \"new\" on conga solution tab Re opening case #00773181. This was previous determined to be a governor error from a Salesforce setting. I opened a case with Salesforce and they have determined that is error has occurred several times in the past with other Conga/Salesforce clients and the resolution was implemented by Conga. The issue is on the code for the Conga Query Visual Force Page. There is something in regard to the editing and deleting functions that are performed on Conga Queries.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Localization of Lightning Component UI - CQG",
    "author": "Matt Penrod",
    "product": "Conga_Composer",
    "content": "I have a customer that wants to be able to change the language used in the CQG Lightning Component UI. This feature would be useful for customers that are doing business in different languages. They would be able to set up the CQG Lightning Component UI in the same way that you would do it for the Composer Lightning Component. (https://documentation.conga.com/composer/summer-21/localization-of-lightning-component-ui-143888082.html)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Outlook and Composer Integration - Requested by customer under case #: 00777834",
    "author": "Kharl Cultura",
    "product": "Conga_Composer",
    "content": "They want to integrate their outlook contact groups and use that as the recipients to the emailtoid and emailadditionaltoid parameters.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Email attachment converted to PDF",
    "author": "Nathan Kirwood",
    "product": "Conga_Composer",
    "content": "Customer requires the ability to add attachments from record to Composer email that do no convert to PDF when the template converts to PDF. When they select attachments manually in Composer UI, they convert the Word template to PDF, this also converts the Excel Attachments to PDF, so they would like the ability to add attachment from record on the Email UI, currently only local files can be added.\n\n\nRequested by Cloud Team Company, Marco Breedveld (https://apttus2.lightning.force.com/lightning/r/0013Z00001lmGd3QAE/view)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Create a new Parameter to print multiple copies",
    "author": "Tracy Cannon",
    "product": "Conga_Composer",
    "content": "Customers occasionally need multiple copies of a document based on a field count or other condition. Please create a parameter called NC. \"Number of Copies\"",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow headers, footers and Page Numbering to continue when merging and a static doc with a template",
    "author": "Darren Plant",
    "product": "Conga_Composer",
    "content": "When using the attachmentid parameter to merge an attachment into one document with a template the customer would like the headers, footers and page numbering to continue from the template onto the static document that was attached to the record",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Button Update History Save in  Salesforce Lightning Notes",
    "author": "Christine Alcansado",
    "product": "Conga_Composer",
    "content": "Customer are converting all of their notes and attachments to content files and notice that Conga Solutions button updates are putting a classic note every time they update the button. Is there a setting or configuration that we can change to create new lightning notes? If not, is it worth putting into our composer's roadmap to change this over within Conga Solutions?",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Batch out put file will be sorted ascendingly",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "Raising this idea for Batch to have sorting order not just on the backend as well as the output file.\n\n\ncase #00773655",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Unable to configure auto-numbering of Conga Template records - Case #: 00776338",
    "author": "Kharl Cultura",
    "product": "Conga_Composer",
    "content": "Both the old \"Conga Merge Template\" and new \"Conga Template\" object both use the same display format for automatic numbering of records, i.e. CMT-{00000} and we are unable to change this. This makes it challenging to map the old templates to the new ones, as they are all numbered from the same range. It would be very helpful if the new Conga Template object records could be named as CT-{00000} instead of CMT-{00000}, so we can tell which ones are which. Is Conga Support able to override the default display format, as we cannot.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add attachments button on lightning component.",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "Add attachment button to LC so the user can add multiple attachments in a single email",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer/Trigger Daily Limit Email Notification",
    "author": "Ben Racine",
    "product": "Conga_Composer",
    "content": "As the CSM for Amgen Access & Reimbursements, one of my main points of contact asked if the email notification feature that is supposed to send an email to a defined email address when you approach x% of your daily trigger limit is available. They mentioned that this feature has never worked and they recently went over their daily limit which caught the team by surprise.\n\nIt would be great to bring this feature to life to provide our Composer customers with more visibility into their usage and to prevent running into unforeseen circumstances negatively impacting their business.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Template Builder Improvements",
    "author": "Tiffany Kroner",
    "product": "Conga_Composer",
    "content": "The Solutions Manager Template Builder easier to user than the DAW TB and get that feedback regularly. Even when training new users, they complain that building templates are counterintuitive and confusing, so I switch to the SM and they are much happier. Can you add the legacy TB to the DAW? AND is there a way to add the \"Open in Word\" functionality from CFS? That way you can pop it open, make changes, save and have that new version automatically uploaded.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "pull merge filed data from excel  on powerpoint chart",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "clients that want more dynamic templates",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "add multiple tables in one slide on power point",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "in case clients needs to have more than one table on a single slide",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Template folder in Composer UI",
    "author": "Christine Alcansado",
    "product": "Conga_Composer",
    "content": "Customer is looking for a way to create folders in Composer UI as they have more than 200 files, I have already advised the customer to use TemplateGroup but they don't want to edit their button from time to time and wanted to just sort the templates through folders.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Object limit increase",
    "author": "Andy Quach",
    "product": "Conga_Composer",
    "content": "conga solutions currently has a object limit of 1000 we should increase it to 3000",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Merge Field Output Numbering",
    "author": "Angelie Camasis",
    "product": "Conga_Composer",
    "content": "Customer would like to have an ability to make their data in the template more flexible by having the ability to do custom numbering of the data (Merge Fields).\n\n\nCustomer would like to know how to add line breaks in word template numberings that won't create a new numbering .\n\n\nA Sample of customer's scenario:\n\nSo I have a Word Template with numbering.\n\n\n\n\nExample:\n\n\n1. {{mergeField1}}\n\n\n2. {{mergeField2}}\n\n\n\n„mergefield1\" contains a text with line breaks.\n\n\n\n\nExample:\n\n\nThis is the first sentence.\n\nThis is the second sentence.\n\n\nThe expected outcome is:\n\n\n1. This is the first sentence.\n\nThis is the second sentence.\n\n\n2. Text from \"mergeField2\"\n\n\nCurrent outcome is:\n\n1. This is the first sentence.\n\n2. This is the second sentence.\n\n3. Text from \"mergeField2\"",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add 'Parameter Description' field on Conga Solution Page",
    "author": "Colton Lederer",
    "product": "Conga_Composer",
    "content": "https://www.screencast.com/t/U0Z4I5xRBPQe\n\nThis would be helpful for customers so they know what parameters mean on the Conga Solution page.\n\nCustomer: Abbott Diagnostics",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Pass a Dataset from Salesforce Flow into Composer",
    "author": "Ashley Hammer",
    "product": "Conga_Composer",
    "content": "Is there a way to pass a dataset from Salesforce Flow into Composer?\n\nIs there a way to pass data collected/queried/assembled in a Salesforce Flow into Composer? The user will run a flow that collects screen inputs, runs Get Records and Update Record inside the Salesforce Flow--then would like to output results into a Conga Composer report. Is this possible?\n\n\nIdea from Keith Smith @ Power Broker Software (Partner Main).",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Composer the DOCX limit to be increased from 40MB to 60MB",
    "author": "Kharl Cultura",
    "product": "Conga_Composer",
    "content": "Customer would like to request this feature for them to rollout their current solution which will require higher file capacity.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add a Parameter for PDFs to set editing restrictions",
    "author": "Bryan Johnson",
    "product": "Conga_Composer",
    "content": "When outputting a PDF they would a parameter to restrict the editing of the PDF.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Supported Parameters for the Composer Lightning Component",
    "author": "Angelie Camasis",
    "product": "Conga_Composer",
    "content": "Customer followed all steps to use Component using a solution to a collection, but getting stuck and can't make the solution work in Component but Solution works as a regular Composer button. Checked the article for Supported parameters and found that contentworkspaceid isn't on the list, and explain to customer that it is not part of supported parameter, and suggested AHA to request for it.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Export to csv",
    "author": "Colton Lederer",
    "product": "Conga_Composer",
    "content": "This client is attempting to get around the 15mb export limitation within Grid by outputting to a Composer document. Ideally, they would like to export to a .CSV not an Excel Workbook.\n\nClient: T-Mobile PPD",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "BATCH limit increase from 200 to 1 thousand record for consolidated output",
    "author": "Angelie Camasis",
    "product": "Conga_Composer",
    "content": "The reason the split record won't work is because our reports are very large and we will need to tell the users to create 20 reports instead of 1 just to run 1 merge. For example, if in 1 report we have 500 records based on last name alphabetically, we do not want to create 26 reports 1 for each letter of the alphabet or start trying 1 report for A-E, oops, that's too big I got an error, let me try A-D instead….. that's a terrible user experience. Please let me know if you need more details.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Activity usage report sent automatically to users on a monthly basis",
    "author": "Nathan Kirwood",
    "product": "Conga_Composer",
    "content": "Customer would like the Composer activity usage report sent automatically to them monthly\n\n\nrequested by British American Tobacco\n\nCase-00769281",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Update pop-up field (Attachment file Type)after generating document",
    "author": "Angelie Camasis",
    "product": "Conga_Composer",
    "content": "Wants to pass \"Attachment_Type_fileupload__c\" field value through Conga Solution but they are unable to do so.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Connect Conga Email Templates to Conga Sign Outgoing Messages",
    "author": "Tiffany Chiu",
    "product": "Conga_Composer",
    "content": "Integrate this so I can use a template to send out with my Conga Sign documents.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Get a return email receipt when the customer opens the email.",
    "author": "Christine Alcansado",
    "product": "Conga_Composer",
    "content": "The customer would like to know if there's a way for the outbound email to get a return email receipt when the customer opens the email. This is to monitor the email opens.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Stop allowing running users to be disabled without warning",
    "author": "Lisa Jackson",
    "product": "Conga_Composer",
    "content": "I have spent considerable time trying to solve an issue on a trigger / outbound message. It turns out that the running user is one of our admin team, whose license was removed when we had a shortage of licenses.\n\nCould there be a warning against such users? Alternatively, could the dashboard show this as an error?",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add the ability to save a draft on Conga Email Template Screen",
    "author": "Colton Lederer",
    "product": "Conga_Composer",
    "content": "As email drafts are an out of box feature for Email-to-Case users, it would be great if Conga had feature parity to what those users see when using standard Salesforce email templates.\n\n\nThis customer heavily uses CETs. A CET group and ID are determined based off of the Case Type, Product set, and other Case criteria. The email template list is ever evolving and emails may often be saved as draft as the email body awaits approval from the case reps manager.\n\n\nCustomer: Kimberly Clark\n\nEMEA-\n\nhttps://apttus2.lightning.force.com/lightning/r/Account/0013Z00001lmF9DQAU/view\n\nNA- Will soon add 70ish users for their UK region.\n\n*This is a show stopper for the NA Region. Ideally, this would be available for UAT testing in first half of Oct with a go-live by Nov. '21.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Redaction Templates",
    "author": "Christine Alcansado",
    "product": "Conga_Composer",
    "content": "Customer wanted to have an ability to Select and Redact the numeric portion only of the SR and WO Locations. (Currently, the entire Location in his Template must be selected).",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "HTML body field size increase",
    "author": "Christine Alcansado",
    "product": "Conga_Composer",
    "content": "Customer would like to increase the size of 'HTML Text' field in 'Conga Email Template' Object.\n\nCurrently, the size is about 32768 characters and they are asking to set the limit to 131,072 characters.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Adding merged field in hyperlink",
    "author": "Lawrence Dela Cruz",
    "product": "Conga_Composer",
    "content": "",
    "votes": "1 Vote",
    "comments": []
  }
]