[
  {
    "title": "'Contract Family Viewer' on Lightning App Builder",
    "author": "Jesse Hoffart",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Client would like the ability to add 'Contract Family Viewer' to a page from the Builder, as they are moving to Dynamic Forms and would like users to continue editing pages in a way that is familiar to them.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Clause page should have a breakdown by action (original vs modified vs deleted vs alternate)",
    "author": "Kirk Wessman",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Would be cool to have a SUMMARY Count at top. e.g. 10 Original     2 Modified   2 Delete, 3 Alternate (if we can track)  - would appear atop this page. can be optional layout widget (preferable) or part of overall design",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "'Contract Family Viewer' on Lightning App Builder",
    "author": "Jesse Hoffart",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Client would like the ability to add 'Contract Family Viewer' to a page from the Builder, as they are moving to Dynamic Forms and would like users to continue editing pages in a way that is familiar to them.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Clause page should have a breakdown by action (original vs modified vs deleted vs alternate)",
    "author": "Kirk Wessman",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Would be cool to have a SUMMARY Count at top. e.g. 10 Original     2 Modified   2 Delete, 3 Alternate (if we can track)  - would appear atop this page. can be optional layout widget (preferable) or part of overall design",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Delete Agreement Clauses when the associated Document Version record has been deleted",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When end users delete document version records, the associated Agreement Clause records are still showing on the Agreement. Since these agreement clauses were specific to a single document version, it would make sense for them to also be deleted from the Agreement record as well. This enhancement would help ensure that only relevant information is showing on the Agreement record and ensure accurate reporting.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Selected values should be retained in the fields in the wizard once the Wizard is saved",
    "author": "ECOM Help Desk",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "This idea is raised for the suggestion given by TS team on the case 898191.\n \nWhen we are saving the wizard with the field value changed to the non-default value, the changed values reset to the values defined in the input rules.\n \nWe wish to see the updated value in the preview stage of the wizard and not the default value upon saving the wizard, like how it works for submitting the wizard.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow for Date Options in Agreement Documents Lightning Web Component",
    "author": "Riley Humes",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "I am requesting that there be an option for additional fields on the Agreement Documents component - specifically, date options like Last Modified Date and Created Date. Right now it is very difficult to sort through options.",
    "votes": "6 Votes",
    "comments": []
  },
  {
    "title": "Allow Office 365 email template to override using admin entry",
    "author": "Namir Ashraf",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "At present, we can only use the provided three OOB templates for the O365 review: Internal, External, and Mixed review. We can edit the content of these templates, but we cannot override them as we can for Parallel review. However, we have a requirement to use the VF type of template for our business.\nKindly provide this feature to support our business.",
    "votes": "9 Votes",
    "comments": []
  },
  {
    "title": "Use E-Mudra as an E-signature option on Salesforce using conga composer",
    "author": "Prabhat Jha",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Right now, in our salesforce org we are using DocuSign as are e-signature, we are looking for alternate options. We came across E-Mudra, but it was not supported by the Conga Composer which we are using for Templates in Salesforce. Can you please look into it and add that product.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Is this for CLM or Contracts for Salesforce?"
      }
    ]
  },
  {
    "title": "Make Envelope creation process for Conga docuSign package truly async",
    "author": "Kshitij Lawate",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The VF page invoked for creating Docusign Envelope \"Apttus_QPDSign__QPDocuSignManageEnvelope\" currently creates a batch apex instance and waits for it to finish to allow user to advance to next page.\nThere is a sync option available as well, but its not idea if we have lot of backend automation executing when you initiate the Envelope.\nCan it run in a fire and forget mode.\nInstead of creating a batch job instance it should generate a queueable job.Once job is submitted, just navigate user back to quote pageMonitor the queueable job execution via different options like inline page on quote, lightning widget, another new page, etc.\nthe UI shouldn't wait for async job to be finished to allow user navigate back.Also, batch apex is not a good option since its just 1 envelope being sent, it should be queueable apex so it can be tracked as well.",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Conga CLM-Protect Document - Encrypt with Password not allowing to check-in the document in XAC 2.0",
    "author": "Akshay Bhujbal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team,\n \nThe customer has the use case to check-in the document that is encrypted with a Password using XAC 2.0 and it is throwing the error \"An error occurred while processing your request\".\n \nThe same feature is working in XAC 1.0.\n \nCould you please check and consider this use case?\n \nThanks!!",
    "votes": "8 Votes",
    "comments": []
  },
  {
    "title": "Conga CLM: Allow Admins to add/remove or reorder columns on the Send For Signatures page.",
    "author": "Harshit Solanki",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Product Team,\n \nHope you are doing well!\n \nCustomer: Gartner\n \nThe customer would like to customize the columns in the Send For Signatures UI.\n \nCurrently, with Conga CLM Smart Search configured, users can customize these columns individually, but other users cannot see these changes. The customer needs a solution that allows Admins to make column changes that will be visible to all users.\n \n\n \nPlease provide a way to configure the columns from the Admin end so that Admins can make changes that will be visible to all users. This will help users configure the columns according to their use-case.\n \nRegards,\nHarshit Solanki",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Allow adding field of child object without section or table  feature in the future releases for XAC 2.0",
    "author": "Divya Dubey",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nCustomer (Aetna Life Insurance Company) has requested to allow adding field of child object without section or table feature in the future releases for XAC 2.0.\nCurrently, following is the limitation with XAC 2.0 but its working in XAC 1.0.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Filtering Send for Review email contacts only",
    "author": "Simran Singh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When selecting contacts in the review email recipients, we want to only show emails from certain email addresses. For example, irvinecompany.com\nIn the Agreement, after clicking ‘Send for Review' in the Office Agreement Actions object, user is taken to a screen where they select a doc(s) to send for review. User types in ‘Mike San’ for example, and the system guesses/populates multiple Contact/User records. Also, if this could be a configuration that we could change, would be better.\nWe want to only show emails that contain certain domain names, like @irvinecompany.com",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Store, track and report on which templates were used to create agreement documents",
    "author": "Ryan Walls",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer Bloom Energy would like it if we had some out of the box way to store, track and report on which templates were used to create agreement documents after they've been generated",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Excluding the \"Send for Review\" feature from the following admin entry (APTS_IncludePrimaryContact)",
    "author": "Divya Dubey",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Creating the Admin Entry \"APTS_IncludePrimaryContact\" its Auto populating the Primary contact from agreement to \"Send for signature\" and \"Send for Review\". \nThere is a business requirement for one of our users (Moody's Corporation) if, there a way we cannot populate the Primary contact only for Send for review however it will auto populate on Send for signature.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Reject Changes in Parallel review process",
    "author": "Mary Robles",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Once the reviewer received the reviewed document, it will check in the reviewed document and end the review cycle. Our participants from CLM certification course suggested to have the option to reject changes prior to check-in the reviewed document. Currently, our process with the parallel review is that once the reviewer received the document, it will notify that the document is under the review process, changes are allowed only after the review cycle is completed. And to end the review cycle, must first check-in the document.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Automatic error reporting",
    "author": "Jesse Hoffart",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Client expressed concern that, if an error does not occur on the UI, they do not know what might have caused a particular behavior and are wanting to create reports that would provide a rolling list of errors that have occurred in the org. An example would be when an agreement has been sent for review and the status of the agreement does not change. There is no obvious error to be found and for the client it's not efficient to submit a case when these issues occur in Production. They state they have this ability when using other products and don't know why this info isn't always available when using CLM.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "CLM : AsyncCloneAmendRenew Admin Entry is not working with Agreement Documents",
    "author": "Snehal Hissal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Issue: CLM: AsyncCloneAmendRenew Admin Entry is not working with Agreement Documents\n \nDescription: This issue has been reported by the \"Siemens Healthineers AG\" customer. They identified this problem during their testing\nAsyncCloneAmendRenew admin entry is introduced to handle the cloning, amendment, or renewal of an agreement in the background.\nThis allows the user to continue working on other agreements without interruption. Once the process is complete, the user will receive an email notification.\n \nWhen we try to clone an Activated Agreement record, even with the above admin entry set to true, the process does not occur in async mode. Instead, the cloning and document copying occur in sync mode\n========================================\nCustomer Use-case:\n1. Set the AsyncCloneAmendRenew admin entry to True\n2. Clone/Amend/Renew the agreement record\n \nAs per product team this was never implemented for Agreement Documents and only available for Document versions. But customer wants this feature to be available for future as per their use case.\n \nRef JIRA : https://conga.atlassian.net/browse/CONTRACTS-21355\nDoc JIra :https://conga.atlassian.net/browse/DOCS-1354\n \nThanks!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga CLM: Increase the field limit for \"APTS_AgreementHierarchyFields\" this Admin Entry.",
    "author": "Harshit Solanki",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Product team,\n \nCustomer: Gartner\n \nCustomer is asking us to increase the field limit that we have in place for this Admin Entry <APTS_AgreementHierarchyFields> \"https://documentation.conga.com/clm/february-24/salesforce/admin-entries-238715057.html#id-.AdminEntriesvFebruary24-APTS_AgreementHierarchyFields\"\n \nHere customer is having a use-case where they would like to show more than 4 custom fields on the Agreement Hierarchy page but due to the limitation they are not able to do so.\n \nCan we please take this up as an enhancement?\n \nRegards,\nHarshit Solanki",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga CLM: Provide a way to manually create Amend/Renew relationship between 2 Agreements having different Agreement number.",
    "author": "Harshit Solanki",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Product Team,\n \nCustomer: Gartner\n \nGartner has a use case where they want to relate two different Agreements, each with a different Agreement number, in an Amend/Renew relationship. Their primary goal is to display these Agreements under the Amendment and Renewals section within the Agreement Hierarchy.\n \nBased on my analysis, we currently show Agreements in the Amendments and Renewals list only if their Agreement number matches the Parent Agreement's number, even if the version numbers differ.\n \nHowever, the customer wants to maintain different Agreement numbers for both Agreements while still establishing the relationship and displaying them under the Amendment and Renewals section in the Agreement Hierarchy.\n \nCould you please assist us in achieving this use case?\n \nRegards,\nHarshit Solanki",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Copilot Assistant in Conga",
    "author": "Grant Glazer",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Allowing Copilot to act as an assistant to tell me how to take an action, or even take the action for the user. Like a novice user asks: How do I amend this agreement? Copilot should be able to give instructions, point to /reference documentation, and even be able to eventually interact with the application, actually creating the amendment record and document for the user and presenting them with the options of reviewing, or sending the amendment",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Train Smart Search to recognize other record type names and abbreviations for natural language search",
    "author": "Michael Overman TS",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently a customer has a number of Agreement record types that Smart Search may not recognize. Per conversation with product, would need to train smart Search to learn new record types and short names so natural language searches can bring back more results.\n \nExamples:\n* MSA / Master Subscription Agreement\n* MSA Amend\n* NDA / Non Disclosure Agreement\n* Order Form\n* Other\n* Partner\n* Services / Services Agreement\n* Privacy\n* Software License",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Cancel DocuSign In progress Envelop when Agreement is cancelled",
    "author": "Namir Ashraf",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nCan we cancel DocuSign In progress envelop when agreement is cancelled, at the moment it is not possible.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Request to make choice by default toggle on and select minor version",
    "author": "Abhishek Jain",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nWhen we do import offline document, we need to on toggle manually and select minor version manually, is there any setting or enhancement we can make to make it default choice. Please make it as a priority.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Validation rule option is not available in wizard rules.",
    "author": "Simran Singh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently we don't have option to add Validation Rule in Wizard.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Currently for any field \"Is null\" condition option is not available in wizard rules.",
    "author": "Simran Singh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, we can't add 'is null' condition to any field as we have to select any value in Wizard Rules.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Setting multiple default value for different conditions in wizard rules.",
    "author": "Simran Singh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, we can add only single default value, however we don't have option to add multiple default value with different conditions in Wizard Rules.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "XAC 2.0 Mark field date format error on third party documents",
    "author": "Snehal Hissal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Background :\nCustomer is looking for the mark field in third party documents which are getting uploaded to system using import offline functionality. And they are not generated through existing templates in the system.\n \nThey are trying to use 'mark field' on such documents using XAC 2.0 but it is giving error as 'Please select a content that is compatible with the chosen field. The selected value May 9, 2024 is not compatible with the field data type DATE (MM/DD/YYYY)'\n \nIn the Documents which the Customer is Importing, if the date values are in \"MMMM d, yyyy\" format, eg: \"March 4, 2024\". And when we try to mark this value against any date field(Agreement Start Date or Agreement End Date, etc) we are getting the following error message: Please select a content that is compatible with the chosen field. The selected value March 4, 2024 is not compatible with the field data type DATE (MM/DD/YYYY)\n \n--> And if we change the Date value from \"March 4, 2024\" --> \"03/04/2024\"(MM/DD/YYYY) then it works\n \nCustomer's concerns:\nif they update the date format to match the supported format i.e. (MM/DD/YYYY) , then when an agreement is viewed globally and date is displayed in agreements as \"03/04/2024\", it is very confusing. People from US will assume end date is March 4th (mm/dd/yyyy) but people from India will assume it is April 3rd (dd/mm/yyyy). The date format changes globally. That's why we want the format as \"March 4, 2024\" to avoid confusion\n \n--> We can only mark a date value against a date field using XAC2.0 only if the date value which is in (MM/DD/YYYY) format. Any other format apart from this is throws error\n \n--> Why this limitation?\n \n--> Customer's request: Date can be stored internally in the format \"mm/dd/yyyy\" but we are requesting for display format as \"Month dd, yyyy\" when user marks date field as smart field in third party agreement document\n \nReferenced JIRA : https://conga.atlassian.net/browse/COREAPPS-11178\nTS Case : 00887530 \n \nAs this is currently product limitation, customers are looking forward to consider this as enhancement.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Large Document generating with more then 1000 line item",
    "author": "Mohammed Girniwala",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "There are scenarios where customers generate a large document and we have to generate an asynchronous mode.\nCurrently, this functionality is working with Generate -> Then Submit button.\nBut we customer tried to generate the large document with the Regenerate -> Submit button, and it does not work.\n \nSo we need this functionality to work with the Regenerate button as well.",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Mohammed Girniwala",
        "content": "Here is the JIRA for the reference:- CONTRACTS-18997"
      }
    ]
  },
  {
    "title": "End One O365 Review cycle at a time",
    "author": "David Vernall",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "If a reviewer is included in multiple O365 Review cycles, and they end one of the reviews by replying to their initial email (Version 14.723 (October '23) (conga.com)), then this will close out ALL the review cycles that they are involved in.\n \nCan we split these up, so that it will only close out the 1 cycle that they are replying to?",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Imported offline document should be on top of the list on \"Send For eSignature\" page",
    "author": "Hardik Macwan",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We have noticed a behavior wherein if we download a previously generated document and upload it using \"Import offline document\", the files list on \"Apttus_CMDSign__CMDocuSignCreateEnvelope\" component shows the originally generated document on top of the list, however, ideally it should show the latest uploaded document on top of the list.\n \nFor example, we generated a document named \"MSA_Original_Abhishek Test Template_2024-05-10.docx\" using Generate button, download it locally onto our system and change its name to \"HMMSA_Original_Abhishek Test Template_2024-05-10.docx\". We go back to the agreement record and upload the document \"HMMSA_Original_Abhishek Test Template_2024-05-10.docx\" using Import offline document. Once the upload is successful, if we click on \"Send for eSignature\" button and move to \"Apttus_CMDSign__CMDocuSignCreateEnvelope\" page, the original document \"MSA_Original_Abhishek Test Template_2024-05-10.docx\" can be seen on the top and not \"HMMSA_Original_Abhishek Test Template_2024-05-10.docx\".\n \nWe understand that this is because of the \"SystemModstamp\" being updated and is by design but it is a bit confusing for end users and should be looked into.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "CLM -  Error handling notifications",
    "author": "Florence Eden",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "This Feature Request is submitted on behalf of Allianz Partners.\nThis may apply to different part of the CLM product suite but is critical for a strong user adoption as it would help educate the users as they use the system.\n \nUsers would like to get an error handling notification when a process is failing.\nHere are a few examples:\nWhen the users start a \"send for review process\", they do not know that the process fails.\n\tThey do not get notifications such as \"wrong file type is being used\" or \"file size too big\" for process to complete.Therefore the user does not know that the process has not been initiated.\nImporting a document into CLM\n\tWhen a user uploads a third party contract in the system, the document has a .doc extension. Because the user is not notified that the doc needs to be a .docx extension, they send the document for review but then, it triggers the sequential review and not the parallel review.Because the user does not know they uploaded the wrong document type, they don't understand why the system is going through the \"sequential\" review process over the parallel review process.\n\nThank you for considering this enhancement.\nFlorence",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Request to manage page numbers through a custom header/footer while merging the documents in CLM",
    "author": "Rohit Bavaliya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Product Team,\n \nWe would like to request an enhancement to the current Merge Document CLM feature. Our customer has requested the addition of Page Numbers via custom header/footer during the document merge process in an Agreement record.\n \nWe kindly ask that this idea be reviewed and considered for inclusion in a future CLM product release. The ability to manage page numbers through a custom header/footer will offer greater flexibility to our customers who require page numbers to be automatically associated with merged documents.\n \nRegards,\nConga Technical Support",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "XAC 2.0 - Rich Text Area merge field in Template - change default setting from IMAGE to HTML",
    "author": "Robert Teng",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "A Conga CLM customer who attended my CLM XAC 2.0 Template Admin training on May 8 asked whether it is possible to change the default setting for a Rich Text Area merge field in an X-Author template from IMAGE to HTML. They have about 80 templates with dozens of Rich Text Area fields in each, so it is not practical for them to open each field and manually change the setting from IMAGE to HTML. Please see attached screenshot.\n \nOn behalf of the customer, the feature request is to make configurable the default value of the Rich Text Area merge fields in an X-Author template, much like how other parts of X-Author are configurable in Comply System Properties, e.g. Auto Enable Reconciliation, etc.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "import Offline Document - Merge Functionality",
    "author": "Alison Aubuchon",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When importing an offline document when you select to create a major/minor version to an existing document allow for that document to be merged and any differences be shown as redlines. You can do this in X-Author but it would be easier to do in CLM when importing offline. Right now it creates a new version but you have to run a compare to figure out the differences.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "X-Author for Contracts: Please enable the support for developer tab in X-Author for Contracts",
    "author": "Harshit Solanki",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Product Tm,\n \nCustomer: BSC\n \nPlease enable the support for Developer tab in X-Author for Contracts add - in.\n \nRegards,\nHarshit Solanki",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add a default document for the Conga Sign Agreement Action on CLM",
    "author": "Dan John",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer needs to be able to add a default document on their \"Sign With CongaSign\" Action button based on their generated document from a Lightning Agreement Action. The document would need to be directly added onto the CongaSign UI, without using composer. As well as, they would also need to show the related documents from either parent or child agreement, like the behavior of \"SendForSignature\" Action button,",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this idea, Dan! We will be taking it on for future consideration."
      }
    ]
  },
  {
    "title": "Need ability to make fields read-only for X-Author",
    "author": "Michael Overman TS",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, if a user has Edit access to a field in Salesforce either via profile or permission set, then that field will be available to be marked via X-Author. The only current way to restricting field marking is by making fields read-only on the Salesforce side. Users need edit access to fields like Status Category, Status, Approval Status because of basic CLM workflow, but these fields should not be markable inside X-Author.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Duration hours field in Cycle time report should be modified",
    "author": "Snehal Hissal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team\n \nWe have a customer's request to shorten the Duration( hours) decimals from 4 to 2 in the Cycle time group data. \n \nCustomer name : GSK US\n \nPlease check the snapshot below for your reference. \n \nThanks!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Rich Text area fields should allow to generate tables in salesforce",
    "author": "Divya Dubey",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "There is a request to provide a feature that allow to generate the tables in RTF field or and that should be updatable whenever anything changes in tables in Salesforce. It should always generate on field if any changes are made to the configuration.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Marking Rich Text fields (RTF) fields are updatable/smart",
    "author": "Divya Dubey",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Marking Rich Text fields (RTF) fields are updatable, so that It could replace the new/modified data (when the RTF field's data/value is modified in the Salesforce) .\nCurrently, whenever there is a long text field/tables in Salesforce and if end user modified the values in the RTF field, it is not possible to capture the same modification in the checked out document (which already has some modifications in it).",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Make the date format same across all pages of Lightning Wizard during run time.",
    "author": "ECOM Help Desk",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "On Lightning Wizard: -\n \nThe date format appears as \"May 26, 2024\" on all the Steps.\nBut date format appears as \"2024-05-26\" on Preview Page.\n \nThis looks odd and should be fixed by using same date formats.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Office 365 reviews ends when user reply via email",
    "author": "Mohammed Girniwala",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The customer is saying that when they reply to the Office 365 review email it ends all the reviews for the user.\n \nHere is the documentation for the reference:-\nhttps://documentation.conga.com/clm/latest/salesforce/sending-an-agreement-document-for-collaborative-review-using-microsoft-365-review-239539980.html#id-.SendinganAgreementDocumentforCollaborativeReviewUsingMicrosoft365ReviewvFebruary24-Toendthereviewforareviewer\n \n\"When you end a review cycle via email and your reviews in other review cycles are in progress, all your reviews in other review cycles also end.\"\n \nThe customer has requested a specific functionality regarding Office 365 reviews: when they respond to a particular review, it should conclude that specific review only, without affecting any other ongoing reviews.",
    "votes": "14 Votes",
    "comments": [
      {
        "commenter": "Arun James",
        "content": "We are encountering the same issue. I am uncertain as to why Conga developed a feature that closes all active reviews. This seems to be an incorrect method of completing reviews.It would have been acceptable if, in the case of finding multiple active reviews for the same reviewers (based on email addresses), the system didn’t end any reviews. Instead, it could notify the review cycle owner to manually end the review.Alternatively, the system could prevent someone from adding an email address to another review cycle if that email address is already part of another review.This error scenario is quite common for companies that have implemented parallel reviews. Technically, there are ways to identify the email thread using certain keys (attributes) associated with email IDs."
      },
      {
        "commenter": "Mohammed Girniwala",
        "content": "If a reviewer has 10 records to review and they approve/end one of the records by responding to the review request email, all 10 records are marked as completed when the reviewer completed the review, even if only one record was reviewed.﻿The customer has requested this functionality for O365 review that: when a reviewer responds to a specific review request email, it should conclude only that particular review, without impacting any other ongoing reviews for the same reviewer"
      }
    ]
  },
  {
    "title": "Allow Section View, not only clause view, on Record level",
    "author": "Anika Pinnell",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Current Challenge: When utilizing templates that contain multiple sections and clauses, our current system highlights only the individual modified clauses during the review process. This isolated view does not provide a comprehensive understanding of the changes within the context of the entire section.\n \nProposed Solution: We suggest the implementation of a feature that allows for the highlighting of the entire section in which any clause has been modified. This would enable a holistic overview, preserving the logic and coherence of the entire chapter, rather than limiting the focus to a single sentence or clause.\nBenefits:\nEnhanced Contextual Understanding: Experts can evaluate the full impact of changes within the context of the entire section, ensuring that the logic and flow of the document remain intact.Improved Review Efficiency: A section overview, adjacent to the clause overview, would streamline the review process, allowing for quicker identification of changes and their implications.Increased Flexibility: Our use case involves plain text fields between marked clauses that are editable by users without highlighting changes. The proposed feature would accommodate this unique requirement, preventing the loss of crucial information during the review.\nWe have encountered challenges where the lack of section highlighting leads to an incomplete picture for our experts, hindering their ability to assess the full extent of modifications and their ramifications on the chapter as a whole.\n \nWe believe that the addition of this feature would be a valuable asset not only to our organization but also to other users of your platform who may face similar challenges.",
    "votes": "25 Votes",
    "comments": [
      {
        "commenter": "Dott Buchanan",
        "content": "Anika, Thanks for raising this idea!"
      }
    ]
  },
  {
    "title": "'Merge Documents' action to have more flexibility",
    "author": "David Vernall",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When using the 'Merge Documents' agreement Action in Conga CLM, customer wants the ability to select/deselect individual pages within the document.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Process large number of BillingSchedule records asynchronously (in special scenarios)",
    "author": "Juraj Moza",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello\nWe have non-standard cases where we have 10+ years, monthly Agreements with Bundles with 50+ Options\nIn such cases we are inserting very big volume of Billing Schedules ~ 7k which results in Heap Size\nOn top of that we can have case where it can generate more than 10k BSs and if we are processing them as of now Sync - we'll hit a Salesforce DML Limit\nWhat we suggest and we want to have hopefully:\n1. One flag/field on the Agreement or we can reuse the \"QTC Profile\" and add a new picklist value - for example Non Standard\nWe expect that when this value is set (we can do it on our own, thru our custom logic)\n1.1. All processes will act as Enterprise case - ASync Activation of Agreements/Orders/Assets\n1.2. We load the BSs in ASync mode - Batch, as we discussed if size 1 is the easiest - it's fine\n2. For the same flag/field we hope we can have a one more option on:\nOrder System Properties => System Properties => Order Item Activate Batch Size\nWhy we need that\nMost of the Agreements (maybe 95%) are with very simple Bundles (few Options) where we can use bigger size for example 10 or 20,\nbut currently we are forced to use 1 - because of the scenarios as the one described above\nAs you expect this since one is making activation of the Agreements quite slower than before but we don't have a choice as we can't dynamically change it per Agreement.\nThis we think is way less complex than the one above as it will just read the setting and apply the Batch Size for the OrderActivateJob\nSo what we expect is 1 new Option:\nOrder System Properties => System Properties => Order Item Activate Batch Size (Existing for Enterprise flag) which we can bump to 10\nOrder System Properties => System Properties => Order Item Activate Batch Size (New one for Non Standard flag) that we will put to 1 as it is now for all our cases",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "At least one document (Preferably PDF) should be selected for activation and publishing",
    "author": "Dhaval Prajapati",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "At least one document (Preferably PDF) should be selected for activation and publishing. Currently, it is not achievable even if we use existing related admin entries (Given below):\n \nAPTS_ActivateDocumentsSelectAll\nAPTS_ActivateDocumentsPublishAll\nAPTS_ActivateDocumentsSelectable",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "As least one document (Preferably PDF) should be selected for activation and publishing.",
    "author": "Dhaval Prajapati",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As least one document (Preferably PDF) should be selected for activation and publishing. Currently, it is not achievable even if we use existing related admin entries (Given below):\n \nAPTS_ActivateDocumentsSelectAll\nAPTS_ActivateDocumentsPublishAll\nAPTS_ActivateDocumentsSelectable",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Ability to submit a automatic push upgrade with custom admin profiles",
    "author": "Ajit Rajendran",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team,\n \nWe are not able to register for the automatic Conga push upgrade because we cloned the Salesforce System Admin profile and created a custom admin profile. We are getting an error (attached screenshot) when we are trying to register for the push upgrade because of the custom profile.\n \nIt will be great if you allow custom profiles or list the permissions required in order to register for an Automatic push upgrade.\n \nThanks\nAjit",
    "votes": "7 Votes",
    "comments": []
  },
  {
    "title": "Ariba integration connector for CLM",
    "author": "Marija Mockute",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In order to expand Conga CLM capabilities a customer is asking to build a connector with Ariba. They are very interested in Conga's plans for supporting integrations beyond just providing an open API, and ask if we are willing to build a connector for Ariba.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Option to Filter Results of user when sending for signatures.",
    "author": "Deep Joshi",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nWe are currently using SFDC's OTB email page for selecting Email's CC, BCC, and Additional To while using send for signatures functionality.\n \nCan we have a filter to filter the contacts directly or by using alphabetical ordering?\n \nWe had a word with salesforce and they asked us to implement a custom VF component for this use-case.\n \nThanks",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Contract Intelligence - For Conga CLM we will need the ability to map fields extracted from a contract to Agreement as well as Agreement child objects.",
    "author": "Rajiv Kalagara",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Use Case: We are implementing CLM & CCI within DaVita for a different business group called “Payor Partnerships”, DaVita already has 20 record types implemented for their Legal team in their Instance and maxed out on the usage of Agreement Fields (800 fields). However, the new group has a requirement of more than 400 fields to be created, so we had to create a child object to the Agreement called “Payor Partnerships Agreement” as a Master-Detail relation to the Agreement object. Customer has chosen 40 provisions to be extracted, out of the 40 provisions 6 are mapped to the Agreement and 34 are mapped to the agreement child object.\n \nLimitation: CCI can save the extracted data only to one level i.e., Agreement, and cannot save the data to both Agreement and its child object. But the extraction setup has the option to create a new record on the child and allows user to map up to a max of 4 fields as shown in the screenshot below.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga CLM: Progress bar when continue button is clicked on \"apttus__AgreementReturnToRequestor\" page.",
    "author": "Harshit Solanki",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Product team,\n \nCustomer: Novartis\n \nThey have highlighted that their users are repeatedly clicking on the \"Continue\" button located on the \"apttus__AgreementReturnToRequestor\" page, resulting in operational difficulties.\n \nTo address this, I kindly request implementing a progress bar or a similar feature that restricts users from clicking the \"Continue\" button multiple times on the \"apttus__AgreementReturnToRequestor\" page.\n \nThis enhancement will not only benefit Novartis but also other customers utilizing this functionality. It will provide users with a visual cue that they have clicked the button and prompt them to wait for a few seconds (e.g., 5 or 6 seconds) before proceeding further.\n \nFor your reference, I have attached a screenshot below showcasing the current interface.\n \n\n \nYour assistance in implementing this improvement would be greatly appreciated.\n \nBest regards,\nHarshit Solanki",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Allow CLM Package Owners to set if External Reviewers can Accept/Reject Changes in O365 Reviews",
    "author": "Lydia Steinkoetter",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "My organization would like a feature that allows CongaCLM package owners the ability to set if they want to allow External Reviewers to accept/reject changes in Office365 documents. This is most helpful when handling third party paper. Currently, the other party cannot accept/reject changes on their own paper.\n \nPer this documentation on Salesforce Contracts, it appears it's possible. https://help.salesforce.com/s/articleView?id=ind.sf_contracts_In_External_Review.htm&type=5",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Let create the agreement wizard finalization note in the \"Notes\" section.",
    "author": "Pedro Terriere",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi team,\nWe would like to get completely rid of the \"Notes and Attachments\" section (because we use (as recommended for LIGHTNING) the \"Files\" and \"Notes\" sections now).\nWhen we use the agreement wizard, and click \"submit\", then the wizard creates a Note in the \"Notes and Attachments\" section: e.g.: This record was created from Wizard xyz, Runtime a1F3I00000xyzxyz.\nWe would like that this note in the future lands in the (enhanced) “Notes” section.\nIn the attached document I illustrated to topic in more detail.\nI am looking forward to many votes in favor !",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enhanced Customer Learning Pass",
    "author": "Fabien Sparfel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi,\nIt would be great to enable our customer to upload their own content into the Conga Learning Pass. For exemple, our customer Michelin has developed videos and \"How to use\" pdf guides for their end users. Those contents are showing how to use Conga on their very customized Salesforce platform. Then, they can't use generic content for enablement, but would like to upload those contents (videos and pdfs) onto our Conga Learning Pass platform.\nIs there a quick win we could add to our roadmap?\nMany thanks,\nBest regards,\nFabien",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Implement the logic to filter with template unique name in case both (name & Unique name is different) with our engineering team to consider this as a future enhancement.",
    "author": "Divya Dubey",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As of now per our OOTB logic when user selected the email template while using the OOTB send for signature button the system queries the template on the basis of name or unique name. There is a requirement to implement the logic to filter with template unique name in case both (name & Unique name is different) with our engineering team to consider this as a future enhancement.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "O365 Review Cycle Audit trail",
    "author": "David Vernall",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team,\n \nOn the Office 365 review cycle screen – can we have more details as to where each user is at? Maybe something similar to the ‘audit trail’ type of view used during the Conga Sign Signature Process? eg. customer 1 has opened and viewed the file, customer 2 has made a 2 changes to the document, etc etc... \n \nThanks,",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "'Wrap text' by default option",
    "author": "David Vernall",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team, \n \nCan we add a setting that allows us to 'Wrap text' by default on the ‘Send for Office 365 review’ screen? rather than having to select this every time we go onto this screen as it currently is configured.\n \nThanks,",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "The status of the Cancelled Child Agreements (Amend/Renew) is changing to Expired once the parent is expired.",
    "author": "Xavier George Manayil Joseph",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The status of the Cancelled Child Agreements (Amend/Renew) is changing to Expired once the parent is expired.\nIdeally, the status of any cancelled agreement should not change, as it is an end status.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Lite User : Restrict Import offline document upload",
    "author": "Snehal Hissal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "One of our customer GSK has encountered the issue with Lite user functionality, and we have found this to be product limitation. The scheduled jobs are running successfully. However, the lite user conga is getting limit exceeded error, while import offline document as expected since the login limit has been more than 30 times.\n \nBut the document is getting uploaded in the background which is not correct.\n \nCustomer wants to know why is the document is getting uploaded, even if the error shows on front end. \nThey want to restrict this particular flow, which found to be out of the box and product limitation. \n \nCustomer wants us to fix this and provide resolution, so that document will not get uploaded. \n \nBusiness Impact Details\n \nSteps to Reproduce\nGo to agreement/Contract\nLogin as any light user who has exceeded login limit 30\nimport offline doc\ncheck error shows as expected\nhowever the document is uploaded on record\n \nThanks!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Merge and Compare",
    "author": "Scott Poole",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The ability to leverage the Merge and Compare features without Metadata within the document. Multiple times, documents are returned from external legal counsel stripped of Metadata not allowing reconciliation of the document back to Conga CLM.\n \nOther use cases include completing a merge and compare of a document from one agreement record to another agreement record to leverage redlines for an agreement from the same template on another agreement record [Salesforce] integration.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Office 365 Internal Review is not keeping track of accepted/rejected changes and who accepted or rejected the change.",
    "author": "Divya Dubey",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When a documents sent for office 365 internal review , all the reviewer can simultaneously modify the documents and those changes will be redlined and automatically saved.\nHowever, they can parallelly accept and reject each others changes and those acceptance and rejection is not being tracked (who accepted/rejected and what was that change which got rejected) which is impacting customers business users.\n \nKindly review if this could me made possible with office 365 review.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "The parallel review recipient list needs a filter.",
    "author": "Arun James",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Since many companies, such as ours, have users also represented as contacts, the list always shows two emails for most cases - from the user and contact object level.\n \nWe need to provide an admin setting to filter out the users from the list.\n \nAdditionally, it would be good to put a record type filter option on contacts to not show any client contacts.\n \nWe have noticed users accidentally selecting a client contact from the list for review (instead of internal contacts/user).\n \nCase ref: 00878417",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Select an email template when sending documents using the \"In Effect View\"",
    "author": "Piotr Klimiuk",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The current functionality to send documents via email from the “In Effect View” button does not allow users to select an email template (like when sending for review).\nIt would also be nice to be able to default the recipients based on the agreement data.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to make fields from related lists smart",
    "author": "Piotr Klimiuk",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "It would be great if Conga could pick up the changes made to the document and update the related Agreement records for reporting like a smart field does on the agreement. It would have to be sophisticated enough to report back to the correct related record.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Request to support 'SharePoint and OneDrive integration with Microsoft Entra B2B' feature with Conga O365 external review.",
    "author": "Rohit Bavaliya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Dear Product Team,\n \nWe have come across a scenario where Office365 external review functionality is not working when the \"SharePoint and OneDrive integration with Microsoft Entra B2B\" feature is enable in the customer's Microsoft tenant. Microsoft has informed us that the Graph API for sharing is not compatible with this integration and currently only \"SharePoint external authentication\" is supported. However, the Microsoft team mentioned that this use case can be achieved if we create an invitation for external user and then generate a sharing link for external users.\n \nPlease find below documentation for more details:\nOverview of external sharing in SharePoint and OneDrive in Microsoft 365 - SharePoint in Microsoft 365 | Microsoft Learn\nCreate invitation - Microsoft Graph v1.0 | Microsoft Learn\n \nOur customer, \"Manufacture Française des Pneumatiques Michelin,\" has requested an enhancement to the current Office365 external review feature. They would like Office365 external review to also support scenarios where the SharePoint and OneDrive integration with Microsoft Entra B2B feature is enabled in their tenant. Could you kindly review this request and consider it for future CLM release?\n \nThank you for your attention to this request.\n \nBest regards,\nRohit Bavaliya",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Conga should automatically call the SUBMIT button if the generate fails using generate button.",
    "author": "Manasvi V",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Conga should automatically call the SUBMIT button if the generate fails using generate button. When user is getting Apex time-out error/Heap size error while generating the document using the OOB Generate button, we need a single button (instead of 2 buttons: Generate and Submit) so that the server will be changed automatically from synchronous to asynchronous.\n \nHere we are looking to improve the user experience and also do not want to add additional clicks/steps for the users.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enable AgreementClauses VF page for lightning experience",
    "author": "Piotr Klimiuk",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently Apttus__AgreementClauses visualforce page is only available to add on page layout.\n \nWe would like to have possibility to add this component directly on the record page because to be able to use dynamic fields instead of standard page layout. Unfortunately this VF component is only available to add on the page layout.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Agreement Name for amendments: do not have \"Amended\" repeated",
    "author": "Piotr Klimiuk",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We would like to request the enhancement related to agreement amendments.\nIf agreement e.g. “Test Agreement” is amended twice, the name should not be “Test Agreement Amended Amended”. It could be instead, “Test Agreement Amendment 2”.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga CLM - Mass Export of Agreements with associated PDFs",
    "author": "Christine Eggert",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Use case\nOur external auditors had requested a zip file of a mass export of all PDFs associated to all agreement records in specific record types with the Status field = Activated, along with a corresponding Excel file of key field metadata in order to cross reference/match up. These auditors will not have access to SFDC/Conga CLM/X-Author. We currently cannot perform this in Conga CLM. X-Author for Excel is not designed out of the box for this scenario either. We would like to see this as standard feature capability. In your design, please consider a large volume to be handled; i.e. 6,000+ agreement records with each record storing 25+ PDF in the Files related list section.\n \nIf this cannot be designed easily in existing functionality then what about a Conga app, similar to Smart Search, but dedicated to this particular use case that would be provided at no additional charge to the customer?\n \nWe think other companies would see benefit in the capability.",
    "votes": "6 Votes",
    "comments": []
  },
  {
    "title": "Language Translation Support for Custom Obects",
    "author": "Colton Lederer",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "A customer is asking how they can translate all of their conga objects to French. My original thought is that they need to manually translate the objects themselves through salesforce's language translation workbench. This seems like a giant waste of time as we have customers in France and other countries that have already translated these objects. I would assume that Conga has a cheat sheet somewhere that can be uploaded to Salesforce Translation Workbench. \n \nThis group is frustrated that we don't have anything out of the box.. Which I was surprised at as well. \n \nCustomer = Cummins",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Josh Sangster",
        "content": "Sorry, we do not have a \"cheat sheet\" as many customers choose various differentiations."
      },
      {
        "commenter": "Colton Lederer",
        "content": "*I'm not sure if we have customers in France, but none the less I'd assume we'd have a cheat sheet around language Translation."
      }
    ]
  },
  {
    "title": "Updating a Merge field should not mark as \"Non Standard Clause\"",
    "author": "Pradeep V",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When there is a Recursive Merge field in a Clause and if those merge fields are changed during the Redlining True-Up, This is marking the field \"Is Standard\" to FALSE. We have a situation where the change in merge field values should not be considered as \"Non Standard Clause\"",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Karan Nayee",
        "content": "This feature does not relate to approvals."
      }
    ]
  },
  {
    "title": "CLM sends duplicate emails when a reviewer concludes an Office365 review.",
    "author": "Rohit Bavaliya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Product Team,\n \nUpon ending the Office365 review, reviewers are receiving duplicate emails expressing for completing the review. Both emails are identical; The first email is sent upon the conclusion of the review for the reviewer, while the second is sent upon the completion of the entire review cycle.\n \nThis situation is certainly confusing the customers. The initial email is anticipated as it notifies the customer that their review has concluded, and they no longer have access to the review document. However, the second email should utilize a distinct template, explicitly stating that the review cycle has been completed.\n \nWe kindly request the product team to enhance the Office365 end review process by implementing a separate email template for ending the review cycle.\n \nRegards,\nRohit Bavaliya\nConga Technical Support",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Rohit Bavaliya",
        "content": "Thank you Josh"
      },
      {
        "commenter": "Josh Sangster",
        "content": "Hi rohit, this is very reasonable, I am asking the team to review and prioritize this in our backlog."
      },
      {
        "commenter": "Rohit Bavaliya",
        "content": "This problem seems to occur specifically with the Application permission flow.When the delegate permission flow is set, only a single email is sent to the reviewer upon concluding the internal/mix Office365 review."
      }
    ]
  },
  {
    "title": "API for \"Finalize in Docusign\" option during the signature process",
    "author": "Shivam Tiwari",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Product Engineering team confirmed that there is no API available for Finalize In DocuSign functionality as Finalize in DocuSign is a UI of DocuSign\n \nBooking.com Customer investigating whether we have an accessible API for the 'Finalize in DocuSign' feature and \"DocuSignBatchCreateEnvelope API to create Envelope within the e-signature process using DocuSign, which they can integrate into their custom implementation.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Create unique identifier for Conga application tasks",
    "author": "Bill Lesko",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We have a use case from a customer, where they need a method to identify tasks that are created in SFDC from Conga CLM. Specific use case:\n \nSummary: We need to know how to easily identify any Conga (docusign, template) Tasks that are created\n \nThe task records in our org always require a TASK__C value  when a completed task is added. We do this for various business reasons.\nWe want to be able to simply identify when conga generated tasks are created so that the validation rule can easily bypass the requirement for TASK__C to be valued when loading a Conga task record. We are not in favor of looking at the subject itself because if new task subjects are added by the Conga or DocuSign product at a later time, then the Validation rule will need to be updated – but first we would need to know that new tasks subjects are being used.\n \nWhat we would like to do is find a simple way to identify the Conga created tasks so that the validation rule can elect to not enforce the validation rule for Completed tasks\n \nthe request is to build into the product some way to identify the Conga created tasks. Possibly a flag or some common verbiage in the subject line, i.e. \"APPTS or Conga....\"\n \nThis applies to CLM, Templates, and any other Conga objects that have tasks created from them as part of the CLM (or CPQ) processes.\n \nThanks",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Hide files for selection during Send For Review if Document Versioning is turned on",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "A customer has end-users uploading files directly to agreements. This causes issues if they're selected during \"Send For Review\" as opposed to one of their imported offline documents (which go to Document Versioning). They would like to ensure files are hidden from this visualforce page to avoid confusion and errors.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Agreement Cycle Time Reporting Should Include Filters to Exclude Holidays",
    "author": "Kaitlin Smith Brendehl",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Within Conga CLM, we want to be able to accurately measure various cycle time metrics without including non-business time (weekends, holidays). While we are able to manage some of these settings (like weekends and after hours) on the SFDC side today, we are unable to exclude holidays from our reporting without creating something completely custom. This Feature Request is asking for an OOTB capability for us to more accurately report on Agreement Cycle Times.\n \nFeature request filed on behalf of customer (Twilio).",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Request to have the admin settings to allow users to deselect documents",
    "author": "Rohit Bavaliya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Product Team,\n \nHope you are doing well!\n \nI’m reaching out to you regarding CLM feature 'Document Attachment Options for Activation Notification' which was introduced Oct'23 CLM release below.\nOctober '23 Release Notes (conga.com)\n \nAs per documentation, when user turn on the Notify others toggle to notify other stakeholders, the documents they selected during activation are attached to the activation notification email by default and user can unselect documents that they do not want to attach to the activation notification email.\n \nWe have Pinnacle customer WPP 2005 Ltd - UK has a request to have the \"Attach Document to Email\" checkbox disabled by default during the activation of an agreement. They prefer not to include documents in the activation email.\n \nCould you kindly explore the possibility of providing the admin settings to allow users to deselect documents? This feature would prove advantageous for customers who prefer not to send documents during activation.\n \nRegards,\nRohit Bavaliya",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Reuse uploaded documents using xAuthor for Contracts",
    "author": "Nelly Urdapilleta",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The request consists on Conga allowing to re-use a document that has already been uploaded in an agreement via xAuthor for Contracts by downloading it from Salesforce and uploading it again to a different one while maintaining all of the redlines.\n \nCurrently the workaround for this is copying the contents of the downloaded document and pasting them on a new file, but the original redlines are lost.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Need an Admin entry or a way to control the status values on the Send for Signature (OOB) action.",
    "author": "Harshit Solanki",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nCustomer: Sodexo SA\n \nThey want a way to control the status values while performing the Send for Signature (OOB) action.\n \nWhile using the Send of Signature action the status and status category values are getting changed to 'Other Party Review' and 'In Signature' respectively. They want to control the status values here as per their use-case.\n \nWe tried using APTS_UseWorkflow Admin but it is not working as it only stops the status changes done via out of box workflow.\n \nThere is no mention of aftersendforsignature action in the below documentation as well so we don't know how to achieve this.\n \nIAgreementLifecycleCallback2 and IDynamicSectionCallback2 (conga.com)\n \nPlease consider this request and provide us with a feature to control the status values.\n \nRegards,\nHarshit Solanki",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "SWIFT - Missing some text in template when the document in generated",
    "author": "Maurice Hout",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Description:\nWe see that some text from the template is missing in the generated document.\nIt is happening for PDF and Doc both.\n \nExpected Behavior:\nThe complete details from the template should be visible on the generated document with the \"Quotation Confidential\" being present in the header of the document.\n \nSee JIRA for reference : COREAPPS-4400\nSee Case for reference : 00815938\n \nThis issues is addressed and has been deferred for future consideration.\nThis is IDEA is created to get a more concrete follow up of feedback if this will be included in a future release or planned timeline",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "history of smart fields changes in agreement record",
    "author": "Mary Robles",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Posting on behalf of customers from Deloitte\nThey would like to submit a feature request of viewing the history of smart field changes in an agreement record. Thanks.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Conga CLM to support dynamic lightning pages throughout the agreement life cycle",
    "author": "Priya Allu",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Conga CLM should be able to support dynamic lightning pages during post activation actions - amend, renew. Customization should not be the solution to achieve it.\nCurrently. product allows to have dynamic pages during agreement creation only, amend and renew actions land the user on the static page layout instead of lightning page.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Lightning Email Templates for CLM",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Need lightning Email Templates for CLM as we use Email Signatures from Salesforce while sending Email in Parallel Review flow.\nSo if the Email Signatures are enabled in the Org, the Classic Email Templates are getting misaligned when the Salesforce Email Signatures are used.\nAs per Salesforce Support, the Email Signatures are supported in Lightning Email Templates and the Template alignment won't be affected.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to preview generated documents in word format",
    "author": "Swapnil Bhandarkar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently we are unable to preview generated documents if they are in word format (.doc), we only support the pdf format. Can we have the possibility to preview .doc files as well?\n \nhttps://documentation.conga.com/cpq/october-23/salesforce/using-proposal-document-generation-195698398.html#id-.UsingProposalDocumentGenerationvFebruary23-Previewinggenerateddocuments",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Increase the Limit for the Agreement Name field from Text(80) to Text(255)",
    "author": "Mohammed Girniwala",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hell Team,\n \nThe customer has a requirement to create an Agreement Name that combines the Client Name, Record Name, and Agreement Number. They are using Flows to update these three pieces of information in the Agreement Name. However, they have encountered a limit that prevents them from achieving their business use case.\n \nTo resolve this issue and meet their requirements, they need to increase the \"Agreement Name\" field limit from \"Text(80)\" to \"Text(255)\" to accommodate the complete name.\n \nPlease consider this request and let us know if it's possible to extend the field limit as per their needs.",
    "votes": "5 Votes",
    "comments": []
  },
  {
    "title": "Changing Adobe Agreement Name based on the Adobe Agreement template name",
    "author": "Manasvi V",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "For now, the adobe agreement name is the parent Apttus agreement name, but we need to have an option to change the Adobe agreement name based on the Adobe agreement template name. Customer is also looking for an option for Conga to incorporate this enhancement in the future releases.",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Ability to auto-populate the recipients when using the Apttus_SignCLM__SendForCongasign__c action button",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer would like the ability to auto-populate the recipients, when using the Apttus_SignCLM__SendForCongasign__c action button. Using the recipient parameters within the custom formula field (as shown below) does not seem to work.\n \nIF (OR(ISPICKVAL(Apttus__Status_Category__c,\"In Signatures\"), ISPICKVAL(Apttus__Status_Category__c,\"In Authoring\")),IF(OR($User.UIThemeDisplayed == 'Theme4d', $User.UIThemeDisplayed == 'Theme4t', $User.UIThemeDisplayed == 'Theme4u'), HYPERLINK(\"/apex/Apttus_SignCLM__SendForCongaSign?id=\"&Id+\"&recipient1=\"+APTS_Primary_Contact__c+\" &recipient2=\"+APTS_Internal_Signatory__c, IMAGE(\"/resource/Apttus_SignCLM__LightningResource/images/headericons/sendforcongasign.svg\", \"Send For CongaSign\"), \"_self\"), NULL ), NULL)\n \nHaving the ability to auto-populate the recipient would help reduce the risk of a user selecting the wrong recipient, and would save the user's time by not having to manually input the recipient.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this request, Matt! The CLM and Sign teams will review this together and will be taking it on for future consideration."
      }
    ]
  },
  {
    "title": "Deleted Clauses during True-Up does not flag Managed Clauses",
    "author": "Pradeep V",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When an entire clause is deleted using the Conga Redlining True-Up functionality, there is no field in Managed Clauses Object to highlight that the clause has been deleted. This is an issue when we have to send the Contract Agreement for approval when the entire clause is deleted.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Show Related Agreement page on Agreement Card in Agreement Hierarchy",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, there are only two sections on the \"Show related Agreement\" page on the Agreement Card in the Agreement Hierarchy on Account - Child Agreements and Related Agreements.\nWe need to also add an Amended/Renewed Agreements section to that page just like the Agreement Hierarchy page on Agreement Hierarchy.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Abhishek Kamalia",
        "content": ""
      }
    ]
  },
  {
    "title": "Need to show Related Agreements on the Agreement Hierarchy page",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When we add any Agreement in the Related Agreements list with Relationship types as \"Is Amendment For\", \"Is Amended By\", \"Is Renewed For\", and \"Is Renewed By\", we are unable to see those Agreements on the Agreement Hierarchy.\n \nNeed to show these related Agreements as well on the Agreement Hierarchy.\n \nRefer to below documentation -\nhttps://documentation.conga.com/clm/october-23/salesforce/viewing-agreement-hierarchy-158337903.html",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Need ability to add more fields into Account Card in Agreement Hierarchy",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, we can only view one field which is the Account number in the Account Card in Agreement Hierarchy.\nThe Admin Entry \"APTS_AccountHierarchyFields\" is only affecting the Agreement Hierarchy on Account.\n \nSo, need the ability to add or remove fields in the Account Card for Agreement Hierarchy as well.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Select - deselect all files when doing activation",
    "author": "Zarko Prelic",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When doing activation we often time have multiple revised documents that have been worked on during the contract life cycle. All of those documents will have \"Publish\" action set us default when in activation screen. Considering that we use Publish button to push ONLY the final signed documents to our internal share point as part of our process, our users need to manually deselect publish field on each and every document we do not want to publish.\n \nRequested feature is that you add \"Select/ deselect all\" button for publish field on activation page so that by one click user doing activation can for example deselect on all documents Publish checkbox and then such user can chose to publish manually only those documents he actually want to publish.\n \nI am attaching a screenshot showing publish button where we have only one document. In standard scenario there would be 30 or 40 documents with publish by default turned on which our user needs to manually deselect one by one which is a huge time waster.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Dott Buchanan",
        "content": "This would be very helpful.  We find that users simply publish everything.  Having the select/deselect all would improve the experience for the end users."
      }
    ]
  },
  {
    "title": "Enhancement - to make the \"Service Type\" field sort capable under the Child Agreements object.",
    "author": "Rachelle Blevins",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We would love to see the Service Type field be enhanced to become sort capable. This would help us out tremendously in our research process.\nThanks,\nRachelle Blevins",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Rachelle Blevins",
        "content": "Dear Vivek, our Admin confirmed the Service Type field is a \"custom multi picklist field\". He advised that Salesforce does not currently allow sorting on those fields. I am asking for an enhancement to Salesforce to change that.  Perhaps if Conga could make all \"multi-picklist fields\" sortable, that would be easier to implement.  We understand an enhancement will take time to implement.   Please consider this enhancement as it could help all customers of Conga.  Thanks, Rachelle Blevins"
      },
      {
        "commenter": "Rachelle Blevins",
        "content": "Dear Vivek,  The Service Type is a field that we have our Admin add or remove values to the list that is a picklist format, and it has defined terms we choose on each record using that picklist.  It does not give us the ability to sort.  It only provides \"Wrap text\" and \"Clip text\" to us when clicking on that drop down.  Please reconsider helping us to make this field sort capable.  Thanks, Rachelle Blevins"
      },
      {
        "commenter": "Vivek Mishra",
        "content": "Is this a custom field? If yes, I am sure Salesforce will allow you to sort based on the custom field 'Service Type'. This does not require any change from CLM"
      }
    ]
  },
  {
    "title": "Show related Agreements option on Agreement Card in Agreement Hierarchy",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Need enhancement on the \"Show related Agreements\" option on the Agreement Card in the Agreement Hierarchy to show Renewed/Amended Agreements as well with the Child Agreements section and Related Agreements section in the \"Show Related Agreements\" option.\n \nRefer to the screenshots attached.",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Page Layout Flexibility for Amend/Renew/ Clone Scenario",
    "author": "Anne Sheryl Pasumbal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We created lightning record pages for specific agreement record types and completed the page layout assignment activity for our required profile and record types. In these new layouts, there were some fields which we put some conditionality to and they were working fine for agreement creation. However, when we perform the Amend | Renew | Clone action then Conga Manage Package calls API where layout is fetched from page layout assignment instead of the lightning flexi page assignment. We managed to have a workaround by creating replica of those layouts in the classic page layout however the conditionality feature is not supported/ cannot be added here to these classic layouts.\n \nWe raised case 00848925 - Page Layout Issue while performing Amend | Renew | Clone Action to Conga Support regarding this issue however the proposed solution we got is to make custom action buttons so we can redirect the actions to the custom layout. Unfortunately, this proposal requires major customization which will cause us to miss out Conga OOB amend and renew capabilities which you may introduce in the future as new releases.\n \nCan you please consider in your future releases:\nPossibility of fetching the layout from the flexi page assignment instead of the page layout assignment onlyConditionality features to be supported in the classic page layout",
    "votes": "14 Votes",
    "comments": []
  },
  {
    "title": "Pull the \"Products / Solutions\" field from the opportunity into the Conga Record",
    "author": "Trevor McNeil",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "This Enhancement is related to the above one (Create multiple opportunities in agreement- On the Agreement Record, Users should be able to Select Multiple Opportunities) as and when the user selects the opportunities on the Agreement the \"Products / Solutions\" field from that opportunity should also show up on the agreement record.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Create multiple opportunities in agreement",
    "author": "Trevor McNeil",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "On the Agreement Record, Users should be able to Select Multiple Opportunities",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Regarding \"Show Related Agreement\" option on Viewing Agreement Hierarchy of an Account",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As per the documentation below - https://documentation.conga.com/clm/october-23/salesforce/viewing-agreement-hierarchy-of-an-account-158337919.html\n \nWe can see only the Child Agreements and the Related Agreements from the Show Related Agreement option.\nWe need a way to show Amended/Renewed Agreements as well on that \"Show Related Agreement\" page.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Use internal GMBs and email distribution lists in Conga CLM's Office 365 Review Processes",
    "author": "Christine Eggert",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Our CLM business teams want to be able to use their own internal GMBs and email distribution lists, besides internal individual contact recipients, in both Office365 Internal Review & Send for Office 365 Review processes. The businesses use GMBs as “Approval Work Queues” and this is a critical step in their contract process.",
    "votes": "23 Votes",
    "comments": []
  },
  {
    "title": "Allow executed documents to be unselected or not selected by default during activation.",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "A customer has several documents signed for an agreement. Some times this is internal signatures, external signatures, and they may have re-visions. Currently they only want one saved during activation, and they'll need to manually change the Document Type from Executed Document to Other if they do not wish for it to be selected during activation. We force the selection (https://documentation.conga.com/clm/february-23/salesforce/activating-an-agreement-195699643.html#id-.ActivatinganAgreementvFebruary23-Restrictions).\n \nAn admin entry to allow de-selection, or no selection by default, would be helpful in this situation to save time.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Need Enhancements regarding Agreement Hierarchy in Apttus/Conga CLM",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Field-based filtering when seeing Agreement Hierarchy\n\tWhen we click on \"View Agreement Hierarchy\" on an Agreement Record, we see all the related Agreements.We have a requirement to add a filter based on Agreement Fields so only those records should be visible on the Hierarchy tree.\nWe cannot add any fields in the Account Tile in the \"Agreement Hierarchy\".\n\tWe can add fields inside the Account Card if we click on the \"View Agreement Hierarchy by Account\" button on the Account Record using the Admin Entry - APTS_AccountHierarchyFields.\nOn the Account Hierarchy page, when we click on the \"Show Related Agreements\" option on any of the Agreement Cards, it redirects us to a new page where no Related Agreements are visible.\n\tWe need the ability to check the Related Agreements as well from the Account Hierarchy page.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Add HTML Body to Send for Office 365 Review Task Record",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\nCurrently we have a customer who would like to see the SharePointURL on the Agreement record. This will alleviate the need for the customers Legal team to go digging around in their Outlook Inbox, they are not interested in creating rules and specific folders.\n \nWe noticed a Task gets created each time we Send for Office 365 Review and our other products such as Conga Orchestrate and Conga Contracts for Salesforce already show the HTML Body within a Task record, can we please have the same for Conga CLM?\n \nAlso, is there anyway to show an Email Activity instead of creating a Task record?",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Carrie Bellio",
        "content": "Current Contracts for SalesforceCurrent CLM"
      }
    ]
  },
  {
    "title": "Rename the \"Renewaal Terms\" field",
    "author": "ugochukwu nwuwa",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Can you change this to say: Term/Renewal Terms (instead of just Renewal Terms as it is right now)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Rename the \"Renewaal Terms\" field",
    "author": "ugochukwu nwuwa",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Can you change this to say: Term/Renewal Terms (instead of just Renewal Terms as it is right now)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "When Document is generated using API, we need to attach the document in the Document version instead of files using single API call.",
    "author": "Manasvi V",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "If the Document is generated using conga out of the box \"Generate\" action button, the documents are getting stored under Document Versions. However, if the document is getting generated using a merge web service API call, the documents are not moved to Document Version, instead it gets stored under Note. \n \nOut of the Box API does not respect the version aware flag on Agreement hence we need to first create Document Version and then generate/attach the document using API hence we will need 2 API calls. Please find the below Knowledge article which as all the detail.\n--> https://community.conga.com/s/article/Document-Version-Document-Generation-API-Salesforce\n \nWe are requesting for a single API by which we can direct the API generated document to be attached in Document version instead of Files.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Develop Currency Field Precision based on Currency Type",
    "author": "Rene Rodriguez",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Technical Case # 00858722\n \nThere is currently an active Salesforce Limitation with Setup > \"Manage Currencies\" in which setting decimals to \"0\" still does not change the value of custom fields like Apttus_Config2__NetPrice__c in CPQ Cart\n \nhttps://help.salesforce.com/s/articleView?id=000385752&type=1 \n \nFor JPY, \" if the number of decimals is set to zero, decimals may still display\" \n \nDocuSign Business' and General Financing Requirement is requesting to see if Product can take any future action on this so the Documents generate with correct values automatically\n \n \nConga Package > Config Settings > Currency Field Precision only offers this change at the Global Level for any currency type\n \nhttps://documentation.conga.com/cpq/june-23/salesforce/config-system-properties-213459218.html\n \n \nRequested Solution:\n \nIf there is some way to store the custom field precision( database level ) based on the specific Currency Type that would help DocuSign tremendously in future\n \nI can expand more on this if needed",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Ability to suppress the header when using Merge Documents",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer (Verizon) is requesting the ability to suppress the header when using the Merge Documents functionality. Currently, the only two options are 'Retain Header and Footer' and 'Custom Header and Footer'. Having an option that would retain only the footer, and suppress the header, would provide more flexibility in how documents can be merged together.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to Default Conga Sign Recipient from CLM",
    "author": "Jigar Naik",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi,We have CongaSign CLM Integration package installed for sending document versions to Conga Sign from CLM. However, \"Send for Conga Sign\" action does not support any parameter to default recipient(s). It is being requested by SEs in many demos. Please consider this enhancement for the upcoming release.",
    "votes": "4 Votes",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thanks for submitting this idea Jigar! I believe we can add the parameters to the action but would need for it to be avialable to edit. We'll need to investigate if it can be made global."
      }
    ]
  },
  {
    "title": "SMS functionality in eSignature Process",
    "author": "Rene Rodriguez",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We wanted to explore if any potential ways we might offer such SMS functionality below for the Conga DocuSign eSignature in future\n \nhttps://support.docusign.com/s/document-item?language=en_US&bundleId=gav1643676262430&topicId=krj1607396924116.html&_LANG=enus\nTracking here for for any future stories or enhancements on Conga DS eSign Integration Package",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to update email template when another reviewer is added.",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, user's can’t update the email template when they add a reviewer.\n \nExample provided by customer (Werner Enterprirses): When a user sends a list of sections for the business reviewers to check, and then want to add another reviewer, they aren't able to update the list of sections for the reviewer to look at in the email.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Hi Matt, Can you provide more details? I don't understand the requirement completely. Is this for parallel review? If yes, while sending a document for review, what exactly is expected?"
      }
    ]
  },
  {
    "title": "Adding a new field, \"Global Flag\", on the \"Mark Clause\" screen on XAC 2.0",
    "author": "Jai Patel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "GEHC would like to add a field on the “Mark Clause” screen of XAC 2.0. The field should be available while working on templates as well as on agreement documents.The field will be called “Global Flag”. It is an important field for GE to classify their clauses and is required to be maintained when marking clauses.“Global Flag” is a picklist created on “Agreement Clause” (Apttus__Agreement_Clause__c) object. It is a dependent picklist, and its value depends on “Subcategory” (Apttus__Subcategory__c).As per existing behavior, based on user’s selection of “Category” (Apttus__Category__c) field, the system displays only the valid values in “Subcategory” field.Now, additionally, based on the user’s selection in “Subcategory”, system should display only the valid values in “Global Flag” field.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Hiteshkumar Dobariya",
        "content": "We will implement this issue on the XA 2.0 November'23 release.https://conga.atlassian.net/browse/CONTRACTS-12370"
      }
    ]
  },
  {
    "title": "Control file visibility through the ContentDocumentLink API",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "For the current implementation we are bound by Salesforce defaults; visibility for files are for AllUsers, and if there is a Community or \"Digital Experience\" site the visibility is changed to \"InternalUsers\". For a customer they generate their invoices from Conga Billing using Conga CLM; they want their community users to be able to view all invoices and download them.\n \nThey do have a workaround by building a custom trigger (following this Salesforce article), but we would be able to control it in the code out-of-the-box. If there was a toggle to control the visibility from either an admin entry or an entry in Comply System Properties it would be appreciated.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to select only finalized documents during send for signatures",
    "author": "Swapnil Devlekar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, when sending for manual signatures or eSignatures, the system shows the list of all documents from document versions. Since redlined documents also show up in the list, there is a high possibility that the user inadvertently selects a redlined document and sends it for signatures. The system should provide the ability to include/exclude redlined documents from the list and only show finalized documents.",
    "votes": "",
    "comments": [
      {
        "commenter": "Amy Reams",
        "content": "Thank you for submitting this idea, Swapnil! I will merge this with the idea linked in your comment."
      },
      {
        "commenter": "Swapnil Devlekar",
        "content": "Duplicate idea to https://community.conga.com/s/ideadetail?id=087Dm0000008a42IAA. Hence this can be cancelled"
      }
    ]
  },
  {
    "title": "Cancel approval requests & void the DocuSign envelope as well when agreement is Cancelled",
    "author": "Nikhil Kohli",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The Agreement owner can Cancel the agreement at any given time, and if an agreement gets cancelled during the ongoing approvals, the approval requests are not getting cancelled automatically. And since the parent agreement is cancelled already, the approvers cannot approve/reject those requests anymore and those are always shown in their list of items to approve.\n \nSo if the agreement is cancelled there should be a check to query all the approval requests, pending reviews, DocuSign envelope(s) should be cancelled too. Or there must be a validation error while cancelling the agreement where any in progress review/approval/signing records are present.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Clause Library - Multi-Level Lists and Alphanumeric List Options",
    "author": "Harry Mitchell",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In the clause library, there is only the option to have a numbered list or a bullet point list within a clause. For our organisation, this makes the clause library unusable.\n \nAdding the ability to have a multi-level list and being able to control the format of the list (e.g. 1, 2, 3 or a), b), c) or i. ii. iii) on each level would make the Clause Library much more functional.\n \nThere also seems to be an issue with the LRTF parameter in Conga Composer where any new lines in a clause text field that occurs after a numbered list will be inserted on a new line within Word when the Merge occurs, this means that a new clause number will be created when using automatic clause numbering.\n \nThanks for your consideration.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Harry Mitchell",
        "content": "@Vivek, I have raised this generally for creating and editing Clauses in the Clause Library. I have been trying to use it in conjunction with Conga Composer to insert them into our Contracts and have had the issue there. I have not used X-Author but can only assume it would have the same limitations if you are pulling clauses from the clause library."
      },
      {
        "commenter": "Vivek Mishra",
        "content": "Can someone clarify, if this idea has been raised for Conga Composer or X-Author for Contract templates?"
      }
    ]
  },
  {
    "title": "Review and Redlining Changes",
    "author": "Brad S",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The Use Case: There is a business need to have particular internal stakeholders participate in redlines only in certain parts of the document. Essentially looking for Approval logic and Review functionality (Ability to identify change in a Clause, and as a result, send for the appropriate party for Review instead of Approval (stakeholder needs to redline, not just Approve/Reject))\n \nThe Issue solving it w/ current product: Currently, Sales users (users “driving the clm process”) don’t know who to include on review based off specific language/Clause redlines. This can be addressed with Approvals engine to identify certain Clause changes and then route accordingly. However, Approvers don’t have a clean way to get into the document and redline. Furthermore, if a contract is lengthy, and a stakeholder only needs to interact with their specific part, it is cumbersome to navigate through the entire document for their specific section. \n \nAffected Customers: Toshiba, McKesson, potentially more",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to suppress the related documents page when sending for signature",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The OOTB page allowing for selection of 'Related Agreements' when sending for wet signature needs to be suppressed.\nThis is confusing users and no documented step in Admin Settings or Comply System Properties to prevent this screen. This is the page that the customer (Irvine Company) would like to suppress:",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Need to replace \"Apttus\" word with \"Conga\" in the report type \"Agreements with Apttus Agreement\"",
    "author": "Mayank Tiwari",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We want you to replace word \"Apttus\" with \"Conga\" in the report type \"Agreements with Aptus Agreement\n \nActual name of report type in production now Agreements with Apttus Agreement\n \nExpected name of of report type: Agreements with Conga Agreement\n \nplease let us know in case you need any additional information to look into this request.",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Check in with redline/without redline",
    "author": "Qasim Mateen",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "A user would like to check in a document via word with two versions. One being a redline check-in so the viewer can see the changes done to the contract. The other being a clean version check in so that the changes will not show and will be up to date.\n \nCurrently the users will have to make their changes, check in with redline, open the original document version to make the same exact changed, then check in without redline. This causes double work for the users and it would be nice if the user can make the change to the document once then check in with both redline and clean version.",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Need to replace \"Apttus\" word with \"Conga\" in the report type \"Agreements with Apttus Agreement\"",
    "author": "ECOM Help Desk",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We want you to replace word \"Apttus\" with \"Conga\" in the report type \"Agreements with Apttus Agreement\"\n \nActual name of report type in production now : Agreements with Apttus Agreement\n \nExpected name of of report type : Agreements with Conga Agreement\n \nplease let us know in case you need any additional information to look into this request.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Configure Agreement Hierarchy View by Record Type",
    "author": "Beth Ford",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Our record types have a lot of variety in metadata; thus it would be helpful to be able to customize the metadata fields in the Agreement Hierarchy view by Record Type. Otherwise the view may not be as helpful for some of our users.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "DocumentFinder VF page needs to be enabled for lightning experience.",
    "author": "Abhishek Jain",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nWe have an requirement from customer to see keyword and tags and also searchable on lightning experience.\nAs per our current design we have only VF page created for classic (DocumentFinder) and working fine. Please also enable it for lightning.\n \nThanks.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Send to eSignatures & Signatures should only allow final documents  to be listed",
    "author": "Swapnil Devlekar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When a user clicks on the Send of Signature or Send for eSignatures (Docusign/Echosign/Conga Sign) button, the system shows a list of all documents from the document version which includes draft documents as well. The system should only show the final version in the list so that the user accidentally or purposely doesn't send a draft/redlined version to the customer for signatures.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Swapnil Devlekar",
        "content": "Can someone provide an update on this enhancement request?"
      }
    ]
  },
  {
    "title": "Expose the publishing API so it can be reached externally",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently with publishing and auto-publishing we do need to enter credentials once through the Salesforce; the only alternative is to publish templates one-by-one. This does not work effectively for customers that enforce SSO + MFA for their orgs.\n \nWe had a past enhancement request that was never implemented to instead expose publishing templates by the API. No reason was given for abandonment. If it could be implemented it would help.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "X-Author should allow for editing of documents in Google Docs",
    "author": "Karen Schilling",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, if a Customer uses another editing software (ie. Google Docs) to edit a document that was downloaded out of Apttus we are not able to reconnect that document back to the original version. This is a big concern for many of our users. Google Docs is becoming more widely used by companies and we need more flexibility here.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Priority Subject Agreement Protection Prompt not working for \"Import Offline Agreement\"",
    "author": "Deep Joshi",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We have Enable Agreement Protection as \"Prompt\" for the \"Import Offline Agreement\" action but when we do the actual \"Import Offline Document\" in the Agreement we are not getting a prompt to select the Agreement Protection level.\n \nAnd According to below documentation\n \nhttps://documentation.conga.com/clm/latest/salesforce/configuring-agreement-document-protection-143884855.html\n \nThis option is not available for Generate/Regenerate actions.\n \nIf that's the case the option of prompt should be greyed out during  \"Import Offline Agreement\"",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Modifying the content of amail body while addiing a reviewer using 'Add reviewer' for an ongoing review process.",
    "author": "Mayank Tiwari",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Issue : Once the ADD reviewer button is clicked, it shows the email template content in the READ ONLY mode and is not editable.\n \nCustomer use case : Customer want to know what email is sent for the review for the first set of reviewers more than they want to adjust it for the new reviewers. Ideally, they want both features i.e., see the email body sent to each reviewer, and adjust it for additional reviewers.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to update Image & URL of Standard OOTB Button in Agreement Lifecycle Actions.",
    "author": "Hardik Shah",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "User should be able to update the Image & URL of Standard OOTB Button in Agreement Lifecycle Actions.  \n \nThere is workaround to create custom-button, but Clients have shown reluctance to create new Custom button partly because :\n \n1. Button is shown in additional Section (they have to scroll to locate it).\n2. Imagine multiple divisions are implementing Conga CLM, one divisions uses OOTB button, other division uses custom-button (for image change & *other use-cases).\n Even though button performs same OOTB functionality, they both are shown in different sections Of Agreement Actions, which is bad User-experience (as per Client- Boston Scientific) \n \n \n *Other-use-case : Ability to change the URL also, what if some pre-processing needs to be done before calling actual OOTB page URL? .",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Include More Recipient Events in Webhook Configuration for Docusign",
    "author": "Sagar Maurya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently as per documentation only two Recipient Events in Webhook Configuration are included.\nhttps://documentation.conga.com/dsign/latest/webhook-configuration-195698831.html\n \nWe want More Recipient Events in Webhook Configuration for Docusign like Recipient Delivered, Recipient Created",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Duplicate of https://apttus2.my.salesforce.com/ideas/viewIdea.apexp?id=087Dm0000008a1DIAQ"
      }
    ]
  },
  {
    "title": "Include More Recipient Events in Webhook Configuration for Docusign",
    "author": "Sagar Maurya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently as per documentation only two Recipient Events in Webhook Configuration are included.\nhttps://documentation.conga.com/dsign/latest/webhook-configuration-195698831.html\n \nWe want More Recipient Events in Webhook Configuration for Docusign like Recipient Delivered, Recipient Created",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Raghav Polepally",
        "content": "Sync all actions from DocuSign to Apttus using webhook config"
      }
    ]
  },
  {
    "title": "DAR filters selecton based on Agreement Record Type",
    "author": "Abhishek Jain",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nHope all are doing well.\n \nWe came across below scenario and record type name i am mentioning here for example only.\n \nAbility to created different set of DAR rule filters based on agreement object record type?\nExample : For record type MSA there will be 5 filter field, and for NDA there will be 3.\nAs OOTB we have one field set.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Update the Apttus_DocuApi.SetRecipientTabsWrapper to allow more parameters according to DocuSign's API",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently using the example custom classes from the documentation we can retrieve custom tabs from DocuSign. The issue is we only receive the string value and anchor offsets returned. If the custom tab has specific font or locked values (for example) they are not retrieved.\n \nThe DocuSign API does allow for us to retrieve more information. We use several managed package classes within our custom classes given to customers. If we could update them to retrieve the full parameters from DocuSign then the end-users and customers would have less work to do (finalization in DocuSign) before sending for eSignature.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Provide ability to track which file was submitted for approvals",
    "author": "Eric Buck",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "It would be great to track which document version entry was submitted for approval using the \"submit (with attachments)\" button\nI would prefer a specific metadata element be added to the Document Versions object with \"Approval Status\"",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Provide option to require an attachment to submit for approval",
    "author": "Eric Buck",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Our users (and especially their approvers) really do not like the fact that the default \"blue\" button on the approvals pages is \"submit\" instead of \"submit (with attachments)\" (screenshot attached) as most of the approvers are doing so via email and need the document to be attached in order to approve this way. We would like the ability to hide the the \"submit\" button and only show the \"submit (with attachments)\" option.\n \nFurther, we would prefer if the warning message (screenshot attached) was not shown but rather the user was required to attach a document before submitting for approval. Ideally this could all be configurable based on the approval rule or the record type, some sort of \"require attachments\" checkbox on the approval rule would be great.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Sorting functionality on a Lightning web component \"Agreement Documents\"",
    "author": "Chaitanya Taneja",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The customer desires a sorting functionality on the 'Version' column of custom managed component \"Agreement Documents\" on the Agreements object. As there is no default sorting mechanism in that LWC(Lightning web component), the document versions are sorted on the basis of the 'CreatedDate' field and the attached screenshot from the customer shows their documents are misarranged with no sorting. They want to find documents easier to review, as a result, it was requested that an idea is to be posted on their behalf.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Allow for default Send For Review templates to be defined by profile",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently we have the following admin entries:\nAPTS_EmailTemplateForReviewSignaturesAPTS_EmailTemplateForReviewAPTS_EmailTemplateForSignaturesAPTS_DefaultEmailTemplateFolderAPTS_SkipEmailTemplateSelection\nThis will define the default behavior for Send For Review. What would be wanted is further defining the default email template by profiles. This would have to be json specific for the values. The use case is for when multiple business orgs are using the same Salesforce org; one business unit may need a separate default template from others. The end-users also could not be relied upon to choose the correct template.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "O365 Review Using API",
    "author": "Jigar Naik",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We have a demo request where we need to end O365 review once an agreement is approved. To meet this requirement, we need an API to end the review. Is this something which can be taken as an enhancement request?",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Ability to add profile when syncing to docusign",
    "author": "Ram Gopal T",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, when user send for eSignature in docusign for the first time, the user is sync'd without profile to DS portal. We need ability to define the profile when the user sends for eSignature for the first time.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "John Hammons",
        "content": "Additionally we could make this call very easily during the creation with Oauth 2.0:https://developers.docusign.com/docs/esign-rest-api/reference/users/users/create/The idea could be implemented by specifying the profile in a new entry in DocuSign System Properties. permissionProfileName is an allowed field when the create call is made."
      }
    ]
  },
  {
    "title": "Document reviewed and review cycle progress needs to combine into one component.",
    "author": "Arun James",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "CLM document review progress can only be tracked by click onto the optional Review status field of the document version record.\nDetail view of the review cycle will only display the reviewer details and timestamp but cannot see the document reviewed, document returned by the reviewer.\n \nIt will be helpful if we can have an LWC component shown below.\nBase version of the document going through the review process.\nReviewer name and email address.\nReview comments and the document version returned by each reviewer.\nTime took to provide the response, send date/timestamp and returned date/timestamp.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Remove the CLM review process dependency on outgoing email delivery setting.",
    "author": "Arun James",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Presently CLM contract review process is dependent on the local setting on your salesforce user account outgoing email delivery.\nYou must set the email delivery option to \" send through salesforce\" to enable the review process. Without this setting review emails will not reach the recipients.\n \nRemove this platform specific dependencies, there are various reasons you need to use other delivery method and this dependency is forcing users to limit one method.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow comparison of two documents through Contract Lifecycle Management",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Today a customer is taking the following steps to compare an agreement document from Agreement A to changes in Agreement B:\nThey either have an existing document or generate a new document from Agreement A.The download the document.They import it to Agreement B using \"Import Offline Document\" functionality.They download the document again.The document is checked out in X-Author.\"Regenerate w/ Redlines\" is used to update values to Agreement B, and to compare the changes with Agreement A.\nThey do wish to automate this as much as possible. They do not want to use the out-of-the-box MS Word functionality for Review -> Compare -> Combine as this leaves too many options for their end-users, and document protection has to be removed for that call to work.\n \nSince this is a backend call to use MS Word functionality if we could make the call to the merge server directly from Contract Lifecycle Management it would avoid additional steps saving time. Otherwise they are relying on functionality of the \"Regenerate With Redlines\" button within X-Author to both update merge values and to make the comparison.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Wanted org-wide setting to remove smart search result columns for each users at once",
    "author": "Rohit Bavaliya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Dear Product Team,\n \nThe customer wanted to remove a specific number of columns from Apttus CLM Smart search results for each user. As per current functionality, users can only remove columns within their user interface (UI) and there is no org-wide setting available to remove columns for all users at once. As the customer has N number of users, removing columns for each individual user is not feasible.\n \nThe customer requested a feature that allows them to remove columns from CLM smart search results at once for every user.\n \nThis concern is raised by our customer Micron Technology, Inc.\n \nRegards,\nRohit Bavaliya",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "DAR for Custom Object Enhancement",
    "author": "Abhishek Jain",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team,\n \nAs we came across one use case where customer was trying to create DAR on custom object and as per DAR we can create only for Business object Agreement and Proposal.\n \nCan we make a enhancement to create DAR on custom object as well. As customer has lot of combinations of filters which quite difficult to handle by creating lot of templates.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Custom Activation Email Templates",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer would like the ability to use/send out their own custom activation email template, but there isn't a way to turn off or deactivate the standard OOB activation email template (so both of them are getting sent out). Using the 'APTS_RestrictEmailToCurrentuserOnActivate' Admin entry does prevent the standard email template from being sent out, but it also is preventing the custom email template from being sent out as well. It would be beneficial if there was a field in Comply System Properties where the customer could specify which email template gets sent out on Activation.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to disable EDIT mode in O365 Review for internal users",
    "author": "Shahrokh Parvaresh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When sending a contract document for review using O365, external users can only select Reviewing or Viewing Mode so all their changes are tracked. This is not the same for internal reviewers (users) and they can switch to Editing mode even if the document is password protected using Agreement Protection feature.\nWe raised this to Vivek (Conga CLM Product Manager) and he suggested us to create an idea to be able to control this via a setting. We would like to be able to disable (gray out) the Editing mode for internal users, similar to external reviewers. Internal users who have Unprotect document permission, can use XAC to unlock the document and accept/reject redlines or make untracked changes.\n \nIt would be great to see this as an enhancement in future releases.\n \nThanks!",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Crystal Lin",
        "content": "Thank you for submitting this idea, Shahrokh! Track changes by our internal reviewers should also be enabled.  We would like a configuration setting to disable Edit mode for internal reviewers so that we can implement this new feature."
      }
    ]
  },
  {
    "title": "Conditional Field - Dynamic Document",
    "author": "Rene Rodriguez",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "This was request was from DocuSign account for Conga DocuSign API package and based on functionality for\n \nhttps://support.docusign.com/s/document-item?language=en_US&rsc_301=&bundleId=gbo1643332197980&topicId=hew1578456460132.html&_LANG=enus\n \nThe closest use cases we have for this are https://documentation.conga.com/dsign/latest/adding-custom-fields-to-the-envelope-203495850.html but no conditonal capabiltiies",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Customers are facing HTML tag during Agreement creation page",
    "author": "Prasenjit Banerjee",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Most of the customers who are using latest CLM version of February'23 and facing HTML tag during Agreement creation page once they using this page Apttus__APTS_Agreement__c.\nCan you guys please fix it asap ?",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Send For Signature (Wet-Signature)",
    "author": "Hardik Shah",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Needs below enhancements for Send for Signature Functionality.\nDefault attachments - Attachment should be defaulted if there is only 1 Attachment. (Capability should be given to default more than 1 Attachemnts) Is it possible to default template selection based on Record-Type or any other way? Multiple divisions are implementing CLM, each division would like to have default template selected.  AutoPopulate 'AdditionalTo'",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Email address of requestor appended at start of file name",
    "author": "Garima Sharma",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When email is sent to external reviewer for MSA, attached filename has email address of agreement requestor appended at the start of file name.\n \nIs it possible to have the email address added to the end of the file name instead of start of it.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Garima Sharma",
        "content": "I saw that the status \"Will not implement\". Can we add a reason for the same so I can communicate to the customer effectively."
      }
    ]
  },
  {
    "title": "Allow for Delegated Flow  on the CLM -> Microsoft Teams Integration (send for review)",
    "author": "Matias Colombo",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently the Send for review (teams) integration is only capable of handling Application Authentication flow with Azure, this is a security concern for us due to the level of permissions required (Application.group.readwriteall, Application.site.readwriteall)\n \nWould like the ability for the integration to support Delegated Authentication flow so we can implement this functionality with more restrictive permissions",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Only a list of finalized document version should be available to select and send for signatures. (Wet/eSign).",
    "author": "Ranjeet Mahajan",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Only a finalized version of the Document should be sent for signatures. i.e. User should not be able to view and select the 'non-finalized' documents and send a signature request. This should be applicable When we 'Generate' the agreement document | Supporting document | Importing the supporting document | Importing offline document and now let's assume there were redlines So in this case when the user initiates 'Send for Signature' only the 'Finalized' document list should appear for document selectionP.S. We have a use case for Roche diagnostic, hence the request to prioritize. This feature is applicable to all customers as well. Thank you!",
    "votes": "8 Votes",
    "comments": []
  },
  {
    "title": "Ability to just OCR documents signed through wet signatures",
    "author": "Swapnil Devlekar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Full-text search is a major requirement for all kinds of documents. Also if the source document is a non-ocr scanned PDF.\n \nThere are 2 main use cases:\n1. Data migration of existing contracts. The source may be paper documents or already digitalized documents that are not yet OCR'ed.\n2. Paperwork originating from the customer and provided to Roche in either paper form or as a scanned document (only the final / signed version of the document will be kept in Conga) \n \nWhen uploading a PDF document to Conga CLM, the document needs to get OCR'ed. Asking the users to OCR the document upfront using another tool outside of Conga is an additional manual step that may be missed and not state-of-the-art.\n \nRequired for all major languages (Swedish, Japanese, Vietnamese for first countries). The tool doesn't need to do anything with the information that is gathered while doing the OCR (no AI-based data extraction functionality) but just makes the content available for global search.\n \nCCI offers to OCR the document but it is clubbed with data extraction functionality. Customers would like to just use the OCR functionality without data extraction for documents signed through wet signatures.",
    "votes": "9 Votes",
    "comments": [
      {
        "commenter": "Swapnil Devlekar",
        "content": "The status of this enhancement is marked as 'Already Exists'. Can you point me to the Conga Product documentation link and/or the steps to test this feature?"
      }
    ]
  },
  {
    "title": "Ability to Auto-Select PDF in the selection, when using the Send for Signature button.",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, using 'Send for Signature' will include both PDF and DOCX file types on the selection screen. Having the ability to restrict the file that is displayed to PDF, would prevent user's from sending out DOCX files to customer's. It would be beneficial for these types of use cases if there were a setting that controlled which file types get pulled into the selection screen.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to Track Changes with 'Full Access' Agreement Protection",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, 'Full Access' agreement protection will not turn on 'Track Changes' by default, and user's are having to go to the review panel to manaully track changes. Using 'Insert comments and tracked changes only' isn't viable for certain use cases, and it would be beneficial to have the option of configuring 'Track Changes' with 'Full Access' agreement protection.",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Microsoft Word does not support tracking changes in Full Access mode. If customer wants to track changes, then they have to use ICTC mode through CLM or they can change the review setting in Microsoft Word."
      }
    ]
  },
  {
    "title": "Ability to Track Changes with 'Full Access' Agreement Protection",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, 'Full Access' agreement protection will not turn on 'Track Changes' by default, and user's are having to go to the review panel to manaully track changes. Using 'Insert comments and tracked changes only' isn't viable for certain use cases, and it would be beneficial to have the option of configuring 'Track Changes' with 'Full Access' agreement protection.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Ability to disable/suppress Parallel Review Notifications",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Looking for the ability to disable/suppress Parallel Review Notifications",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to add lookup filter on the Account field on Agreement Object.",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As the Account field on Agreement Object is Managed, we are unable to add the lookup filter to that field.\nBusiness Use Case - Need the Contracting team to only select the Accounts depending on the filter provided in the lookup filter on the Account lookup field (Managed Field) on Agreement Object.\nRight now, the filter lookup attribute is disabled for users to add the filters according to their use case.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Denise Kellar",
        "content": "Specific use case is having our procurement and legal teams using CLM to manage our vendor agreements.  They have a specific Account record type and it would be good to be able to narrow down which accounts these users can select from - so they don't pick an actual customer record by mistake."
      }
    ]
  },
  {
    "title": "Roll up on Guidance column while generating a document",
    "author": "Saurabh Pancholi",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team,\nA Customer have requested for roll up of full text vie on guidance column in Generate document page for the agreements.\nPlease review the attached image and advise.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Do you mean ability to view full guidance text? If yes, that is shown once you hover on text."
      }
    ]
  },
  {
    "title": "Master-detail relationship between Agreement-->Obligation, Agreement-->Clause",
    "author": "Ranjeet Mahajan",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Master-detail relationship between Agreement-->Obligation\nMaster-detail relationship between Agreement-->Clause\n \nThe 'obligation' object represents an obligation associated with an Agreement / Clause through a Lookup relationship. \n \nScenario: In use cases where the user is being restricted from viewing the Agreement can still access the obligation (provided he has required permissions). Basically, the users restricted for agreement access shouldn't also get access to obligation. To satisfy this simple need, additional configuration of sharing rules to be configured having a downsize of performance impact.\n \nObligation cannot be in isolation and always has to be a child to either Agreement/clause hence it would be a best practice to have OOTB Master-Detail relationship which will allow restriction.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Embedded third party due diligence within CLM",
    "author": "Baptiste Courcier",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Our customer Michelin is using CLM for their Sales contracts (additional type of use cases to come). They would need in the future to check third party compliance when a contract is generated. They are currently using an external software provider for screening but they would like to have this embedded within CLM to facilitate the workflow.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Baptiste, can you provide more details? What workflow customer wants to embed in CLM? At what stage of contract?"
      }
    ]
  },
  {
    "title": "Create the billing plan at agreement level",
    "author": "Ranjeet Mahajan",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently OOTB, Conga provides ability to create billing plan at:-\nCreate a billing plan at Quote levelCreate billing plans directly from your shopping cart.\nFor one of our strategic customers, we have a requirement where 'Contract Fulfillment operational user' should have the ability to create the billing plan directly at agreement level. This way, in negotiation phase the user will add the relevant installments at agreement level by using specific Billing Plan template.\n \nIs it possible to have the user similar experience of Quote level billing plan at Agreement level?\n \nThank you!",
    "votes": "8 Votes",
    "comments": [
      {
        "commenter": "Praneeth Bhavi",
        "content": "Hello user - Thank you for taking the time to submit this idea. We appreciate your contribution.This seems to be a duplicate of the other idea that was submitted in the \"Conga Billing\" product section. As mentioned in the other idea, we will not be implementing it. Below are the reasons:\nFor the CPQ, initially, it was offered at the quote level. But, there have been asks from the customer community to support it at the Agreement and Order levels. Product responded to the new request by offering the functionality at the \"cart\" level since all the Propose & Quote / Negotiate & Execute / Manage & Fulfill products have \"cart\" as a common object. This cart functionality is our newer offering.For the strategic customer in the subject, if their Salesreps can access to Agreement, they should be able to access the cart, create just the plan without touching anything else (they can create the agreement flow accordingly), reprice and finalize the cart. The plan is created OOTB.\nUnless we hear a justified business reason (not accessing the cart is not such reason) from the customer, we don't see further value in giving this functionality at the agreement level.Once again, we appreciate your contribution to this space.Thanks & Regards,Praneeth BhaviProduct Manager for Manage & Fulfill."
      },
      {
        "commenter": "Ranjeet Mahajan",
        "content": "We support billign plan creation at Agreement cart level. However, customer is not using the Agreement level cart hence the enhancement request to create the Billing Plan at agreement level."
      }
    ]
  },
  {
    "title": "Ability to Remove the 'Notify All' Pop-Up Box When Activating Agreements",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer doesn't want their user's to be able to utilize the 'Notify All' toggle in the pop-up box that is displayed upon activating agreements.  It would be helpful to be able to bypass this pop-up box all together, since the only thing being displayed is the 'Notify All' toggle.  The customer is using customization to send out notifications, and are looking for a way to remove this pop-up box, so their user's can't see or use it.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Hide Text Message on the New Activation UI",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer is currently using the APTS_ActivateDocumentsSelectAll and APTS_ActivateDocumentsSelectable admin entries to ensure all documents stay checked on the Activation UI (and can't be unselected.)  When user's are activating the agreement, though, they are still seeing the following message:\"Selected documents will be activated.  Unselected documents will be deleted.\"  This is confusing to user's, since they won't be able to select/unselect documents anyways (due to the above admin entries).  It would be helpful if there was a way for the above text to be removed from the Activation UI, when these Admin entries are being used.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Reject changes to Smart Clauses using XAC 2.0",
    "author": "Michael Overman TS",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In XAC 1.0, when right clicking a changed clause in the Clauses section of the Control Panel, there is an option to reject the changes made to a clause. In XAC 2.0, while there's an option to reject changes made to Smart Fields, the same option is not available for Smart Clauses, which can only be deleted or undeleted. Users would like the ability to reject Smart Clause changes using 2.0 like they're able to do with 1.0",
    "votes": "3 Votes",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "You can use Microsoft Word capability to accept or reject the changes."
      }
    ]
  },
  {
    "title": "To make XA_disableautocheckout and other missing custom permissions available to include in the permission sets.",
    "author": "Drashtiben Vora",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "To make XA_disableautocheckout and other missing custom permissions available to include in the permission sets. The partner would like to provide these customer permissions to the users/profile through permissions sets and not from the admin entry. As the highlighted custom settings are available and others are not, It does not seem feasible for the partner while they implement this for their customers as they need to add all the profile Ids into the code. If they need to provide these permissions to some users and restrict other users from all having the same profiles, It’s not possible.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Document Versions List in CLM: Remove \"Name\" column and put hyperlink on \"Title\" column",
    "author": "Paul Koivula",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "I've been on multiple client engagements where the client has expressed confusion over how to get to the UI where they can view the versioned document. There is a hyperlink on the \"Name\" column, but it reflects the action taken (e.g., \"Generate Agreement\"), not the agreement (e.g., \"Enterprise Terms and Conditions\").For clients who generate multiple document types from a single agreement (this is a scenario seen where clients want to negotiate on multiple documents and then generate a single amendment agreement that only has the modified clauses from the negotiated documents), this makes even more sense.Please see attached screenshot.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to Re-Order Docs in XAC2.0",
    "author": "Rebecca Hurlburt",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Client requested that when Checking out Document through XAC2.0, we should have the ability to order them latest version to oldest version.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "@Rebecca, Contract documents are ordered from latest to old version (reverse chronological). This is already working unless we are missing something."
      },
      {
        "commenter": "Rebecca Hurlburt",
        "content": ""
      }
    ]
  },
  {
    "title": "When activating an Agreement, when I select “Notify Users” I would like the ability to attach the fully signed document to that email notification.",
    "author": "Chetan Nawale",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "I would like the option to attach the fully signed document to the activation email notification that send to specific users when activating an agreement.\n \n \n \nWhen activating an Agreement, when I select “Notify Users” I would like the ability to attach the fully signed document to that email notification.",
    "votes": "5 Votes",
    "comments": []
  },
  {
    "title": "Ability of X-Author word to change a status and status category value of Agreement when sending document for review from X-Author word",
    "author": "Yogeshkumar Bhimasibhai Kachhot",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "1) Generate any document in DOCX format and check out it on X-Author Contract.\n2) Go to Review panel under X-Author Contract and choose Send for review option there.\n3) Outlook will open with attached copy of the document. We can send it to any user.\n4) After sending this document for review status and status category of the Agreement should be changed. Currently both fields are not getting changed.\n \nPlease consider this enhancement.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Need Functionality to disable auto hide add header and footer",
    "author": "Yash Parikh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We have OOTB Functionality in the comply system properties, Auto Insert Header Footer Data which automatically inserts the Agreement Header and Footer in the generated document for all the users .Now, the customer wants to don't print the header and footer for some of the users. so please considers this as a future enhancement.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Add Spanish in Language picklist for Conga CLM",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In Override, customer would like Spanish as an available language for Conga CLM.Please see attached screenshot.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Hi Carrie, Where exactly customer is looking for Spanish language? Do they want entire application to be displayed in Spanish?"
      }
    ]
  },
  {
    "title": "User can continue without uploading any file in \"AgreementStoreExecutedNew\" page",
    "author": "Prasenjit Banerjee",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Is there any way to make required/mandatory \"Choose File\" or disable \"Continue\" button until we upload any files in OOB \"AgreementStoreExecutedNew\" page? Customers are facing this issue without uploading any file User can continue create Fully Signed Agreement. This seems to be product loophole. Can you please fix this issue?It's not similar like other page(why \"Continue\" button is not disabled when there is no files are attached in \"AgreementStoreExecutedNew\" page ?). This issue is faced by Parexel customer.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Prasenjit Banerjee",
        "content": "Please reach out to me if you need any clarification."
      }
    ]
  },
  {
    "title": "Ability to send document for office365 review by using page layout buttons",
    "author": "Rohit Bavaliya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team,\nWe analyzed that Office365 internal/external review only works when the user sends documents through the action panel office365 review buttons. If page layout internal/external review buttons are used, documents are sent for parallel review instead of Office365 review.\nThe user has a requirement to use page layout buttons to send documents for office365 review functionality.\nCould you please consider this enhancement for future CLM product releases?",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "X-Author 1.0 with Windows 11",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Based on the current documentation, X-Author 1.0 doesn't seem to be supported by Windows 11. As a workaround, we have suggested the customer to use XAC 2.0 instead. However, the customer would like to be able to use X-Author 1.0 within the Windows 11 system.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to hide the \"Notify Others\" option on the Agreement Activation page",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team, the customer would like to have an option to hide the \"Notify Others\" option on the Agreement Activation page or restrict users to toggle this feature to on.Thanks!",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Filter Document Version Details records for files marked \"Is Transient\" when using Send for Review or eSignatures",
    "author": "Michael Overman TS",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Some Document Version Details records' files get marked \"Is Transient\" during upload. Currently these files are able to be selected when sending for review/esignatures. Users would like these files to be automatically filtered out when using these actions.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Duplicate of https://apttus2.my.salesforce.com/ideas/viewIdea.apexp?id=087Dm0000008ZTC"
      }
    ]
  },
  {
    "title": "Ability to filter \"Is Transient\" files when selecting attachments for Send for Review or Send for eSignatures",
    "author": "Michael Overman TS",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Some documents or attachments fail to upload completely/correctly and the \"Is Transient\" field on their Document Version Detail record is marked TRUE. While users are able to delete these files when this happens, if they're still related to the Agreement record, they are visible for selection when using Send for Review or Send for eSignatures Agreement actions. Team would like for these records to be automatically filtered out of these selection lists.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Bilingual Contracts",
    "author": "Akshay Bhujbal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "A bilingual Contract has one side in English and the other in Thai. (Language can vary according to the scenario). After generating, the merge fields should come in English on the English side and should translate into Thai for the other Thai side of the document.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "In Conga-Adobe Sign Integration package, Stop/ restrict Status update to \"Fully Signed\" in Conga Agreement",
    "author": "Prasenjit Banerjee",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Couple of customers are facing the same issue for Conga-adobe sign integration package. When a partially signed agreement is signed, conga agreement status is changing to Fully Signed status which is irritating to customer. Customer needs a Admin Entry/Custom settings which they can leverage to change based on their requirements. Basically Conga Agreement status will be driven by \"Status\" of 'echosign_dev1__SIGN_Agreement__c ' (Which is Agreement object from Adobe sign package). Once the status of echosign_dev1__SIGN_Agreement__c is 'Signed', \"Status\" of Conga Agreement object will be 'Fully Signed'. We have custom settings in \"Adobe Sign Agreement Update Settings \" called  Upadte Agreement Status (but it has adverse impact in Adobe Agreements too). Customer doesn't want to disturb anything in Adobe Agreement side along with any Customisation. They need a OOB solution which they can use. Please help to provide a OOB solution.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Prasenjit Banerjee",
        "content": "Similar like 'Update Agreement Status' under Adobe Sign Settings(Custom Settings ) which they can control for Conga Agreements"
      }
    ]
  },
  {
    "title": "Action Button Hover Text",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Allow for Help Text to be displayed when User's hover over an action button.  The text would help explain to user's the purpose of the button they are using, so they avoid selecting the wrong action button.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Matt, are you referring to specific action button?"
      }
    ]
  },
  {
    "title": "Display Action Buttons Laterally in the Action Panel",
    "author": "Matt Penrod",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer would like the ability to change the layout of the LightningAgreementActions Visualforce page so that it displays action buttons laterally instead of in vertical sections.  This layout was previously available in previous versions of Conga CLM, and was more convenient for users and easier to understand.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "X-Author Template Formatting to Work when Picklist Values Need to be Printed",
    "author": "Taylor Fikri",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Team,\n \nAfter Rogers Communications' latest upgrade, they discovered X-Author templates seize to work when picklist values need to be printed. The workaround of creating a text formula referencing the picklist field is labor intensive and they want this to work in the latest version as it formally did for them pre-upgrade. Can you please prioritize? This is a product limitation.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Use Contract Intelligence Insights against contracts during negotiations",
    "author": "Michael Smith",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Contract Intelligence has the ability to setup Insights which helps reduce the risk to an organization. This currently works when importing documents. It would also be helpful to use the same Insights during the negotiation process.\n \nAs redlines are returned, a CLM user or X-Author Contracts user could submit the current document with redlines to the Insights engine to determine if any of those same risks are present.",
    "votes": "5 Votes",
    "comments": [
      {
        "commenter": "Grant Glazer",
        "content": "Ironclad does this today using ChatGPT: https://ironcladapp.com/blog/ai-assist-ai-contract-management/"
      }
    ]
  },
  {
    "title": "Create any Custom settings/Admin Entry to Stop/Restrict change in Conga Agreement Status as \"Fully Signed\" for Adobe Sign integration from OOB package code",
    "author": "Prasenjit Banerjee",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer has an agreement where Status Category= In Authoring and Status= Deal Team Approved. (Using Adobe Sign integration with CLM for eSignature).Now they send for eSign via Adobe and successfully send for signature to signer. Then status is changing to Status Category= In Signatures and Status= Other Party SignaturesOnce signed back, customer wants same Status Category= In Signatures and Status= Other Party Signatures.(But actually it's changing Status= Fully Signed from OOB package code).",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Duplicate."
      }
    ]
  },
  {
    "title": "XAC support for Import Supporting Document",
    "author": "Tirthak Kothari",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, if we upload any document using \"Import Supporting Document\" and try to check in that document using X-Author, it won't work. So, the customer would like to add this functionality wherein we can check in the document that is uploaded using the \"Import Supporting Document\" feature.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to select the changes in Final merged copy document",
    "author": "Ram Gopal T",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As of now, when Parallel review completes, the final merged document, overrides all the smart field’s value with final reviewer’s selection, and it contains tracked changes for other fields which were modified by previous reviewers.In this process, there can be a scenario where a field was never modified by the last reviewer but the final merged document will show it as redlined and mark the final change against last reviewer, because previous reviewer had changed it’s value.\nThe customer is requesting the below feature.\n \nOnce the review process is complete, when the Contract Manager or owner checks out the final merged copy, under Doc Fields tab in XAC, they should be able to see the fields value submitted by each reviewer.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Once Agreement Protection Is Enabled - In Flight Documents also have this protection",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer has enabled Agreement Protection but has in flight agreements that do not have the protection enabled. Only new Agreements have the protection.Customer is asking if there could be a way for the protection to show on in flight agreements as well.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Protection is applied when generating the document. For already generated documents, it can be enabled via Microsoft Word."
      }
    ]
  },
  {
    "title": "Need a way to know which fields are smart and which are not in Conga CLM",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As currently, we don't have any feature to know which fields are smart in the Template Record in Conga CLM (Apttus CLM).As of now, there is only one way to know which fields are smart and that is from X-Author from Contracts (Control Panel).So it would be better if we can have the functionality where there is a related list on the Template Object record which has records or lists of all the Smart Merge Fields added to that particular template.This will help the Admins to understand which fields are Smart and will also help in troubleshooting purposes as well.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Track Checkout and Check in Time of Contract document",
    "author": "Priyanshi Agrawal(Conga)",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Business Requirement:Working with a Global Team and hundreds of different templates in different languages, from a manager's perspective it would be very helpful to know how long users are actively working on an Agreement Document and how much time they spent on average working on this document. Based on this, the manager would know which documents need some improvements, to be simplified or the user would need additional help and training. Also from a cost perspective, it would help to measure the actual work time they spent in this area, if more people need to get hired, etc. As of now, this is a kind of black box for managers.",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Do you mean working on templates or agreement documents?"
      }
    ]
  },
  {
    "title": "If contact is mentioned in APTS_DefaultEmailContactName entry, consider it as a default contact instead of creating a new one / dummy one.",
    "author": "Dhaval Prajapati",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "For CLM, we observed the behavior that the System is not taking the mentioned contact in APTS_DefaultEmailContactName entry and creating a dummy contact on the backend. So, we are expecting that system should consider the contact mentioned in APTS_DefaultEmailContactName entry as default contact and should not create any dummy contact. If contact mentioned in APTS_DefaultEmailContactName entry is blank then, it is fine to create any dummy contact.\n \nRelated TS Case#00828670",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "CLM - Send for Review customize field updates",
    "author": "Michael Overman TS",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Daniel from DaVita would like to customize the Send for Review field updates (and not have them happen). It looks like being able to customize the Agreement Action field update values would be a helpful option to them in general.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Keep a copy of activated documents in the 'Document Version' related list while moving them to the repository.",
    "author": "Namrata Kusmude",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Upon activation, documents are removed from 'Document Version' related list and are moved to the repository. Customer would like the documents to be available in the 'Document Version' as well.",
    "votes": "2 Votes",
    "comments": [
      {
        "commenter": "Vivek Mishra",
        "content": "Duplicate Idea"
      }
    ]
  },
  {
    "title": "Keep a copy of activated document in document version while also moving them to the repository on activation",
    "author": "Namrata Kusmude",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Upon activation, documents are deleted from 'Document Version' related list and moved to the 'repository'. It would be helpful if the document is not deleted from Document Version as users usually search the documents there.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Request to have Agreement Version Locks to be displayed on the Agreement Page instead of the Document Version page",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Current Behavior:When \"Use Agreement Locks for Versioning\" checkbox is checked within the Comply system properties, an Agreement Lock record will be generated and the \"is locked\" checked box will be checked on the Agreement record page as soon as the document is checked out by the user. If the \"Use Agreement Locks for Versioning\" checkbox is unchecked, the lock status will be identified by the \"Checkout By\" field within the Document Version page. Request: (Technical support case: 00828224)The customer has requested to have the Agreement locks to be displayed on the Agreement record page when the \"Use Agreement Locks for Versioning\" checkbox is unchecked, so the user doesn't need to dig into the 'Checked Out by' field on the Document Version to find out why an a document was still locked.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Option to hide the \"Send for Review and Check-in\" button within XAC 2.0 while \"Parallel Review\" is enabled in comply system properites",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team, the customer would like to hide the  \"Send for Review and Check-in\" button in XAC 2.0 UI. Based on the below documentation, the \"Send for Review and Check-in\" button will always be displayed in XAC 2.0 if \"Parallel Review\" is enabled. However, the business requires the user to use the \"Parallel Review\" feature. It would be great if we can hide this button while \"Parallel Review\" is enabled? Thanks!",
    "votes": "1 Vote",
    "comments": [
      {
        "commenter": "Christine Eggert",
        "content": "Also would be nice to hide it when Office365 Review are enabled.  We do not use PR but are told that PR must be enabled in order to use Office365 Review."
      }
    ]
  },
  {
    "title": "O365 Automate Completed Review Cycles",
    "author": "Shefa S.",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Use Case: Contract Managers don't always have time to review emails to be notified that each user is done so they can manually end the review. They need a process that will notify them within SFDC that the review is completed. Attaching a new version of the redlined copy and any replies that could be found in the email.\n \nImplement a way for reviewer to complete their review from their end by using a button or hot word(similiar to approvals). Creating a type of automation with the email reply to automatically complete the review cycle and create a new doc version. (Similar to Parallel review)",
    "votes": "6 Votes",
    "comments": [
      {
        "commenter": "Crystal Lin",
        "content": "Shefa, this is a great idea! We are in the same situation where we want all notifications to reside in Salesforce/Conga CLM.  We had considered using a Task or Note in SFDC to notify the Contract Manager however only our internal reviewers would be able to create a task or note since our external reviewers do not have access to SFDC/Conga. It would be fantastic if Conga could accept keywords in an email reply from the internal and external reviewers i.e. Done, Completed etc. and the system could automatically end the review.I really hope your idea gets enough votes as this would determine if our company will be integrating O365."
      }
    ]
  },
  {
    "title": "Office 365 - Prepopulate Reviewers Email List",
    "author": "Linh Ton",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Prospect currently looking for Collaboration via Contracts for internal reviewers. They  have a set list of reviewers and wanted a feature where we can prepopulate the reviewer's email when sending for Office 365 Internal Review.  They currently have this in their homebrew system and want parity since its the same list of reviewers.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Ability to hide the RTF, PDF document output format",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The customer would like to hide the RTF and PDF format on the Template selection page so that the user can only choose \"DOC\" and \"DOCX\" format. If we can select DOCX and allow override within the \"Agreement Document Output Formats\" setting, the user will still be able see the RTF and PDF format on the Template selection page. We tried to restrict the picklist value through record type, however, the user will need to set the \"Allowable Output Formats\" field value on every agreement record to make it work and this may cause more potential issues. It would be great if we can select two available formats on the \"Agreement Document Output Formats\" setting.Thanks!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to change template file or attachment name in Salesforce Lightning",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When an user wants to change the actual filename of an Agreement Template they currently have two options:\nThey can check out the template with X-Author for Contracts. The name can be changed after checking the document back in.They can use Salesforce Classic -> go to the Template object -> check Files/Notes & Attachments and rename the file directly.\nWithin Salesforce Lightning we only have two options in the CombinedAttachment view: Delete or Download. Customer's use-case is for users that want to change the filename directly in Salesforce.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Default Email Configuration in OCC",
    "author": "Brandon Clay",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "New Idea is for OCC is to have the heading and signature (bold text below) configurable.\n \nHello and thank you for waiting,\n \nThe publishing of 19999-970001-BRIDGE ELECTRIC CORP.-Subcontract_Agreement_Redlines_version_2023-01-17 is complete. To continue, see ........\n \nCheers,\nYour friends at Conga",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Routing documents to sub folders within the library",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The customer requires folder level storage for the CLM documents. They would like to use multiple values on the Agreement object to determine the correct folder which would be 3 – 4 layers deep.For example, they have a custom folder called NDA and a sub folder call NDA-US within the Agreement library. They would like to to route the NDA documents to the NDA folder or the NDA-US folder directly.Based on the existing Admin entry and the Agreement rule type, we were only able to route the documents to library level only, not the folder within the library.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Pdf+doc/docx should be merged as docx in Merge Documents functionality",
    "author": "Gunjan Vazirani",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer wanted to create a docx file when merging a pdf and a doc/docx as per their business usecase where they wanted to send the supporting document(pdf) for review.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Remove \"Conga Apps\" tab or make it full featured",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In the Conga Base Library package there's a \"Conga Apps\" tab that is included. The buttons are non-functioning, and the LWC + tab appear to be half-finished. While we can hide the tab currently it does pique some customer's interests. It references Conga Configure Price Quote, Conga Contract Lifecycle Management, Conga Contracts for Salesforce, and Conga Sign on the page.If we could remove the page from the package it'd help decrease potential bloat. Otherwise, at least one customer would prefer it to be feature-rich.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add ability to mark individual reviewers as Completed in a Review Cycle (O365 specific)",
    "author": "Michael Bahr",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently in a Review Cycle for Office365 Review, there is no way to track individual Reviewer's Status.\nSince the need currently is to have the sender (internal User) manually close the Review Cycle via End Review, there is a need to had the ability to track the status of each Reviewer.\n \nIn the Use Case of a Review being sent to 5 participants (for example), currently, the internal User would need to monitor their email inbox to see and know when all 5 Reviewers have indicated they have completed review.\nIt would be better to be able to manually update the Review Status for each Reviewer in the Review Cycle, so that it would be clearer when the entire Review Cycle needed to be ended.",
    "votes": "7 Votes",
    "comments": []
  },
  {
    "title": "4.\tField character limit (255) for Code field in Admin Entry “APTS_CustomLinksforActionPanel”",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When we are adding more number of field values into the Code field of Admin Entry \"APTS_CustomLinksforActionPanel\", we are unable to as there is a limit to only insert 255 characters in the Code field.Need this to be extended so that we can add more values into the Lightning Action Panel on the Agreement Record page.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga CLM - Add a new column (Last modified date) on Apttus__SendForReviewContainer page while sending for parallel review",
    "author": "Meeti Shah",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Today in Conga CLM, there is no Out-of-the-box feature to add a new column on Apttus__SendForReviewContainer page while sending for parallel review.Feature required: Out-of-the-box ability to add the Last modified date column on Apttus__SendForReviewContainer page -> Step 1 of 2: Select Document(s), while sending for parallel review.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga CLM - password protection on selective document types",
    "author": "Renish Bhimani (comm)",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Problem statement: Today in Conga CLM, password-protecting agreement documents is a global setting. We cannot pick certain agreement types to be password protected and certain to not be protected\n \nUse Case: At Conga, certain paper types are worked upon heavily by Services Sales (SOW) and certain heavily by Legal (MSA, NDA).\nFor papers that are not worked upon heavily by legal, we need password protection to help Conga teams to ensure no sneaky changes are made whereas on document types where legal is heavily involved, legal wants the paper to be unprotected (and customers demand the same on these paper types).\n \nRight now, Conga CLM cannot do this (as per our understanding) as password protection on a document is a global setting.\n \nFeature Required: Ability to password-protect documents on selected paper types.",
    "votes": "4 Votes",
    "comments": [
      {
        "commenter": "Florence Eden",
        "content": "This enhancement request is also applicable to Robert Bosch who are looking for a similar feature."
      }
    ]
  },
  {
    "title": "Merge Excel file with Word or PDF via Merge Document button on Agreement",
    "author": "Mohammed Girniwala",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hello Team, The customer is able to merge MS word and PDF documents.Customer but Also like to have the Excel file as well as an option.So they can merge the same.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Displaying a warning message when users try to close a Renew/Amend page directly without saving the record",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We are seeing some issues where the \"Related to\" and \"Related from\" field were not populated during the Renew/Amend process. So far we have identified that the issue could be cased by inappropriate operations such as closing the Renew/Amend window too quick while the process is still running, or not using the \"cancel\" button to cancel the process. If the user close out the Renew/Amend page directly, the new renewed/amended record will still be created and \"Related to\" and \"Related from\" field will not be populated.The customer would like to have a warning message to be displayed on the Edit Renew/Amend page layout to avoid closing the window while the process is still running. Please see the screenshot below:Thanks!",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "An Admin Entry for Permission Sets instead of Profiles as per APTS_ProfilePermissions",
    "author": "Leah Migacz",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Starbucks has a particular use case where they have a common Profile for most users. They are aware of View Setup & Configuration for XAC access in accordance with Apttus.XA_Contracts and Apttus.XA_Template permissions. \n \nThey would find the Admin Entry most helpful but would grant too much access for their liking. They would like us to consider an option for an Admin Entry that features Permission Sets that can be in a JSON response as opposed to Profiles as highlighted in APTS_ProfilePermissions.\n \nThank you for your consideration!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Populate picklist field values in Template language",
    "author": "Yash Parikh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Product: X-Author for Contract / Apttus CLM\n \n--> User wants to generate an agreement in which the document includes the picklist value which would be translated into the template language, not into the user language.\n--> For ex. If a German user is trying to generate the agreement using the English language, then it would generate the agreement in the English language (Template Language). \n--> Our product is not supporting this feature yet and hence we have created an Idea for the product team that includes this feature in a future enhancement.",
    "votes": "6 Votes",
    "comments": []
  },
  {
    "title": "Error while checking-in Redlined document directly from the email",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "After the Document is Generated in Apttus CLM, we send for Review to Third Party.\nAfter the Third Party redlines the document and sends it back from the same email chain, you open the redlined document received from reply email from Third Party directly without downloading the document in local machine.\nOnce the Document is opened in Word , log in to XAC 2.0 and check-in the Document.\nIt throws an error however the Check-in is successful.\nThe error is very generic and there is no error in the developer console in Word as well.\nThis error is confusing the user as the check-in is successful.\n \nWork Around - Download the redlined document received from Third Party into local machine and then try to check-in the document. there won't be any error",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Agreement Clause show Word Table in a paragraph format which is difficult to read and understand. It doesn't hold Table formatting.",
    "author": "Manvi Kothari",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "1. Create a Word table in the Template\n2. Mark the table as Smart Clause.\n3. Generate the document using this template\n4. Verify the Agreement Clause\n \nAgreement Clause show Word Table in a paragraph format which is difficult to read and understand. It doesn't hold Table formatting.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Misleading information is shown under Agreement Actions > Preview > Generate/Submit",
    "author": "Avinash D Lund",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Description - In the Preview Button under Agreement Actions, the Generate Button shows a misleading message.\n\"The Test Preview document was generated.\nYou can find the document in the Agreement Record.\n \nDocument name : Test Preview_Preview__2022-11-08.docx\nClick here to view this file\" The 1st part of the message is misleading and should ideally be removed or reworded.\n \nIn the Preview Button under Agreement Actions, the Submit Button should be removed as the message shown is again misleading to a user \"The document is being generated in the background. You can continue actions while the system processes the data. Stay signed in until you receive an email notification of the completion.\"",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "DocuSign Scheduled Jobs frequency period",
    "author": "Abhishek Kamalia",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As we have DocuSign scheduled Jobs which runs every 15 mins. However we cannot control the frequency time of the Jobs to make it run every 5 mins or something like that.\nSo Need ability to chose the frequency time other than every 15 mins.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Do not allow batch jobs created to check eSignature status if one is already running.",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "After the DocuSign integration update we now allow for multiple batch job creation. This creates multiple requests to DocuSign, and we receive multiple _signed.pdf copies back into the agreement record. It can create duplicates if an end-user is impatient and requests the status multiple times within the same minute.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "\"Service Type\" Column Sorted Alphabetically",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "in Child Agreement View, the \"Service Type\" column cannot be sorted alphabetically due to it being a Multi-Picklist field. Can you update CLM to allow for that sorting ability? That update would be a great help to our review process. Thanks, Rachelle Blevins",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Gear icon on a page that comes up after clicking Send for Review",
    "author": "Gunjan Vazirani",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "After upgrading CLM Conga Contract Lifecycle Management from version 12.605 to version 13.669, on the page that comes up after clicking on Send for Review, the \"Last modified Date\" column disappeared. As a work around, we set up smart search and kept the Agreement Version aware. After doing this, a gear icon was visible and customer was able to add/remove the fields as per there preference.\n\n\nBut this should not be the case, that gear icon should be coming as a feature on that page irrespective of any setup.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "\"Next Revision Date\" field add help text what exactly this field is there for",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Micron suggested we add a help text on what exactly this field is there for on the template record and how it should be used. There is nothing in Conga's documentation surrounding this field.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Options to turn off \"Agreement activation email notification\"",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Based on the current OOTB settings, the user will receive an email after the agreement is activated regardless of the Notify others toggle is on or off.\n\nThe customer (Splunk Inc) would like to have either an Admin entry or any other similar mechanism to turn off this email notification.\n\nThanks!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Use the Reviewer name for Last Modified By on the Review Checkin document during Parallel Review",
    "author": "Michael Smith",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customers ask how to tell which document is specific to a reviewer after being checked in during the parallel review process. Currently every document is stamped with the originator of the review process.\n\nIt would be very helpful to see the reviewer's name as the Last Modified By for the Review Checkin version so it's clear who's document was checked in during the review cycle if users want to look at that version only.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Restrict document file format to be uploaded using Import Offline Document button",
    "author": "Ankur Prasad",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Verizon team has requested for a new feature / setting which could be used to restrict the upload of specific format of files using Import Offline Document button. They want to restrict the upload to only .doc/.docx format. Kindly suggest.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Remove Duplicate Document Selection during Conga Sign and Default Primary Contact as a signer",
    "author": "vivek parmar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When you click Send For Conga Sign button from Conga CLM, it navigates to document selection screen \"Apttus_SignCLM__SendForCongaSignContainer\" as shown in attached snapshot:\n\nPost this, conga sign again ask for document selection (which is standard transaction screen and we should leverage this screen and not\nApttus_SignCLM__SendForCongaSignContainer). Here also reciepient is not pre-selected and we have to manually need to assign.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Need of Merge field for email notification sent after attaching the wrong attachment during review cycle",
    "author": "Thribuvan B N",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We got an issue raised from the customer:\n\nAs we have many accounts with multiple contracts and when one of the accounts executes an agreement with the wrong attachment. System generates a auto response based on metadata file name. The auto response email template do not have merge field so we can identify which agreement was not successful.\n\n\nSolution provided by engineering team:\n\nJira >> CLM-8149\n\nWhen user respond via email and system gets the email, then system does not know for which agreement or for which document this email has come; so system uses metadata of the document to find out the document and agreement details. But if the document is not correct, then it will not find the right metadata within the document and hence this email is sent out. Here if the document is wrong then there is no way to know for which agreement or document this updated document has come, so it is not feasible to add merge field in the email template for this specific case. So we can not do much about it, however customer can add more user friendly text if they want and hence this template is provided.\n\n\nAs the reason customer is requesting the below:\n\nThe user needs to be identified which email failed and which email has the wrong attachment. For example, the User can have 3-4 agreements submitted to the business. If the 3rd agreement attachment was wrong and the user needs to get identified like which agreement's attachment was wrong.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "CLM - Send for Negotiation button attaches to existing email thread instead of starting a new one.",
    "author": "Michael Overman TS",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In many instances, prior to generating an Agreement document, the customer will already have an email thread going with their customer offline (sent from outside of Salesforce but captured inside of Salesforce). Customer wants the Send for Negotiation button to attach its message and document to that existing thread instead of starting a new one. (Req. by Dylan Gray Consulting)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enable the adding of timezone to \"Footer Datetime Format For Imported Docs\" Setting",
    "author": "John Bow",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "See attached screenshot\n\n\nPossible related website: https://developer.salesforce.com/docs/component-library/bundle/lightning-formatted-date-time/documentation",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Summarize redlining as list of changes, rather than just sending updated document",
    "author": "John Bow",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When in the negotiation phase of a contract, redlining is essential. When first round of negotiation is completed, and the document is sent back to the customer for review, the entire document is sent back to the customer. Along with the document, would it be possible to include a list of all of the changes made / redlining that was accepted?\n\n\nIf the contract is long, or if the customer/reviewer has many many contracts to review, they might find this a benefit in getting them to remember the context of the original reason to redline the respective lines",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add a \"Last Date Modified\" Column on the list view  when you select the send for review button in CLM",
    "author": "Cody Fullinwider",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer is wanting to add a new column \"Last Date Modified\" to the list view when you select the send for review button in CLM. This column exists when you click activate or send for signature.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Sign actions within CLM Agreement",
    "author": "Valerie Phillips",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "If Conga Sign and CLM are both implemented, it would be an interesting integration to be able to control Conga Sign functions from the CLM Agreement record.\n\nExample: Being able to cancel transaction, re-send transaction, pull audit trail, re-assign signer",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Track email responses when using O365 external review",
    "author": "Karol Arguello",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "I understand that currently, internally we use the Microsoft Graph API to send out the emails for O365 reviews and not Salesforce email services. It would be a good enhancement to be able to track any email and comments included in an email, during the review process.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow option to notify agreement owner on end of review",
    "author": "John Hammons",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Out-of-the-box behavior for \"End review\" and checking in a document after review notifies the reviewer via email. For the customer it is a business requirement that the agreement owner is notified when the reviewer ends the review. Other customers in the past have had to use AMS hours to achieve this with a flow or workflow, and the ask is for this to be out-of-the-box in the future.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Keep Documents Associated to Agreement Record Even if Not Published",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customers would like to keep documents that are not going to be published associated to the agreement record and not remove them.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Smart Search Performance Improvement",
    "author": "Mufaddal Laxmidhar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Following are the performance related issues reported by Customer on the Smart Search.\n\nIt takes a lot of time to Search keywords when being done from SmartSearchHome lightning component. While doing the same using Smart Search Tab takes lesser time.\n\n\nCan we please optimize smart search to improve loading and search time?",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Smart Search: To default the Search object to “agreements” or any other Objects",
    "author": "Thribuvan B N",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Smart Search: To default the Search object to \"agreements\" or any other Objects",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to price Assets with PLI Pricing and switch to Assets as opposed to reverse way.",
    "author": "Balaji Krishnan",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Today, when we are adding assets from Install products to the cart, the products are automatically priced using the \"Asset Price\" and then the user can markup, markdown or do any adjustments for the pricing. This is OOTB functioanality today. This is good in many cases.\n\n\nHowever there are cases where user wanted to renew the products. So they go to install products, click \"Renew\" that adds the products to the cart. However at this point the user wants to start with the PLI price as opposed to \"Asset price\". Futher they need the ability to switch between PLI and Asset price.\n\nThe ask is to have a flag or something that will make this possible to start with either \"PLI Price\" or \"Asset Price\".\n\n\nIn order to get this use case going, what we had done is to have a PLI trigger plus a pricing extension call back that was written and custom made the solution with the help of Nathan. This is the proposed solution and it seems to be on right track although we will propose this to customer.\n\n\nBut it would be great to have this in the PRODUCT itself.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Parallel Amendment of Contract Terms and Lines​",
    "author": "Ahmad Khalifa",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Contract Management users may need to amend and negotiate an Agreement in parallel. One set of users revise the Documents over a long period of time (up to 6 months) and another set of users will work on Line Item pricing on a much shorter time scale (weekly).​\n\n​\n\nThis request is to support some way for parallel Agreement amendment in some way that allows users to Amend and Activate while other set of users can Amend and negotiate.​\n\n​\n\nThe only available approach is to split the Agreement into two record types, one to track Documents and another to track Lines, however this will require redesigning multiple areas and integrations",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Increase the limitation of the Number of  query templates , it is 44 as of now",
    "author": "Jay Patel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We need to increase the limit of the query templates to acahive our use case.\n\n\nHowever, You cannot define more than 44 query templates. If you define more than 44 query templates, the Template Selection page that appears while generating documents does not display templates.\n\nAs per this Document:\n\nhttps://documentation.conga.com/clm/summer-21/query-template-143884799.html",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Allow Agreement owners to manage Agreement activation emails",
    "author": "Harshit Solanki",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "--> Whenever a user tries to send an activate an Agreement the \"Agreement owner\" is getting an activation main.\n\n--> The mail is getting sent from our managed package.\n\n--> Please allow users to control that behavior.\n\n\n--> Suppose a user doesn't want to receive those mails so in this scenario what that user can do?\n\n\n--> Please make this a user-controllable behavior.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "To enable CLM Smart Search for the users having Salesforce Platform License",
    "author": "Ram Gopal T",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "This has been requested by one of our customers (Case 00802963) to enable CLM Smart Search for Salesforce Platform License users. Currently as Salesforce Platform License users has limited access to the objects, they are unable to use CLM Smart Search.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Tracking and Managing Contractual Obligations",
    "author": "Vikram Chakrabarty",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Obligations emerge out of a contract as part of the negotiation process. When two (or more parties) negotiate the various terms and clauses in a contract, what they are really doing is determining the obligations of both parties involved in the contract. Here's a simple but effective and fairly validated idea for an effective obligation management solution, where you start with the usual contract negotiation, arrive at the final set of negotiated clauses at signatures, tag those negotiated clauses as which ones need to be tracked as obligations, categorize the obligations, assign an accountable and responsible owner to the obligations, determine how the obligation should be assessed for compliance (in most cases it would be an assessment survey questionnaire) and lastly determine the number of times in a year you would want to assess the obligatino for compliance. Now the system automatically creates TASKS that send an email notification to the responsible (and accountable) persons as the tasks fall due. The email contains a link to an assessment survey (leveraging Salesforce communities here) which can be filled out by the responsible person and submitted. This submission is captured on the obligation and based on the submitted responses, the accountable person can determine whether the obligation is in compliance, at risk of non compliance or is already in jeopardy.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "CLM Accelerator Legal Home Page Links",
    "author": "Sonia Prasala",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "I found an issue about the dashboard link on Legal Home Page. It is supposed to point to 'Legal Performance Dashboard' that comes as a part of Accelerator package\n\nAPTS_HomePageLink controller shows hard coded as /lightning/r/Dashboard/01Z8C0000004PCaUAM/view?queryScope=userFolders but ID would need to be dynamic to work",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "CreatewordPackage API is merging two Word documents but start with new Page",
    "author": "Jay Patel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "we are using CreatewordPackage API to merge two or more Word documents. However, we are observing that each document that merge start with new Page.\n\n\nIt would be better if we can merge the document without the extra space and the next dopcument would get attached from where the first ended (cursor point).",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Ability to use/access the control panel without checking out a template",
    "author": "Robyn Barker",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Reason required is because Aetna wants to see the conditionality of the segments without giving access someone to check out the documents. Report would not work since we would need the paragraph and context as well.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "The \"Delete\" button on \"Send for Review\" page",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In the newer version of CLM (12.654.3), the delete button on the \"Send for Review\" page is disappeared. The customer would like to have the 'delete' button added back under Action? It's beneficial to be able to 'send for internal review' to track status, but not send the actual signature-ready pdf. Please see the screenshot below:",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enable version for \"Import Supporting Document\"",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When using X-Author check out and check in the \"Import Supporting Document\", the new version was not shown up under the \"Document Version Details\" section. We tested in different version of internal orgs and received the same result. We assumed the \"Import Supporting Document\" type of document is not fully supported by X-Author/Version Details. The customer has requested us to take a look into this and see if this something we can implement. Thanks!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Document Text/Clause  Approval - Highlight Sections",
    "author": "Linh Ton",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently approval doesn't highlight which section / text a user needs to approve. Customers are asking for a feature where the document will highlight each approver wtih the clauses they need to approve and allow contract admin to add more clauses for them to approve\n\n\nBenefit to the Approver: Quickly see where in the document they need to approve, eliminate scrolling, saves time.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "PDF to WORD conversion",
    "author": "Linh Ton",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Allow users to upload PDF and have CLM convert it to word",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Send for Review - Document Selection could be sorted by Last Modified Date",
    "author": "Rene Rodriguez",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer would like to see the most recent modified file regardless of v1,v2 sequence appear in the top of the Send for Review selection list",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Add an option to re-arrange the documents in Send For Proposal Page and then merge documents",
    "author": "Deep Joshi",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "After Generating the Proposal on any Quote/Proposal when we send send proposal there should be option to re-arrange documents in the send proposal page we can re-arrange imported documents but we cant re-order the generated documents",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Bringing back UI for Send for Review process in Sandbox",
    "author": "Leah Migacz",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When we use Send for Review in Lightning with Parallel Approvals enabled, we can't CC or BCC users. Our implementation partner suggested we ask to get the old UI for Send for Review enabled because this has that feature.\n\nWe need to be able to CC and BCC people when using Send for Review function. Otherwise internal users aren't notified when someone responds.\n\nCreate Agreement, Generate Agreement Document, Click Send for Review - currently no CC or BCC option.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Default the recipients for Send for Review based on previous review cycle",
    "author": "Michael Smith",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Typically there are multiple review cycles with the same recipients. It would streamline the process to automatically include the recipients from the previous review cycle.\n\nAnother option would be to add a button from an existing review cycle to start another review cycle that would use the same recipients.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Make CLM Document Versions selectable as Available Documents in Conga Sign integration",
    "author": "Eogan O'Donnell",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We recently presented a demo of Conga Sign to our IT contact at Nokia who owns their sell-side CLM implementation, and he was generally pleased with what he saw. He did, however, spot one gap in the CLM-to-Sign integration that he foresees as an obstacle to their adopting Sign.\n\nIn the integration's 'Create Transaction' page, the list of 'Available Documents' draws from the Agreement's related 'Files' or 'Notes & Attachments'. This is fine if you've produced a PDF as part of checking in a final Agreement Document revision (in which case the PDF is present in 'Files' or 'Notes & Attachments'), but if you haven't, and you instead want to send an Agreement Document revision, you have to search for it, which our contact viewed as a much-less-than-optimal user experience.\n\nNokia would instead like to see the latest revisions of all Document Versions also included in the 'Available Documents', exactly as is done in the Adobe Sign Adapter.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "DocuSign expiry date field on the account is a static value and that need to be dynamic",
    "author": "Jinay Panchal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "-- The ask was like can there be any call back which can tell the envelope to expire that \"X\" no. of days are remaining for it to get expire, based on some logic written, using some kind of API.\n\n\n-- The customer have done POC to call Docusign endpoint: https://demo.docusign.net directly to update the expirty date, but looks like it's not feasible in the OOTB Apttus managed package.\n\n\n-- So, is there any chance that Apttus can have such an API in upcoming releases?\n\n-- Case reference #00798003\n\nPlease consider this idea!\n\n\nThank you\n\nJinay",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "In the createworkpackage API, it will be good if there is a way to still continue process/algorithm in the same apex job, even after the \"Read Time out\" error in apex jobs",
    "author": "Jay Patel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When the \"Read Time out\" error appeared after cause by long process of merging file via createworkpackage API, it will be good if there is a way to still continue further process/algorithm in the same apex job.\n\nIn our use-case after we generate the final output file we are doing some other process like deleting temporary generated files, updating parent agreement and sending email notification.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "To have mark as presented field read only",
    "author": "Saurabh Pancholi",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer requested to have mark as presented button to be read only on the send proposal visual force page .\n\nAccount name:BD EMEA",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Please add HIDE BOUNDARY fetaure to platform send for review screen",
    "author": "Tracy Cannon",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "In XAC, the user is able to hide the smart boundaries. On the platform, the user loses his ability to control the 3rd party's experience with smart boundaries.\n\nPlease add a checkbox to the bottom.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "User should not be allowed to Send for e-signature if there are any kind of issue in Populating merge fields(DocuSign)",
    "author": "Raj Poshiya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Due to multiple reasons, it can be possbile that the merge fields on the email subject and email body do not get populated and hence the E-signature email are being set with inappropriate data.\n\n\nAsk: It should show some kindly of validation message and prevent user from sending it from E-sginature.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Executing fully signed document, now shows all ‘unselected’ items will be deleted from the agreement records",
    "author": "Jay Patel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When a User Activate an Agreement, while Executing fully signed document, now it shows all 'unselected' items will be deleted from the agreement records.\n\n\nAll the Documents are already/by-default selected, but we would like to keep All the Documents that are un-selected to stay in the same place as it was before i.e. Notes & Attachments or Files. It should not be deleted even if the Documents are not executed.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Active Agreement Copy to be sent via email and it should be tracked in Agreement history",
    "author": "Minhui Huang",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The customer would like to have an option to send out active Agreement Copy via email and wants it to be tracked in Agreement history",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Dynamic Forms Working With The OOTB Amend Controller",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "This functionality would be beneficial to reduce the visibility of non valuable fields on a page layout based on profiles.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Add Previous Amendments of an Agreement",
    "author": "Mufaddal Laxmidhar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Let's say there is a long running contract with a loyal customer.\n\nThis contract is handled in system in following way -\n\nAgreement A is an original agreement. User amends it and creates B for some use case and makes it in effect. User amends it again after some time and create C and make C in effect.\n\nNow if Customer wants to populate the details of Agreement A and B while generating the document for Agreement C, there is no way to do so.\n\nWe do not allow to add merge field of Related Agreements in X-author. that is where the relationship of amendment agreement is kept. Hence, there is no OOB way to serve the use-case atm.\n\nWe can allow enable merge fields from Related Agreement up to a certain level so that such use case can also be served.\n\nNote that : We need to allow to select related agreements of the related agreements so that, B's details can be fetched from C and A's details can be fetched from B.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Ability to fetch Parent's Child",
    "author": "Mufaddal Laxmidhar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently, X-Author allows to select merge fields for parent and child agreement. However, we can increase the utility of the same by considering this options.\n\n\n1. The selection of child agreement is not obvious at all, we can rename this as child agreements so that User is aware that this is possible. Refer Attachment. (The highlighted section actually pulls in values from child agreement)\n2. We do not have the ability to select child agreements of Parent. user may want to populate data for sibling to which he has does not have a direct relation but through the parent, he should be able to do this.\n3. We do not have an option to select Parent of a Parent. This could be especially helpful if a user is having loyal customer from like 4-5 years and wants to add the details of older agreements which he has setup as parents. We can ofc limit this to certain level.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Change the behavior of Adobe Sign Adaptor timestamp in Activity log",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Current State: Users are confused by the incorrect date and time stamps in the Activity log (completed Tasks) on the CLM Agreement record.\n\nIf you compare the Due Date with the Created Date you will see a huge time discrepancy.\n\nThe correct date and time stamps are in the Audit log from Adobe Sign.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Typeahead Search for Add Reviewer Screen",
    "author": "Mufaddal Laxmidhar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "There is disparity between the \"Add Reviewer\" Screen at following place -\n\n1. Add Reviewer while Sending for Review\n2. Add Reviewer from Review Cycle\n\nCustomer expects the search functionality at both the above places to be similar.\n\n\nFor Send for Review functionality, We have implemented Typeahead lookup feature for the \"TO\" field.\n\nHowever, for the other \"Add Reviewer\" screen(In Review Cycle), The typeahead lookup is not available. rather, Customer needs to perform multiple steps to achieve the same -\n\nType-in the Name, Click on Search Icon and then Select the Contact/User.\n\n\nIt would be great if we can bring consistency between these 2 screen which has the same use case of adding reviewer.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "End Users want the error message attached to give more specific details on where a corrupted merge is within a template.",
    "author": "Rene Rodriguez",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "(Charles River Laboratories) Technical users currently know that this XML error message points to a corrupted merge field or segment within a cloned/migrated template. Charles river laboratories wants the error message below to point to the exact merge field that is corrupted within a template or to even have the message say \"Check Template Merge Process\" so the business users know where to direct this error to.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "CC option while sending documents for Review in docx format",
    "author": "Rene Rodriguez",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Our contracting team wants an option to put the Account Managers in CC while sending the Agreements in .docx format for Review using Send for Review button. Currently the option is only available for .pdf attachments sent for the review. The business users do not want the Account Managers to be a part of the Review Cycle but should only be copied in the email sent for review.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Contracts Marketplace",
    "author": "Mahesh Krishnan",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Ideas for alternate revenue streams.\n\nCreate an open market place portal for creating/selling templates.\n\nAny contract creator can create templates/clauses libraries legal or any other type and publish them, with a set of online tools provided by us.\n\nSince we at Conga already have a technical know-how, we need to utilize our capabilities extend our functionalities for single-users/lawyers , small scale enterprises.\n\nThis portal should be purely self-service.\n\nEnd users can search for templates (search by ratings/popularity).\n\nProbably provide auto-recommendations for similar templates.\n\nThey can be given a form to fill out all the place holders within the templates (names,addresses,dates and other field values).\n\n\nWhen a document is generated by a user the original author of the template earns one time fee/or it can be recurring.\n\nConga earns a part of the fee. Probably earn revenues through contextual Ads/promotions.\n\nThis can also extended by integrating Conga sign.\n\nAdditionally features for document conversions/Intelligent OCR etc can also be provided on pay per use basis.\n\nLicensing/Pricing - Some features can by made available for free for certain number of uses. For advanced features suitably charge, price it.\n\n\nNote - This is applicable to any document template not just legal. It can be extended to policy document etc.\n\n\nAdvantages-\n\nBiggest advantage : We have a lot more user data and contracts data, which can be used for internal AI/ML, business intelligence purposes.\n\nWe create a large repository of clauses/templates which can be bundled and packaged as a value added services to other customers.\n\nAlternative revenue stream.\n\nGood marketing tool, prospective users can work with larger organizations and prefer to use Conga.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Enhancement of CLM Merge Web Service",
    "author": "Mariyan Topalov",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi all.\n\n\nThere's currently a Merge Web Service to create a PDF. 1 think I found missing is removing the watermark when creating the PDF. There's currently no way to remove the watermark, which results in the PDF having the same watermark as the source DOCX file.\n\n\nRegards,\n\nMariyan",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to specify a url params for this page(send for client review)that can override the reply-to email address found in the default Admin record. new Pagereference('/apex/Apttus__SendEmail?id=' +ids+ '&action=Send_To_Other_Party_For_Review')",
    "author": "Rene Rodriguez",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "(Requested by Charles River Laboratories) This would be useful for dependent business cases. This user wants to be ability to conditionally change the value on APTS_EndReviewEmailServiceAddress depending on the Agreement Type.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Send button while submitting an agreement for review should be made invisible after one click",
    "author": "Jinay Panchal",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer's suggestion:\n\n-- While sending an agreement for review it should not allow the user to click \"Send\" button for the second time.\n\n-- After the very first click of the \"Send\" button either it should be made grayed out so that user cannot click that again.\n\n-- Or after the first click a progress bar/pop up showing the progress of sending should be shown.\n\n-- By doing so the user would be aware that send is under process, they won't click again.\n\n-- Issue happening in current situation is user click twice and two emails are triggered which should not happen.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Generate Support Documents Document Naming Convention",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As of right now, when you generate a document you can determine the naming convention through a setting in Comply System Properties. It would be great to have the same option for when you generate a support document as well.",
    "votes": "4 Votes",
    "comments": []
  },
  {
    "title": "Scan the doc for tags before it gets submitted to DocuSign",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently when selecting Send for Docusign in Salesforce, there is no check on the documents for tags, so if the wrong document has been uploaded it will fail not knowing how to map attributes without doc tags. It seems that docusign has the ability to know if a document has no tags (if going through their UI) . The lightningagreementactionscontroller which controls the sendfordocusign process is managed, so we cannot alter it.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Email for the \"Parallel Review Failure Notification emails\" does not work with merge Fields",
    "author": "Jay Patel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The OOB (managed package) Email Template for the \"Parallel Review Submission Failure Notification emails\", it was just a Text message saying: \"Your email response doesn't have a valid attachment in it.\"\n\n\nBut users want to Add Agreement Merge Fields such as: Agreement Number, Name & Attachment Name (Document version Merge Fields), so that end users who have Multiple Agreements to review would have the reference to see which was Failed.\n\n\n- We tried adding these Merge Fields in that same email template but are not working, getting blank when received an email.\n\n- These Merge Fields are working for the \"Parallel Review completed Notification emails\", but for Failure notifications, its not fetching the values & its getting blank merge Fields.\n\n\nthe basic argument can be, if it works fine for Review Success/Completed email, then it should work for Failure email as well.",
    "votes": "3 Votes",
    "comments": []
  },
  {
    "title": "Need flexibility for user to Add End Review button in Review Status Page during Parallel Review",
    "author": "Asha Nair",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team,\n\n\nOne of my Client - NIIT Limited, want to have flexibility to do End Review for all users at one go, instead of ending review of individual users.\n\nCurrently we have Cancel Review available when we select all the reviewers. As per the need, End Review button should also be placed next to Cancel Review so that user can do the end review at one go.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Have option to default Publish toggle to false instead of true when activating an Agreement record.",
    "author": "Carrie Bellio",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Current State: Users have to deselect each attachment that they do not want to publish, instead of all of the attachments showing as deselected first, and then selecting the final document to get published. This would provide a better user experience.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Mark for removal feature should delete Smart field and as well as the content from the Generate Document in XA.",
    "author": "Raj Poshiya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Currently if we use Mark for Removal for any Smart field in the generated document it only removes the smartness of the field and not the content on the Check-in action.\n\nIt should also remove the should delete Smart field along with content from the Generate Document in XA.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Lite License: Only Successful login should be counted as a login count for Lite users",
    "author": "Ramya Dasaratha",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "While conting the logins for Lite users only Successfull Logins should be counted and not the failed ones.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Only Successful login should be counted as a login count for Lite users",
    "author": "Raj Poshiya",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "While conting the logins for Lite users only Successfull Logins should be counted and not the failed ones.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "in Smart Search suggestions for natural language, mention to add double-quotes explicitly for searching keywords",
    "author": "Jay Patel",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "in Smart Search suggestions for natural language, mention to add double-quotes explicitly for searching keywords, as it can be confusing for users and they directly search for Keywords wihtout adding the Double quotes giving them wrong search-results.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Comply with Docusign setting to not send Activation emails",
    "author": "Ankur Prasad",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Our CLM docusign integration packages, should comply with the Docusign Settings to auto-activate the user and not send the Activation emails to users.\n\nSetting in Docusign is -Auto Activate Manually added memberships and suppress activation emails. If this setting is checked in Docusign then while any non-docusign user, sending for e-signature, our Code should Auto provision the user, activate them and do not send activation emails to users. Please refer to JIRA- https://apttusdev.atlassian.net/browse/DSIGN-623",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to restrict email notification on Activation",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Whenever an agreement is activated, we get OOB email notification to the owner of the agreement. Is there any way to prevent this email notification being sent? We do not want to notify the Owner as he / she is the person activating this agreement.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Increase the length of the TEXT Content on template object from 32768 to 131072",
    "author": "Ankur Prasad",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer has clauses of greater length to be used. Hence the length of the field TEXT CONTENT on template object has to be increased from 32768 to 131072",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "OCC for Partner Community",
    "author": "Jigar Naik",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "We are getting many requests to enable OCC in the partner community. Can we evaluate the same for partner community?\n\n\nAlso, it would be great to have an option to provide some kind of agreement document collaboration access to the customers who may not be salesforce users.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Availability to set multiple context user on same org for CLM and Approval Products.",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Booking Holding has many email domains such as booking.com (http://booking.com/) , priceline.com (http://priceline.com/) etc.\n\nWhen email is going out of Apttus it should have correct domain depends on whether CLM user belongs to priceline.com (http://priceline.com/) or booking.com (http://booking.com/)\n\nTo best of our knowledge there is only one context user and domain in single salesforce CLM org.\n\n\nTicket logged :\n\nMulti domain emails from CLM for Booking.com: https://apttus2portal.force.com/s/case/5003Z00001CLFPiQAP/multi-domain-emails-from-clm-for-bookingcom\n\nNOTE:\n\n1.We have logged this as Major Enhancement request\n\n2. Is this Blocker for Go-live? YES\n\n3. Is escalated by Customer ? YES\n\nEngagement Manager : Eugene Kushnir (https://apttus2portal.force.com/s/detail/0031U00000AEkyxQAD)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Importing Offline Doc & also with Check-In/Check-Out",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "When we upload a document using the import offline document, the check-in/check-out throwing an error.\n\n\"INVALID_TYPE: sObject type '' is not supported. If you are attempting to use a custom object, be sure to append the '__c' after the entity name. Please reference your WSDL or the describe call for the appropriate names.\n\nSystem.Web.Services\"\n\nThe same document used from XAC we are not receiving any error.\n\nPlease fix this issue in the import offline document from salesforce.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Provide Permission sets to control the Merge Document Actions on CLM",
    "author": "Ankur Prasad",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Use case: Customer wants to limit the merge document action to a specific set of profile or users and they want to use specific permission sets for this.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Prove a custom setting to just see pdf files when performing send for eSignature.",
    "author": "Ronak Dhokai",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Since the CLM and DocuSing Summer '21 release, DocuSing started respecting Document Versioning. Earlier it use to only fetch the details from Notes and Attachment.\n\n\nThis change has led to a behavior where all the Files, be it pdf, doc, docx, from both Notes and Attachment as well the Document version are available to the user when sending for eSingature.\n\n\nThis is a major change to adapt and it gives freedom to the user to send out Doc and docx files for Signature and that is not a desireable outcome for the customer.\n\n\nPlease provie an OOB Custom setting to control this behavior.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Prevent creation of multiple DocuSign envelopes at the same time",
    "author": "Joseph Franklin",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "After user selects the file and clicks send for signatures and then immediately clicks back, because of lightning latency issue, agreement page does not immediately refresh, and still shows status as pending/ready for signatures with send for signatures button still showing up. Now the user can send for signatures again, select file and go through the process all over resulting in 2 envelopes getting created (I have noticed if the back button is clicked too soon, status of the first envelope remains blank). However, Docusign console shows 2 envelopes with the status 'Waiting for others'. In this scenario, the recipient would receive two emails with separate envelopes and is able to open and sign both. After signatures are completed, batch jobs that run at every 15 min interval in the background look for any signed envelopes and insert the signed document under files, then update the agreement status to fully signed and update the envelope status to Completed. If the recipient had signed both envelopes in this case, we see both signed docs under Files section, but the Agreement/Envelope Status update fails.\n\n\nI think we can put in some logic to prevent creation of multiple envelopes at the same time or almost immediately after first envelope is created.\n\nThis has been a consistent and major issue for Fannie Mae (Case#'s 00105836 & 00115083) even after several user trainings and needs some control to built in to the product.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Requesting the DOCX limit for Send and Review or Parallel Review increased from 10MB to 20MB (Ideally 30MB)",
    "author": "Kharl Cultura",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer would like to request this feature for them to rollout their current solution which will require higher file capacity.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga Mix Forms / Adding Feature/Functionality to have Different Form Group Categories",
    "author": "Atta Mmorosa",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer would like a better way of categorizing or sorting there various form groups since they have so many and they are saying its cumbersome of trying to filter to find what they want since everything lives on one page\n\nCustomer use case response:\n\"We really need a way to have multiple Form Groups Categories. We have so many form bundles that we need a way to categorize this better. We would need different Groups for Account Opening, Compliance & Cashiering. We have about 30+ form bundles per each category needed internally & for NFS, so to have them all on 1 page with no way to organize this.\"\n\nThanks!",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Adobe agreement Naming convention is not supported based on Agreement template",
    "author": "Pavan Kumar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As of today the naming convention on Adobe agreement Name is not supported based on the Agreement template configuration. It would be good if we have this feature.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Adobe agreement Naming convention is not supported based on Agreement template",
    "author": "Pavan Kumar",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "As of today the naming convention on Adobe agreement Name is not supported based on the Agreement template configuration. It would be good if we have this feature.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "To add internal users to DocuSign Recipient Object",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "The use case where if we have few internal users and they get added to DocuSign Recipient Object by code.\n\nNow when a Sales Rep click on Send for Signature then these users show up on the Send for Signature Page. Where also there can be the below restrictions for Sales Rep to:\n\n1. Should not be able to delete any prepopulated Internal User\n2. Should not be able to update Email address on the Internal User",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "User wants the flexibility to customize the Watermark in Conga CLM",
    "author": "Asha Nair",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "User wants the flexibility to customize the Watermark in Conga CLM.\n\nit would be good to give the flexibility to customize the watermark eg : Name, font, alignment etc",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "OOTB Configuration of A-CLM Landing page in Lightning",
    "author": "Landon Bell",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer asked the necessary steps to configure their landing page to resemble the MDO CLM Homepage as attached. Is there a template available that resembles the attached image.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Need the ability to hide the page that is shown after DocuSign request is sent",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Customer has requested a configuration option to not show the additional page at all after DocuSign envelope is created.\n\nThis page provides the job id and then either User has to click on 'Back to Agreement' button or in a few seconds the user is automatically rerouted back to the agreement.\n\n\nSince there is the option to automatically route the user back to agreement after a few seconds and the information on the page does not add any value, request from the Customer is to remove this page altogether.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Termination Process - Generate , Approvals, Signature",
    "author": "Asha Nair",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Client Name - Sony\n\nCurrent termination Action does not have any process associated, it just updates status/status category of the agreement as Terminated.\n\nUser requirement is to have Termination process in place which should allow user to provide inputs for following fields :\n\nEffective Termination Date\n\nTermination Reason\n\nComments\n\nOnce done, user should generate the termination letter, send for approvals, send for signature etc.\n\nFinally agreement should be terminated on the effective termination date.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Amendment Process - Fields from parent agreement fields to be displayed for comparison",
    "author": "Asha Nair",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Client Name - Sony\n\nWhile a new Amendment request is in process, all the field values from the parent agreement need to be populated for reference along with the date of the previous agreement/amendment on the amendment agreement.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Conga CLM package can have support to all the languages based on customers regions.",
    "author": "Kumar Chavda",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Hi Team ,\n\nWe are creating this Idea based on issue (00117853) created with Conga Support.\n\nAny organization structure depends on different regions across the globe , we emphasize conga to provide support to all the languages that are supported by Salesforce.\n\nCLM Conga is being used in by many organizations in different regions across the globe., hence we recommend conga to provide the functionality of language selection. Based on region user can change the language and Conga package related fields are available in the UI based on the selection of a language. (Setup > Translate).\n\nThanks,\nCoopervision Team.",
    "votes": "2 Votes",
    "comments": []
  },
  {
    "title": "Need ability to configure visibility of 'Add more' document action in \"Send for Review\" and \"Send for Signatures\"",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Our Customer has very specific requirements on implementing controls within CLM system. Each document that certain users send out from system for review or signatures should have been available in CLM system and approved.\n\n\nWe have the actions 'Add more' document action in \"Send for Review\" and \"Send for Signatures\" Conga pages which conflicts with the control that the Customer wants to achieve within Conga.\n\n\nAsk from the Customer:\n\n* Ability to define which set of Users will be able to see and execute on this action - managed using Custom Permission (through Permission Sets)",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Termination Process",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Client Name - Sony\n\nCurrent termination Action does not have any process associated, it just updates staus/status category of the agreement.\n\nUser requirement is to have Termination process in place which should allow user to provide inputs for following fields\n\nEffective Termination Date\n\nTermination Reason\n\nComments\n\nOnce done, user should generate the termination letter, send for approvals, send for signature etc.\n\nFinally agreement should be terminated on the effective termination date.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Amendment Process - Fields from parent agreement fields to be displayed for comparison",
    "author": "SF Integration Service Account",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "While a new Amendment request is in process, all the field values from the parent agreement need to be populated for reference along with the date of the previous agreement/amendment on the amendment agreement.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Ability to override DocuSign email Subject and Body with dynamic content when sending a document for eSignature via UI and/or API",
    "author": "Shahrokh Parvaresh",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Today we don't have a way to override the DocuSign email (subject and body) with dynamic values from Salesforce (like mergefields from agreement) and that is what we require for Salesforce implementation.\n\n\nThe internal method does not take the email subject/body as parameters and the REST API cannot be called from within Salesforce. The custom label override only handles static text and not data coming from the agreement record.\n\nIt would be great if Product provides a mechanism to override the subject and body of the DocuSign email with the content from the agreement record both via API and from the OOTB send for eSignature page/buttons.\n\nIf the UI based scenario is not something that can be done easily, alternatively provide the API that can be used within APEX and give us ability to add a new button or to override the existing buttons on the OOTB page so we have the option to use a dynamic email template consistently from both the API and UI.",
    "votes": "1 Vote",
    "comments": []
  },
  {
    "title": "Send for Review/Signature requires 'APTS_DefaultEmailContactName'",
    "author": "Niraj Ittan",
    "product": "Conga_CLM_(fka_Apttus_CLM)",
    "content": "Whenever we have a requirement to an email to non-contact/non-user email id (by typing in the email address) we are needed to create an Admin Entry \"'APTS_DefaultEmailContactName' \" and put in a valid contact from the org.\n\n\nThis contact is then copied in all the emails sent out using 'Send for Review' & 'Send for Signature' .\n\n\nThis is not good from a Customer's perspective as this additional email is always copied on their sensitive legal document emails and also customer is required to create/maintain a working email for this. We need to enhance this feature and remove the requirement of having to add a Default contact. (In the advance Send for Review i.e. parallel review we are not required to have this Contact).",
    "votes": "2 Votes",
    "comments": []
  }
]